{
    "descs": [
      "A podcast where I talk about the music I like.",
      "<p>Some addicts&nbsp;chase&nbsp;the&nbsp;dragon. Others&nbsp;chase&nbsp;the&nbsp;danger. These two addicts&nbsp;chase&nbsp;moments, provided by&nbsp;the&nbsp;band Phish.&nbsp;Stand-up comedian Mike Finoia (Impractical Jokers, Amigos Podcast) and author Mike Shields (Across&nbsp;the&nbsp;Margin) have been feverishly following&nbsp;the&nbsp;Vermont quartet for over half of their lives, and their desire&nbsp;has yet to diminish.&nbsp;Now they look back at a lifetime of adventure, experience, and gratitude for this singular band that has given their fans unlimited moments to&nbsp;chase.&nbsp;Includes never before heard interviews with Ken Kesey, Tom Marshall and other members of the live music community.&nbsp;</p>",
      "<p>The definitive overview of the Dead's celebrated live show releases. Hosted by music journalist and podcaster Steven Hyden and fellow music journalist Rob Mitchum, this series will chronicle each live release, breaking down the historical context of the show while discussing musical, political, and sports-related trends of the time.&nbsp;</p>",
      "Because modern radio blows",
      "Progressive House UK is a Progcast station and Progressive House mix show for like minded people. We create & share unique content, discuss the music, UK events, DJ stories and general memorabilia from the scene. Join us on on spoken Progcast for News, Throwbacks and progressive observations of the scene today. Tune into our residents Mix show and enjoy unique mixes from guest DJ's You can also find us on Instagram. \n\nMusic is our shared DNA. ",
      "Each week, join Night Owl Country Band and host Casey Johnson as they count down the top ten songs in independent country music!",
      "sPoTiFy iS BeTtEr tHaN ApPlE MuSiC BeCaUsE It hAs MoSt lIsTeNeD To mUsIc oF THe YeAR.  Not this year!! Apple music has added a 2019 recap. Spotify Wrapped Up is the show that will explore guests' most listened music of the year. ",
      "<p>Rock legend David Crosby, in conversation with his friend, author Steve Silberman—covering everything from David’s collaborations with Bob Dylan, Jerry Garcia and CSNY; to recent music created with his son James Raymond.&nbsp;Brought to you by Osiris Media.</p>",
      "SojuTalk Kpop Podcast is Your Weekly Shot of Kpop. Listen to the SojuTalk Crew as we cover fuego releases, spicy breaking news, and give our hottest takes on the world of Kpop.",
      "Kinks and Beats is a daily look at two of the greatest musical acts of all time. Every day, host Tony Frye will tackle one song from The Beatles or The Kinks and discuss aspects related to music theory, cultural impact, or just his own thoughts about the song. \n\nListeners are encouraged to call in to the show and leave a voicemail about their favorite/least favorite tracks for inclusion in future episodes.",
      "John Banther takes classical music fans behind the scenes with interviews, deep dives, and analysis. Episodes released bi-weekly on Tuesdays. Produced by Classical WETA in Washington, D.C.",
      "Two grammy winning artists going on about their day to day endeavors in their newly found fame... or in reality two guys just talking about quirky topics. From music reviews to concerning thoughts, we got it all!",
      "A wide-ranging, three-person conversation on the topic of music, featuring Brian Oake, John Heidt, and Tommy Mischke.",
      "Confucius and Fresh talk all things hip-hop.",
      "Two lifelong friends discuss the albums of their favorite band, RUSH",
      "Osiris Media presents The Drop, a weekly podcast sharing the week's music news, artist interviews, festival previews and coverage, and highlights from across the Osiris network. The Drop is brought to you by CashorTrade. Osiris works in media partnership with JamBase.",
      "Jen Allen and Noah Baerman, co-leaders of the jazz group Trio 149, get together to talk about music, philosophy, navigating through life, and all sorts of intersections among them. ",
      "The Home for Compelling, Unconventional Urban Media Content",
      "A&nbsp;podcast about listening to and playing music better from musicians Peter Martin and Adam Maness. Listen for a combo of actionable advice and occasional humor. A podcast from <a href=\"https://www.openstudionetwork.com/?utm_source=podcast&amp;utm_medium=organic&amp;utm_campaign=youll_hear_it&amp;utm_content=no_episode\" target=\"_blank\">Open Studio</a> - \"Jazz Lessons from Jazz Legends.\"",
      "Music Industry Analysis, Interviews, Tips, News, and Reviews",
      "Smoke Signals, a Smoke Fairies podcast. \nDiscussing the music industry; it's trials, tribulations and hilarities as told by British band Smoke Fairies.",
      "Two indie rock musicians, Bill Lambusta and Brian Erickson, dive into the fandom of great rock and pop music and how it connects to their lives through the lens of the medium they care for most, the album. Episodes frequently include guest contributions from musicians, podcasters, and journalists and always culminate in a track by track review.",
      "Eat up!",
      "None But the Brave takes a comprehensive look at the music and career of Bruce Springsteen. Hosted by film producer Hal Schwartz and Backstreets Magazine contributor Flynn McLean.",
      "20 The Countdown Magazine is a weekly top 20 Christian music countdown show hosted by William Ryan, III featuring artist interviews, Christian music news, and the latest Christian music!",
      "Two friends with opposite tastes in music come together to bond over music and discuss what they learn that week.  A weekly music show for the everyday listener.",
      "<p>Telling the stories of rock &amp; roll pioneer Sister Rosetta Tharpe, dance hall singer Dora Hand, WW1 spy Mata Hari and more, singer-songwriter Frank Turner talks to historians, poets and fellow musicians about twelve historical women who have been largely forgotten but should be celebrated. And his mum. Every Wednesday, starting on July 3rd, Frank will release a new song and explore the story behind it in a new episode of the podcast. No Man’s Land the album is available for <a href=\"https://FrankTurner.lnk.to/NoMansLandpo\" target=\"_blank\">pre-order now</a>. A Frank Turner, Xtra Mile Recordings and Somethin’ Else production.&nbsp;&nbsp;</p>",
      "A storytelling podcast about the lows and lows of being a musician. Each episode premieres a song from Fletcher’s upcoming album, Are You Feelin’ It, while divulging tales of addiction, homelessness, songcraft, love, and violence.",
      "It's hard to keep up with all the new K-pop releases and even harder to get an insider look at the K-pop industry. Each Monday, join Eric Nam, a long-time veteran in the industry as both a K-pop artist and celebrity personality, as he reviews the week's best new songs and occasionally interviews the artists themselves. If you like K-pop, curious to hear what it's like to be a K-pop artist, or are simply interested in learning more about the industry in general, this is the podcast for you. \n\nConnect with us on Instagram, Twitter, and Facebook @daebakshow and @thedivestudios.",
      "A podcast about the musical history of Christian rock group Living Waters, hosted by Mark Lajoie, lead singer of the band. www.reverbnation.com/livingwaters\nhttps://open.spotify.com/artist/1QXw5rKD18g4arVeiiT2st?si=QA4F6KmtRwiacA_8t8hLYw",
      "Sawyer & Maya are friends who met through their mutual love for traveling to see their favorites artists in concert! Hint: the podcast name is a lyric! They’re here to bring a little more brightness to your Mondays! Sit back and relax or click play while you work! Either way, these two are here for your entertainment! Follow us on Instagram and Twitter @takesusshow or our personals @sawyerknight & @bluemymind",
      "SETLIST is the music business podcast from CMU, sponsored by 7digital.\nCMU helps people navigate and understand the music business through media, training, consultancy and education.",
      "The Freight Train Boogie podcasts are all about Americana and roots music. Most shows feature new songs from great independent artists. All of the songs featured on the show were written and published by the artists and they have given us permission to use their tunes on these podcasts. Enjoy!",
      "The podcast about KISS, KISS fans, and other KISS podcast!",
      "DJ Flossy aka Jess Manske hosts her radio show \"The Flossy Feed!\" Each show, you get \"Flossy's Pick,\" a song Flossy is really sinking her teeth into that week and sets the mood for the show.  A trendsetter with diverse taste in music, she keeps you aligned with the jawbreaking jams and the shiny new songs that make you smile. The show features energetic DJ mixes from Flossy and her DJ/producer friends, as well as their newly released songs and remixes! Tune into the Flossy Feed and don't forget to Floss every day!",
      "The Tablo Podcast is hosted by rapper, writer, luminary, dad, and guru Tablo of Epik High.\n\nThis K-pop Asian dad will have people laughing their butts off with his unique brand of dark humor, tearing up with heartfelt stories, learning valuable life lessons, geeking out over geek-worthy subject matter, and tickling their intellectual curiosity through his deep conversations with amazing, eclectic guests.\n\nThis podcast is not the podcast we deserve, but the one we definitely need.\n\nConnect with us on Instagram and Twitter @thetablopodcast and @thedivestudios for life-changing content.",
      "Whether you're a new KPOP fan or a KPOP OG, let NYAFG be your stop (every Tuesday) for all the Korean pop culture news, comebacks, and general tea that you might have missed within the week. We know it's hard to keep up, so let us do it for you! \n\nSend in your requests or questions to us at \nwww.twitter.com/NYAFangirls",
      "Sharing cool stuff since 2013",
      "'The Makings of an Artist' is a podcast hosted by Sebastian Cowsill, in conjunction with Walden Productions. This show is a mix of both interviews with real artists and bands, as well as biography styled episodes. Both aim to tell the story of how a particular artist or band leaped into the public's eye. Everyone's story is told as accurate as possible, detailing all the struggles, setbacks, and heartbreaks that each artist has gone through, showing that even the greatest didn't make it easy.",
      "A Conversational podcast where Soraya & Jeff talk about their favorite music, namely the Paisley Underground movement that came out of Los Angeles in the early 80's.",
      "<p>A lovingly crafted podcast that reveals the stories behind the world's most recognizable and interesting sounds.</p>",
      "Just some Americans trying to make sense of Eurovision",
      "<p>What makes pop songs so catchy? Musicologist Nate Sloan &amp; songwriter Charlie Harding pull back the curtain on how pop hits work their magic on our ears &amp; our culture. You’ll fall in love with music you didn’t even know you liked.</p>",
      "ミムラ セイゴのポッドキャスト！",
      "Cool Nights is a weekly jazz show hosted by Steve Hart. The programme features mainly jazz and soul music and is broadcast by radio stations around the world. Show sponsorship opportunities are available.",
      "Musician and host Laurie Gallardo recaps tonight’s best bet for a great Austin music experience.",
      "Bringing you the latest and greatest in Trance and Progressive House music. Hosted by George McCauley",
      "The Local Glow is an independent podcast production based out of Chicago, Illinois, created by Tariq Shihadah. Through our featured interviews, live performances, and story-telling, we dig into the heart of local music and arts throughout the Midwest and beyond, uncovering what makes your art and music communities come to life. This podcast is a celebration of art and the unique relationships that it fosters as it draws individuals from different worlds into a space where we all feel a little more alive. This production is also here as a resource to connect you to your local music community and to connect your local community to its rich and ever-changing neighbors around the Midwest and beyond.",
      "Classical Guitar Composers is a podcast for composers to share their works for classical guitar with other guitar enthusiasts. Listeners contribute recordings of their works to get them heard by classical guitar players and fans.",
      "We are a group of guys podcasting about the music of singer/songwriter Jimmy Buffett -- as viewed from the Great Lakes State. But since there is beer involved, who knows what we will end up talking about.\n\nNow that we've recorded more than a hundred episodes, we've decided to split the feed up. The latest shows will continue here. If you want the first hundred, look for the Wasting Away on the North Coast (Archives) feed.",
      "The Style & Vibes podcast is where Caribbean style and culture collide. Hosted by Mikelah, founder of Style & Vibes, you’ll get to know from Caribbean tastemakers and celebrities across the globe in dancehall, reggae, soca and more!",
      "A quick podcast about new releases, the charts, and fun music escapades, hosted by Bob Nanna.",
      "Blink-182 have 155 songs. Josiah and Sam are going to talk about all of them.",
      "An unofficial podcast for fans of Teenage Engineering featuring artists, news, tips and tricks, etc.  Hosted by FLDPLN.",
      "The LJS Podcast is the podcast where you get weekly jazz tips, interviews, stories and advice for becoming a better jazz musician! Hosting the show is the jazz musician behind learnjazzstandards.com, author, and entrepreneur Brent Vaartstra, who’s one goal is to answer any question about playing jazz music you may have. Jazz can be a challenging music to learn and play, but it doesn’t have to be so hard. Each episode features a specific musical challenge that jazz students may come across, where it is discussed and answered. Special jazz guests frequent the show, sharing their expertise on an array of different musical subject matter. Listeners are invited to call in with their jazz questions to the podcast hotline, where it could get answered on a future LJS Podcast episode.  Join thousands of other listeners getting free jazz education every week!",
      "\n      <p>Welcome to Night Vale creator Joseph Fink and the Mountain Goats singer/songwriter John Darnielle discuss what it means to be an artist, a fan, and, as many people are, both at once. Season Two explores the process of writing, recording, and releasing the Mountain Goats’ latest album, <em>In League With Dragons</em>, giving you an unprecedented look at the creative process as it is happening.</p>\n    ",
      "\n      <p>The Popcast is hosted by Jon Caramanica, a pop music critic for The New York Times. It covers the latest in popular music criticism, trends and news. </p>\n    ",
      "Welcome to Ginger Anne's Jam bands. Let's explore albums, music news,  live concerts and festivals related to the unique Jam bands fan culture. Blues, Bluegrass, Roots, Rock, Reggae, and Americana. Support live music, and jam on. Share bands with me at GAJamBands@Gmail.com.",
      "Interviews and more with the biggest names in Progressive Rock",
      "Patrick Foster and Jim Lenahan have a new podcast! Come join two (not so) ordinary family guys in the basement (or on the deck) as they talk about their lifelong obsessions with music. Now ... 5 days a week!",
      "Every week Will, Barrett and Chris feature an independent or alternative artist or band, have some fun discussion, and play some music.",
      "Weekly album reviews, interviews and roundtable discussions digging up the 90s",
      "An educational, informative, and irreverent look at all things Beatles.",
      "A great place to discover and relive vintage and modern rockabilly, blues, surf, roots, r&b, oldies, etc.  Hear favorites and obscure tracks as well as exclusive interviews",
      "Best known for his 1000 plus remixes on Crooklyn Clan, DJ David S continues to make his mark in the dj game. Born and raised in New Jersey, David is veteran with over 10 plus years in the club business.. For all bookings contact thedjdavids@gmail.com",
      "From Jazz masters of past and present to emerging new artists performing modern jazz and fusion. No smooth jazz here!"
    ]
  }