{
  "descs": [
    "No rules. Just long form conversation about topics that interest us. Warning: we don't talk that much about climbing. ",
    "Scott Van Pelt, the popular SportsCenter anchor and former ESPN Radio host will present a weekly show that will include long-form interviews, commentary and expanded takes on his \"One Big Thing\" segment on SportsCenter. SVP will take deep dives with guests and topics in an entertaining way that only he can. Stanford Steve, host of Stanford Steve & the Bear podcast and a producer on SVP's SportsCenter, will be involved, as always.",
    "Cowhorse Full Contact is a podcast hosted by Chris Dawson and Russell Dilday produced by Ben Self. In each episode, Chris and Russell interview a guest and discuss cow horse stories and topics that can help people in the cow horse industry. ",
    "<p>Yahoo Sports experts Terez Paylor and Charles Robinson take you inside the front offices and locker rooms of the NFL for an engaging discussion about the game of football.</p>",
    "\n      <p>The White Sox Talk Podcast brings you unparalleled insight and access to the White Sox. Featuring interviews with current/former players and coaches, we’ll tell you why something happened yesterday, and what’s likely going to happen tomorrow. Featuring Chuck Garfien, Ryan McGuffey, Chris Kamka and Vinnie Duber.&nbsp;</p>\n    ",
    "The Steam Room is the new audio vehicle for two of sports media's most iconic personalities, keeping the conversation going beyond from the desk inside Studio J. After nearly 20 years on TNT's Inside The NBA, Ernie Johnson and Charles Barkley still have a lot to talk about, and with this platform they'll tackle new topics in the classic unscripted style that fans have come to love. In addition to NBA talk, EJ and Chuck will dive into current events, pop culture, and even local news. Look for The Steam Room on Thursdays starting December 12th.",
    "\n      <p>Jack Settleman will be interviewing internet celebrities.</p>\n    ",
    "<p>We’re Talkin Yankees Baseball! Series Recaps, Weekly Awards, Interviews, Some Stats, Some Jokes, Contests and a Lot of Fun! Hosted by Jomboy and Jake.\nFor advertising opportunities please email PodcastPartnerships@Studio71us.com\n\n<br><br>Link to survey: https://bit.ly/2EcYbu4</p>",
    "The Athletic’s Michael Cox & Ali Maxwell break down the tactical & technical details of football past & present, focusing on a single subject each episode with the help of expert guests.\n\nSubscribe to The Athletic using the special promo code zonalmarking  and receive 40% off! Also, subscribers will have access to exclusive episodes.\n\nSIGN UP NOW: http://theathletic.com/zonalmarking",
    "Club legend Lee Dixon joins The Athletic's Amy Lawrence, James McNicholas and comedian Ian Stone to bring you a weekly podcast on Arsenal Football club. They'll  discuss some of the most fascinating stories from Arsenal's past, as well as expert insight from inside The Emirates every single week.\n\nSubscribe to The Athletic using the special promo code ARSENALPOD  and receive 40% off! Also, subscribers will have access to exclusive episodes.SIGN UP NOW: http://theathletic.com/arsenalpod",
    "Mark Chapman and The Athletic's David Ornstein break open the week's biggest stories and take you deep into the inner workings of the football machine.\n\nSubscribe to The Athletic using the special promo code ORNSTEINANDCHAPMAN  and receive 40% off! Also, subscribers will have access to exclusive episodes. \n\nSIGN UP NOW: http://theathletic.com/ornsteinandchapman",
    "Hockey icon Don Cherry talks hockey and more!",
    "<p>Inject The Power of Positivity straight into your earholes with THE NEW DAY: FEEL THE POWER, hosted by WWE Superstars Kofi Kingston, Big E &amp; Xavier Woods. Every week, ya boys will be telling personal stories from in and outside the ring and engaging in passionate debates on some of their favorite topics, including sports, video games, music and more. Nothing is off limits, from Booty O’s to pancakes to everything in between. New episodes will be available weekly, so don’t you dare be sour. Hit that sweet, sweet subscribe button, and feel the POWERRR!\n \nFollow us @thetruekofi, @wwebige, @xavierwoodsphd. Produced by the Official WWE Podcast Network in partnership with Endeavor Audio.\n \nTo see how we use your data, visit https://www.endeavoraudio.com/privacy-policy</p>",
    "You've heard him on KSR, but now you can hear Matt Jones like never before with extended one-on-one interviews with guests from in and outside the sports world.",
    "Hosted by Daniel Vitalis, The WildFed Podcast is about deepening your connection with the natural world through hunting, fishing, foraging, and, of course, food. It’s about the wild food that’s freely available on your landscape, at the edges of your town or city, and sometimes just outside your door. The podcast consists of interviews with biologists, authors, wildlife managers, foragers, hunters, anglers, chefs, friends, and plenty of educational and inspirational solo shows too. WildFed — Food Is All Around You.",
    "The Triathlon Taren Podcast with Taren and NTK (No Triathlon Kim), features pro triathletes, heavy hitters in the triathlon world, age group triathletes from around the world, and coverage of races and triathlon events.  Every Sunday night on the Triathlon Taren Podcast you'll hear fun, engaging and informative tri-related interviews from the triathlon world led by Taren and NTK.",
    "The only Official Podcast from Chelsea FC, hosted by Mike Ryan Ruiz and Chris Wittyngham. Each week you'll hear exclusive insider interviews with A-list guests plus a unique blend of Chelsea analysis, pop culture and humor. An uncensored and uninhibited discussion on the world of soccer through blue-tinted lenses.",
    "In a league that changes at the speed of social media, Kristen Ledlow & Candace Parker use their unique insight, knowledge & connections to keep up with the latest breaking storylines in \"Ledlow & Parker\". Every Tuesday, listeners will go behind-the-scenes with one of the league's most plugged-in insiders and one of the most decorated athletes to ever play the game. Ledlow & Parker go beyond with their guests, using their respected voices and in-the-know perspectives to discuss sports & culture.\n \nListen in each week with \"Ledlow & Parker\"! They see the game differently.",
    "Ducks Unlimited Podcast is a constant discussion of all things waterfowl. From in-depth hunting tips and tactics, to waterfowl biology, research, science, and habitat updates. The DU Podcast is the go-to resource for waterfowlers and conservationists. Ducks Unlimited is the world's leader in wetlands conservation.",
    "The best information on everything relating to waterfowl. From tips and tactics, to in-depth looks at companies and gear. ",
    "Hosted by Corey Graves, “After the Bell” is an official WWE podcast that gives you a provocative look at the latest in Raw, SmackDown and NXT. Featuring exclusive Superstar interviews, “ATB” examines the world of WWE both between and beyond the ropes in a way that’s as edgy and unpredictable as Graves himself.\n\nTo see how we use your data, visit https://www.endeavoraudio.com/privacy-policy.",
    "Nothing Personal with David Samson is a daily sports podcast hosted by David Samson. No guests. No callers. No BS. 45 minutes per day, Monday-Friday. David is dedicated to decoding the endless musings of players, owners and others in a concise, articulate and entertaining manner. Samson was in charge of a Major League Baseball team for 18 years, with winning a World Series ring, building a new ballpark, hosting an All-Star game, and buying and selling a franchise, among his many experiences and accomplishments.  His breadth of knowledge covers all aspects of sport. This podcast will be the destination for fans of sports and entertainment who want to hear the truth about real situations as they occur each day. Every segment will give his audience a unique perspective, not found anywhere else. His voice is strong and unwavering, his brand is honesty and his reach is extraordinary. And remember, it's just business...It's nothing personal!",
    "<p>NBA analytics pioneer and front office insider John Hollinger joins Dunc'd On podcast host Nate Duncan to bring you the smartest weekly NBA podcast available. The Hollinger &amp; Duncan NBA Show brings fans next-level analysis of the league, its teams, and its players. John and Nate take you behind the curtain for an unmatched insider look at every aspect of the NBA. From scouting reports to game breakdowns to salary cap analysis, there’s no better way for true basketball fans to follow the NBA. Part of the Locked On Podcast Network.</p>",
    "Hot Takedown is the weekly sports podcast from FiveThirtyEight. On it, the crew uses numbers to dissect the week in sports, taking down some silly hot takes in the process.",
    "Wake up to the best sports story you'll hear all day. Monday through Friday, host Mina Kimes brings you an inside look at the most interesting stories at ESPN, as told by the top reporters and insiders on the planet. The breaking news of SportsCenter. The deep dive storytelling of 30 for 30. Get the very best of ESPN. Daily. ",
    "The official podcast of multi-time champion in X-Games, Rally and Offroad - Brian Deegan! Fathering the crazy life of a family of racers winning championships in different sports! Hailie Deegan - the first female to win multiple NASCAR races on her way to NASCAR stardom; Haiden \"Dangerboy\" Deegan - the fastest kid in the nation at his age on a dirt bike; the youngest, Hudson - just a 9 year old wild man who cannot be outdone; and his wife Marissa - the glue to the Deegan's continued success, a mom with a passion for racing, and her garden! Each week, Brian gives you an all access pass to a world of racing, parenting, motivation, marketing, business, sponsorships, health & more! Join The Deegans every Wednesday for interviews and discussions with the top talent from the world of moto sports, as well as personal goals and insights into how the Deegans stay ahead of the pack!",
    "<p>Fun opinions, analysis and interviews on Seattle sports with Danny O'Neil and Paul Gallant. Airs weekdays 7 a.m. - 10 a.m.</p>",
    "A triple murder. 40 hours of tape recordings. Rubin ‘Hurricane’ Carter. Bob Dylan wrote a song about him. Hollywood made a movie. This is the full story.",
    "<p>‘Broad &amp; Fry’ is the new cricket podcast looking to bounce the unsuspecting listener with a terrific delivery just short of a length.</p><p><br></p><p>England bowler Stuart Broad has taken the new ball, while experienced broadcaster and actor Stephen Fry will bring his own unique spin on the game.</p><p><br></p><p>Stuart will tell cricket tales from out in the middle and from a long career of tours and Test matches. While Stephen offers up his encyclopaedic knowledge of the game as well as the enthusiasm of a lifelong fan.</p><p><br></p><p>Expect the unexpected as Stuart Broad and Stephen Fry look to establish a brilliant new cricketing partnership.</p>",
    "<p>The Rugby Pod with Andy Goode &amp; Big Jim Hamilton &amp; hosted by Andy Rowe. Think pub chat, but with two of the biggest characters in the game. The guys chat through everything from tour stories to what really goes on behind the scenes in the World of Rugby. We also cover all the latest news, but with plenty of laughs, opinions and without taking ourselves too seriously. We're made for fans, by fans &amp; we're always looking to engage with our audience, so if you have a funny story, a question or opinion, get in touch through Twitter or Facebook. Enjoy!</p>",
    "Revealing, in-depth interviews from around the boxing world by Tris Dixon, the former editor of Boxing News and the BT Sport No Filter Boxing presenter.",
    "<p>Nobody had a career like Arn Anderson. For more than three decades he has been the epitome of “old school.” Hear him as you’ve never heard him before every Tuesday at 6am Eastern as he gives you a peak behind the curtain for the first time ever. \n\nEach week Conrad Thompson will examine Arn’s days in the territories, becoming an Anderson, creating the Four Horsemen in the NWA, becoming a Hall of Famer, and being a producer behind the scenes for years for WWE proving “The Enforcer” has a story unlike anyone else. Known for his trademark Spinebuster and incredible “promos” in front of the camera, it’s his timing and wit that has kept “the boys” in stitches behind the scenes. \n\nHear for yourself why ARN is the new “symbol of excellence” in professional wrestling podcasting exclusively on Westwood One Podcast Network, Tuesdays at 6am Eastern.</p>",
    "Seattle sports talk with Brock Huard and Mike Salk weekdays 7am to 10am on 710 ESPN Seattle.",
    "The ESPN College Football Podcast with Herbie & Pollack is hosted by Kirk Herbstreit, David Pollack and Kevin Negandhi. They will kick off each week on Monday discussing the games from that weekend. On Wednesday's, they react to the rankings and Friday's look forward to the biggest matchups ahead. This is the place to get all your college football info from the top analysts in the sport.",
    "They’re sport’s greatest heroes… displaying superhuman-like abilities to overcome intense pressure. But when it comes to the downfalls of fame, money, and ego—they’re far more human than super. Every Thursday, Parcast’s original series SPORTS CRIMINALS keeps score on the darker side of sports. Each episode chronicles the meteoric rise and fall of some of the sports world’s biggest names.",
    "\n      <p>The first daily sports news podcast that covers everything from the world stage to the hometown. The Athletic, home to the best storytelling in sports, and Wondery, the company behind “Sports Wars” and “Gladiator,” take you beyond the box score. With the help of The Athletic’s more than 400 sports writers and editors, co-hosts Kavitha Davidson and Anders Kelto dive deep into the biggest and most fascinating stories of the day. New episodes every weekday morning. The Lead. Sports up close.</p>\n    ",
    "Welcome to \"DFS For The Rest of Us.\"   Join Jake Ciely, Chris Meaney, and Joe Holka as they bring you DFS winning fantasy football advice each and every week.  The guys focus on what it takes to win on FanDuel, DraftKings, and DRAFT. Take your DFS Fantasy Football game to the next level.",
    "\n      <p>Fantasy freaks and geeks, this is the podcast for you. Marcas Grant and Michael Fabiano provide detailed fantasy football analysis combining in-depth stats and film study to help you win your league and earn bragging rights over your friends, coworkers or family. A mix of humor and pop-culture references keep the show fresh and light, &amp; will expose you to new movies, music, books and more!</p>\n    ",
    "Nick Baumgardner and Austin Meek dive into all things Michigan football from an analytical perspective on a week-to-week basis. From breaking down schematic concepts to discussing the ins and outs of roster development and recruiting impact, 'RPM' will take you along for the ride as the Wolverines strive for a Big Ten title.",
    "The Beat is a college sports podcast from The Athletic Detroit that takes you places you’d least expect. Hosts Nick Baumgardner and Brendan Quinn have stories to tell and people to talk to. … And beers to drink.",
    "Cash The Ticket gets you primed for the weekend in football as a bettor or as\na fan. This weekly show is focused on everything college and pro from a\nbetting perspective, including the matchups, the numbers, the angles. It\ncomes from the same crew that brings you the Always Aggravated podcast --\nhost Mike Valenti, plus Roberto Boschian, Mike Sullivan and David \"The\nHatchet\" Hull. \n\n",
    "Stories of women who are inspired by time spent outside take the shape of interviews, in-the-field recordings, and listener submissions. These make up a tapestry of episodes covering themes such as solo hiking and camping; entrepreneurship; aging; diversity, equity, and inclusion (DEI); conservation; motherhood; chronic illness; and feminism as they intersect with outdoor experiences. Hosted by Gale Straub.",
    "Daily news from around the wide world of college football.",
    "\n      <p>Robbie Mustoe and Robbie Earle discuss and dissect the top Premier League storylines after every single match day. Together, the former Premier League players and current NBC Sports analysts host \"The 2 Robbies Football Show\" on NBC Sports Radio and \"The 2 Robbies Podcast\" providing fans with top-class punditry on the most exciting soccer league in the world.</p>\n    ",
    "Where sports and politics collide, hosted by Nation magazine Sports Editor Dave Zirin",
    "An award-winning weekly sports magazine for the serious sports fan and the steadfast sports avoider",
    "<p>Liz Loza and Matt Harmon are joined by a revolving cast of Yahoo Fantasy Experts including Andy Behrens, Dalton Del Don, Brad Evans and Scott Pianowski to dish out fantasy advice, life advice and take listener voicemails. Call the voicemail line at 888-85-YAHOO.</p><p><br></p>",
    "The Official Fantasy Premier League Podcast. Join James Richardson every Friday for the best FPL briefing in the world. Subscribing to this show will be the greatest signing you make all season.",
    "The NBA's biggest stars, coaches, executives and newsmakers regularly join ESPN's Adrian Wojnarowski on The Woj Pod. Interviews, analysis and storytelling from an unmatched lineup of NBA guests anywhere - only on The Woj Pod.",
    "A down to earth Fantasy Football Podcast. Two brothers and a long time friend sit down and talk about their favorite players and provide friendly advice. Including projections and insight to their own league Support this podcast: <a href=\"https://anchor.fm/HailMaryFFPod/support\" rel=\"payment\">https://anchor.fm/HailMaryFFPod/support</a>",
    "Unrivaled, the official podcast of Penn State Football, provides an all-access look at one of the nation’s premier college football programs through the voices of its student, coaches and alumni.",
    "The beautiful game, explained. Whether you're a soccer newbie looking to learn the basics, or a football fanatic desperate for deep-dive details, you'll find it here.",
    "\n      Hall of Famer Geno Auriemma sits down for exclusive interviews with some of the biggest stars in sports and entertainment.  Produced by the UConn IMG Sports Network in partnership with UConn Athletics.\n    ",
    "Free kicks and takes about Atlanta United and MLS by The Atlanta Journal-Constitution’s soccer reporter, Doug Roberson.   81129",
    "Less gear, more beer!",
    "Actor, director, and NBA superfan Michael Rapaport shares his funny and excitable take on The League he loves on Two Man Weave with NBA All Star Kenyon Martin who showcase their historical knowledge of the game, passion for the sport and its symbiotic relationship with hip hop culture each Wednesday",
    "The Official Podcast of the Minnesota Wild Hockey Club",
    "<p>The premier football podcast from The Times, with the finest writers reviewing and previewing all the action from the 2019/20 season. Natalie Sawyer, Gregor Robertson and leading football writers from The Times and Sunday Times provide expert analysis of the big issues every Monday and Thursday</p><p><br></p><p>You can subscribe to The Times and The Sunday Times to enjoy our award-winning journalism on your smartphone or tablet. Just search The Times online.</p>",
    "\n      Baseball Night in New York host Doug Williams and SNY MLB Insider Andy Martino bring it every week on the Shea Anything podcast as the guys discuss and debate everything surrounding the New York Mets.\n    ",
    "For those who fish, this is the DrakeCast, a new flyfishing podcast. We're an audio supplement to the Drake Magazine and a voice for flyfishing around the world. Each Friday, we bring you a story - some funny, some serious. We'll be fishing for steelhead on the Pere Marquette, brook trout on small creeks, high mountain cutthroats, salmon galore, plus a tons of other species and places.\nCheck us out at The Drake Magazine's website http://www.drakemag.com/drakecast.html",
    "Motocross fans of the world connect to their sport every week on the groundbreaking PulpMX.com Show. Tune in Monday nights at 5PST/8EST for an entirely new way to get your bench racing fix.",
    "Fly Racing is proud to bring to you the Fly Racing MOTO:60 Show brought to you by GET, Maxxis and Pro Taper. We bring you the live bench-racing discussion before every race. Thursday afternoons a 11am PST. Listen in, call in and pass the word. Thanks to Fly Racing, GET, Pro Taper and Maxxis Tires and thanks for listening!",
    "Welcome to The Waterpeople Podcast, a gathering for our global ocean community to dive into the critical conversations of our culture -- through storytelling. Listen with Lauren L. Hill and Dave Rastovich as they begin each episode with a simple question: “Tell us about a time or experience after which you were never the same…” Sit with some of the most adept waterpeople on the planet to explore common themes of aquatic lives lived well: ecology, adventure, community, activism, science, egalitarianism, inclusivity, meaningful play. And, surfing, of course. ",
    "Peter Crouch, Tom Fordyce and Chris Stark bring you their guide to being a professional footballer. #backstronger",
    "The Players Podcast! Adam Lefkoe brings you the true NFL podcast going under-the-helmet and off-the-field through real conversations with players and insiders, as only Bleacher Report can do. Recapping the biggest news, previewing NFL gambling, and ALWAYS supporting the Homies, 2-3 times a week.",
    "Every Great Story Has a PAYOFF",
    "Every Monday and Friday we will be breaking down and recapping the series that were, the standings, the good, the bad and the angry from the MLB.\nFor advertising opportunities please email PodcastPartnerships@Studio71us.comLink to survey: https://bit.ly/2EcYbu4",
    "The official podcast of Establish The Run, a premium football analysis site from Evan Silva and Adam Levitan. The pod covers a wide range of topics related to fantasy football, DFS, prop betting, and football strategy.",
    "Inside the Green Room with Danny Green offers an inside look into the life of current NBA veteran Danny Green. Co-hosted by Danny Green and Harrison Sanford, the duo uncovers stories of an NBA player who has won two NBA titles and a National Championship but at one point found himself fighting for a spot in the league. Danny and Harrison's relationship dates back to high school when Danny was one of the best high school basketball players in the country and Harrison got a jump start on his journalism career. Harrison has worked as a Sports Anchor/Reporter in multiple markets before joining Green. The podcast originally launched in July of 2018 led by Executive Producer, Amjed Osman.\n\nFollow the show on social media: Twitter: @GreenRoomInside | Instagram: @InsideGreenRoom \n\nFacebook: Inside the Green Room | YouTube: Inside the Green Room with Danny Green",
    "No Dunks is a daily NBA podcast hosted by Skeets, Tas, Trey, Leigh, and JD — the original basketball podcasters. Join 'em as they break down the league's biggest games and headlines, answer listeners' questions, interview guests, and more.",
    "Welcome to the SI Media Podcast with Jimmy Traina. This podcast, which will be published weekly, will focus on all things sports media via interviews and roundtable discussions. Occasionally, an athlete or celebrity will drop by for a chat as well.",
    "Nock On podcast are educational archery tips  from Pro Archer John Dudley, an accomplished professional, top level coach and technical expert. Get great insights to new products and industry trends.",
    "<p>Josh Hart is many things... NCAA Champion, NBA Star on the rise, Video Game Aficionado &amp; your new best friend. Every week he will be joined by his Brother from Another Mother, marketing maven, Angel Investor &amp; Co-Host Matt Hillman (also your new best friend because he’s Josh’s best friend). Together they will provide insight and take you inside the Locker Room, Board Room, Game Room &amp; more on the LightHarted Podcast with Josh Hart.\n\nPresented by Venmo</p>",
    "<p>Wins &amp; Losses with Clay Travis is a brand new original podcast featuring interviews with some of the most fascinating figures in the country.  Clay Travis, host of “Outkick the Coverage” from 6-9am ET on Fox Sports Radio, goes deep with thought-leaders from all walks of life and explores the key wins and losses in their lives and careers.  It is through these stories that shape how they’ve achieved wide-ranging levels of success.  Join Clay as unique and inspiring stories are uncovered.  Follow Clay on Twitter at @ClayTravis and check out the Outkick the Coverage homepage at https://foxsportsradio.iheart.com/featured/outkick-the-coverage-with-clay-travis/</p>",
    "\n      <p>Snapback Sports is one of the most highly engaged Snapchat feeds covering sports. It was started by Jack Settleman, who will be joined by his buddy Abe Granoff for the Real_Sports Podcast. The two will cover the latest stories in the NBA, NFL, Premier League. You can expect guests, predictions, mailbags and a witty conversation.</p>\n    ",
    "On September 2nd 2017, just east of Portland, Oregon, 150 hikers were trapped behind a wall of flames created by one mistake, one that would lead to immense fear and loss. Wildfire, a podcast from REI Co-op, investigates the causes and repercussions of this devastating wildfire.",
    "Wayne Gretzky is joined by some of hockey’s greatest players, including Mark Messier, Luc Robitaille, Martin St. Louis and others to look back at their Stanley Cup championship runs. Each have a unique story to tell and memories to share about capturing the most iconic trophy in sports.",
    "All Florida Gators podcast featuring Silkk, Dan, and Ahmad.\nStadium and Gale is part of the Big 3 Roll Up Network!",
    "Hey Everyone! I'm John Scott, a retired NHL All Star. Welcome to the official page for my new podcast: Dropping the Gloves. Be sure to subscribe to see one-on-one interviews with some incredible NHL players, friends, and family from all walks of ice.",
    "English Legend Wayne Rooney talks with Roger Bennett about football, memories of his iconic Premier League career and experiencing America on and off the field.",
    "The biggest moments in sports history have stories behind them which have never been told. In 1999, Brandi Chastain kicked the winning goal for the U.S. at the Women’s World Cup. Her victory celebration in a sports bra made for one of the most iconic photos in recent memory. But how did we get to a moment where a women’s sport became a national obsession? To answer that question, we have to go back. In Season 1, soccer journalist Grant Wahl traces that ’99 Women’s World Cup victory back to the origins of the U.S. women’s national team and the first Women’s World Cup in 1991. Featuring superstars like Mia Hamm, Michelle Akers and Julie Foudy; former coach, Anson Dorrance; and even ex-FIFA President, Sepp Blatter. ",
    "You have come to know the Golic family over the last 20yrs, hearing about their lives on ESPN radio. Now they are sitting down as a family to share stories, and laughs about everyday life....and maybe a little sports.",
    "Sports, Pop Culture, Business, and everything in between!",
    "Join Ryan “Cal” Callaghan each week for his unique brand of outdoor news designed for folks that need to know what’s going on and those who want to pretend they do.\n\nPart of MeatEater, Inc.",
    "A baseball podcast with a Nationals bias. We believe in the designated hugger, not the designated hitter.",
    "The Voxwomen Insider is your go to podcast for everything women’s cycling. From race reaction and analysis to exclusive rider interviews, we are your inside source to all the action in, and behind the scenes of, the peloton. #bepartofthejourney",
    "The Hardball Times Audio is the official podcast of The Hardball Times, featuring discussion of each week’s featured articles, as well as other happenings in the world of baseball.  Each week, your hosts, Jen Mac Ramos, Mary Craig and Sarah Wexler, will guide you through the week’s baseball news, offering historical analysis of contemporary issues. Among other things, the show will explore women’s issues in baseball, both historically and in the present day. If you’ve ever wondered how baseball’s storied past fits into today’s game, this is the podcast for you!",
    "Just two women's soccer fans who get together every other week or so and discuss, argue, or hypothesize about various things in the women's soccer world. Very NSFW.\n\nWe're not journalists or bloggers, we're not even writers. Just two fans getting together to shoot the shit. And drink. \n\nWhen you're here, you're family\n\nGive us feedback on twitter or just leave us a comment here.\nhttps://twitter.com/thrace\nhttps://twitter.com/gabpdx",
    "The home of ITV Cycling's official podcast",
    "Join Christine as she guides you through all the happenings in the fast-paced world of Formula 1. Bringing you information, gossip, statistics and humour, with the odd race report thrown in for good measure. But don't think this is news churned out the normal way - the lady tells it like it is. Conspiracy theories, honest opinions and irreverent musings all add up to a refreshing listen.",
    "Welcome to the Official Audioboo channel of the Premier League.\nhttp://premierleague.com",
    "Freddie Flintoff and Clyde Holcroft discuss what's going on in the world of sport.  Some might say we cast a 'sideways glance' at the sport stories of the week, but we don't say that.",
    "The Eggchasers Podcast is a Rugby Union Podcast that doesn't take itself, or the game, too seriously.\n\nTim Cocker, along with fellow rugby fanatics JB & Phil have a lifetime of following & playing rugby. They bring you real rugby chat straight from the clubhouse.",
    "Nonstop, one-hour, high-energy workout music mixes to help you groove while you move. Podrunner's fixed-tempo and interval exercise mixes are perfect for power walking, jogging, running, spinning, elliptical, aerobics, and many other tempo-based forms of exercise. An iTunes award-winner six years in a row!",
    "Resonance 104.4fm's weekly radio show (and podcast) devoted to the art, science, politics and transcendental pleasure of cycling, in London and beyond. Presented by Jack Thurston the show has been running for more than four years, and has so far covered the intersections of cycling, culture, society and creativity from a variety of perspectives. From Tour de France to roller-racing, from Brompton commuters to bicycle messengers, from Kraftwerk to hip hop, from urban design to countryside trips. Literature, history, travel, art, music, sport in a weekly half-hour show.",
    "Mystery Crate will serve as a random grab bag of weekly content curated and created by varying members of the \"Le Batard & Friends\" universe. You'll never know what each individual episode might bring. Hence the name.",
    "Fadeaway is a storytelling podcast that brings the colorful characters and exciting history of our National Pastime to life inside your headphones, hosted by baseball historian Eric Enders. Follow us on Twitter @FadeawayPod or visit www.fadeawaypodcast.com.",
    "The On Baseball Writing podcast features conversations with writers who cover the game we know and love.",
    "Baseball America delivers baseball news you can&#39;t get anywhere else. Covering the game from a player-development point of view, the staff of BA will deliver its take on what&#39;s going on in the world of baseball every week on its podcast, analyzing the game from the majors and minors--with an emphasis on prospects--through our unparalleled college and high school coverage.<br/><br/>Support this podcast at — <a rel='payment' href='https://redcircle.com/baseball-america/donations'>https://redcircle.com/baseball-america/donations</a>",
    "Petros and Money Before The Show on AM 570 LA Sports",
    " Every guest is a friend. Or a friend of a friend.  (We play Jewish Geography) ",
    "\n      <p>Let's Get It features top-ranked golfer Tony Finau and his coach, Boyd Summerhays, as they dive into their experiences in the golf world and in life, including stories from the PGA TOUR, Tony's quest for greatness, and their collective love for family, community and all things sports!</p>\n    ",
    "Your one-stop feed for Dan, Stu, and all of the original podcasts from the LeBatard & Friends network. You won't miss a show here.",
    "\n      <p>Sports rivalries can fuel fans and athletes to fight and argue for years. But what’s the real story behind these epic battles?</p><p>From Wondery, the company behind “Business Wars”, “Gladiator” and “The Lead” comes SPORTS WARS, a new series that offers an immersive look at some of the greatest athletic rivalries of all time: two superpower nations facing off in the Miracle on Ice. The battle for the starting quarterback gig in Green Bay between Brett Favre and Aaron Rodgers. And many more.</p><p>Host Dan Rubenstein (Sports Illustrated, SB Nation) will take you from the grudge matches to the pranks, from the tantrums to the triumphs: what really happened, who was right, who was wrong -- and you can decide whose side you’re on.</p>\n    ",
    "The voice of the Yankees pairs with New Jersey native Don La Greca and multifaceted DJ Peter Rosenberg.",
    " Tyler Laurie and Zandrick Ellison host Underdog Sports new NBA Show.   ",
    "Josh Dunn and Anshu Khanna of the Underdog Sports cover the fantasy sports and gambling landscape across a variety of platforms each week as only they can.    ",
    "The official Masters Podcast invites patrons and fans to follow-along as host Marty Smith explores Tournament storylines and visits with notable guests from the worlds of sport, entertainment and pop-culture. Episodes published daily from Augusta National Golf Club and the 2019 Masters Tournament.",
    "The Elite Baseball Development Podcast is a one-stop-shop for baseball development. Please subscribe to get updates for every new show!",
    "George's Box is a baseball podcast hosted by JJ of Bronx Pinstripes, talking MLB and New York Yankees baseball while mixing in the latest pop culture topics from around the game. Every Wednesday the hosts will spit all the hot takes you need to dominate baseball conversations with your friends -- all year long!\nThis show and the hosts are not affiliated or associated with the New York Yankees, the YES Network, Major League Baseball, or Barstool Sports.",
    "ESPN Insider John Keim has covered the Redskins since the 1990's and in his podcast brings his unique insights into the team and moves around the NFL.",
    "Golf Underground is the third funniest podcast in golf! We interview PGA tour professionals, Hall of Fame Athletes, Rock Star Business Leaders and more. Join Wardo, Jordo and Sully each week on ESPN radio.",
    "<p>Gilbert Arenas is one of the most dynamic characters the NBA has ever seen. Agent Zero holds nothing back, puts all cards on the table and of course, has zero chill. Along with co-host Mike Botticello, the No Chill Podcast is a healthy dose of all things Gilbert, his stories, his ideas and his unique perspective, while joined by athletes, actors and comedians.</p>",
    "Giants locker room interviews and press conferences throughout the season and offseason. Listen at Giants.com, the Official Giants App, Apple Podcasts, TuneIn, and your favorite podcast service.",
    "Nick Maraldo and AQ Shipley, yes the center for the Arizona Cardinals... dive into all the important hockey topics going on in the world to make sure you have your weekly dosage of puck. Come join us for a little hockey talk.",
    "Get the inside take on College Hoops.  Jon lives and breathes college basketball providing him access to breaking news and insights. Every week the podcast will deliver compelling story lines of college basketball along with interviews, game picks, and scoops!",
    "The staff at GOLF.com has poured over the final round broadcasts of the most exciting Masters tournaments of all-time. On A Pod Unlike Any Other, we break down every element, from the ridiculous fashion trends to the sappy broadcast puns to, yes, the most historic golf shots at Augusta National.\n\nFrom now until the 2019 Masters, we'll bring you two episodes each week looking back at a specific year in time at the Masters, starting with Jack Nicklaus in 1975 and finishing with the manic meltdown that was the 2011 Masters.",
    "Covering the newsmakers in college basketball all year long. New episodes every Tuesday.",
    "A triathlete's view on training, racing, and living the multisport life.  Listen in for insider tips, methods, dealing with family, injury, traveling, and racing.  Tune in, turn on, and work out.",
    "Hosted by RW Editor-in-Chief David Willey, The Runner’s World Show podcast brings listeners inside the runner’s world. The weekly mix includes stories of ordinary athletes doing extraordinary things, exclusive interviews with notable names in the sport, the latest from the experts on training, gear, injury prevention, and nutrition, and what’s happening behind the scenes at Runner’s World.",
    "<p>The weekly podcast where geeks &amp; jocks collide. Hosts Gary O’Reilly &amp; Chuck Nice welcome athletes, experts &amp; resident astrophysicist Neil deGrasse Tyson. Remember: Playing with fire gets you burned, “Playing with Science” gets you learned.&nbsp;</p>",
    "Trail Runner Nation is devoted to sharing knowledge and advice to the trail running community - from beginners to the pros! We offer tips and discussion regarding race nutrition, pacing strategy, mental focus and much more from well-respected members of the trail community.",
    "Much bigger than sports, the show is fun, topical, and slightly irreverent. Shaquille O'Neal talks news, entertainment, controversy, and the crazy life of the Diesel himself. He and his sports sidekick, John Kincade never know who will show up to shoot the proverbial shh..uh, well, you know. To access the archive, go to PodcastOne.com. ",
    "Tin Talks is aimed at providing light-hearted insight into the members of Tinman Elite. Follow along as they share their random hot takes, their thoughts on the sport of running, and what Tinman Elite is all about.\n\nNarrated by friend and photographer of Tinman Elite: Benjamin Weingart.\n\nTopics include: \n3:05 Tinman Elite team culture\n10:30 The team group chat\n16:30 Current favorite shows and movies\n20:30 Girls / Style\n29:27 Hard-hitting topics \n33:13 Lessons from Head Coach Tom Schwartz\n39:00 Speed Rounds \n56:00 Tinmob questions",
    "Listen to Cleveland Browns Daily and other programming from the Browns Radio Network.",
    "\n      <p><a href=\"https://www.outsideonline.com/\" rel=\"nofollow\" target=\"_blank\">Outside</a>'s longstanding literary storytelling tradition comes to life in audio with features that will entertain, inspire, and inform listeners. We launched in March 2016 with our first series, <a href=\"https://www.outsideonline.com/podcasts/science-of-survival\" rel=\"nofollow\" target=\"_blank\">Science of Survival</a>, which was developed in partnership with <a href=\"http://prx.org/\" rel=\"nofollow\" target=\"_blank\">PRX</a>, distributors of the idolized This American Life and The Moth Radio Hour, among others. We have since added three additional series, <a href=\"https://www.outsideonline.com/podcasts/interview\" rel=\"nofollow\" target=\"_blank\">The Outside Interview</a>, which has editor Christopher Keyes interrogating the biggest figures in sports, adventure, and politics, <a href=\"https://www.outsideonline.com/podcasts/dispatches\" rel=\"nofollow\" target=\"_blank\">Dispatches</a>, a diverse range of stories on newsworthy topics, and <a href=\"https://www.outsideonline.com/podcasts/dispatches\" rel=\"nofollow\" target=\"_blank\">Sweat Science</a>, which explores the outer limits of athletic performance.</p>\n    ",
    "\n      <p>Pop culture and sport collide as one of the world’s most recognizable athletes and one of TV’s most recognizable faces pair up for this all new GOLFPASS experiment.&nbsp;Four-time Major Champion Rory McIlroy and host of The Voice and The Today Show Carson Daly&nbsp;take on topics from golf to Rugby, TV to tunes, to tee shots and everything in between.&nbsp;</p>\n    ",
    "Laughter Permitted with Julie Foudy is a fun, thoughtful, candid conversation with trailblazers in sports about the joy/chaos of life and sports. Laughter -- and donuts -- permitted.",
    "Sarah Spain profiles guests from the world of sports, comedy, music and beyond to share the stories of their lives and their journeys to success. ",
    "Join former NFL Pro Bowler Eric Wood as he transitions into the next part of his life. Sports, business, music; you can expect it all as Eric is joined by a compelling guest each episode.",
    "<p>Listen as superstar athletes discuss life-changing amounts of money in this podcast based on the award-winning \"Kneading Dough\" series, presented by UNINTERRUPTED and Chase. Episodes features never-heard-before exclusive content and are hosted by former NFL player, Andrew Hawkins.</p>",
    "<p>Human sports encyclopedia Scott Pianowski is joined every Monday by friends, pundits and Yahoo Sports' cast of experts for a lively, informative and not-too-serious weekly discussion on fantasy strategy and the major happenings in the world of baseball.</p>",
    "Digs, Todd McComas, & Gumpy cover everything you need to know in the gambling world including all the locks, all the insight, and who you should be fading. You've come to the right place if you're looking for the good, better, and best bets. ",
    "The PowerUp Tri Podcast will be hosted by former pro triathletes Matt Lieto and Jordan Rapp, lending their in-depth knowledge of the multisport to the Zwift Tri audience.",
    "Host Richmond Weaver explores the influence and impact of sports through conversations with personalities and luminaries who have been impacted, built, and inspired by the role of sports in their lives as they share their personal stories.",
    "<p>On \"Waltrip Unfiltered,\"  2-time Daytona 500 winner Michael Waltrip delivers a unique breakdown of the world of racing. \"Uncle Mikey\" will talk with the biggest stars in the sport each week, while taking the listener behind the curtain to provide unprecedented access, stories and reaction to the NASCAR world.</p>",
    "The Iditapod is a podcast following the Last Great Race, from Alaska Public Media and KNOM Radio. This daily podcast about the Iditarod Sled Dog Race takes you out on the trail -- into checkpoints, down along the sea ice, and across the finish line in Nome. Hear interviews with mushers, behind the scenes news, and in-depth race analysis you won't find anywhere else.\n\nFor episodes from season one of the Iditapod visit www.alaskapublic.org/iditapod",
    "The Stryd Power Podcast brings you training discussion, interviews, and news about running with power!",
    "Jorge Sedano brings his energy and passion for LA sports to you during The Sedano Show, 630pm-9pm on ESPN LA 710 and the ESPN App",
    "Take deep dives with Reds broadcaster Jim Day as he interviews current and former Reds players, coaches, broadcasters, celebrities and those that make news in the baseball and sports world. Jim will feature unique and relaxed conversations that will take you in between the lines and away from the field of play or the broadcast booth. Deep dive into what makes these celebrities tick as sports meets pop culture on the Jim Day Podcast.\n\n\n\nOne click subscribes you to every episode.",
    "Ricky Carmichael and Jeff Emig talk Supercross, Motocross, Motorcycles, racing and beyond",
    " Chris Horwedel and Mario Hines talk all things NFL football year round, covering the sport with a unique blend of insight and humor -- along some help from their contacts from around the football world.   ",
    "The Underdog Sports Podcast",
    "Lance Armstrong presents a singular perspective on the world’s most iconic cycling races, including the Tour de France and the Classics, as well as the broader endurance sports scene. Not your typical cycling or sports podcast, THEMOVE brings listeners deep inside the racing action, imparting insights from someone who knows the suffering and splendor like no one else. In addition to  course previews and timely race analysis from Armstrong’s distinct point of view, the audience also gets to hear from featured guests, who regularly swing by the THEMOVE studio to join the always-lively conversation. Guests have included former teammates like George Hincapie during the Tour de France, and Mark Allen and Dave Scott in advance of the IRONMAN World Championship. \n\nTHEMOVE is an audio-video experience that transforms every listener from fan and spectator into the ultimate insider.",
    "Hop on board our tandem pod: It's Captain Alex and Jenni the Stoker! Join us as we navigate the wild and wonderful world of wheels. Comin atcha from London's Look Mum No Hands cycling cafe and London Bike Kitchen DIY Bike Workshop, here to pull back the curtain on the industry and showcase a glorious smorgasbord of hidden cycling delights. Coz cycling's not just for roadies...or MAMILS...or Freds...plum smugglers...lycra louts.....\n\n~ Work handles ~\nLook mum no hands www.lookmumnohands.com/\nLondon Bike Kitchen www.lbk.org.uk/\n\n~ Our personal handles ~\nAlex Davis twitter.com/Singyamatokun\nJenni Gwiazdowski twitter.com/money_melon\n\n~ Illustration ~\nKorinna Mei Veropoulou\nhttps://korinnamei.myportfolio.com/",
    "The Cycling Podcast\nJoin journalists Richard Moore, Lionel Birnie and Daniel Friebe – and a few special guests along the way – as they podcast about the latest cycling news and the world of professional cycling.\nExpect a mix of insight and analysis as our three experienced journalists cover not just the big talking points but take you behind the scenes of professional cycling.\nRichard Moore is the author of Slaying the Badger and Sky’s the Limit, Daniel Friebe writes for Procycling and is author of The Cannibal, a biography of five-time Tour winner Eddy Merckx, and Lionel Birnie is co-editor of The Cycling Anthology, a collection of essays about the Tour de France.",
    "The Paceline is a cycling podcast aimed at roadies, mountain bikers, commuters, cyclocross enthusiasts , those who grind gravel—indeed anyone who claims cycling for their own. The bicycle is more than a thing, it’s an issue. The Paceline also discusses the bike’s place in society. The hosts love bike gear so expect some banter about what works and what does not on the road and trail. The show is backed by the Fatcyclist and Red Kite Prayer. The podcast on two wheels. No training wheels needed.  The Paceline is hosted by Selene “the fit chick” Yeager and Patrick Brady, and is a production by Red Kite Prayer.",
    "A podcast for all cyclists",
    "Podcast by Ayesha McGowan",
    "After months of negotiation, profound laziness and slovenly entitlement, Stugotz has finally aGREED to join the LeBatard and Friends Podcast Network. Join Stugotz and his guests for a hastily-assembled weekly podcast of unknown quality about his quest for worldwide domination eventually ending with the S in ESPN standing for Stugotz.",
    "\n      <p>A monthly podcast in which the outspoken Brandel Chamblee and award-winning journalist Jaime Diaz discuss, debate and break down some of the more interesting topics in golf. </p>\n    ",
    "This podcast takes you “inside the ropes\" with the game’s greatest players, brightest minds, and biggest influencers. You’ll hear from athletes, celebrities, and industry experts to learn more about life on Tour, find out what inspired TaylorMade’s latest technologies, and hear incredible stories from on and off the golf course.",
    "Chalk Talk is a climbing industry podcast. A place to find interesting and enlightening discussions with professionals in the rock climbing industry. In depth conversations with route setters, coaches, professional climbers, gym managers/owners and much more. Chalk Talk is the place to find inspiration and contemplation on the future of the climbing world and where to take your climbing to the next level.",
    "<p>This is adventure. Climbing. Skiing. Hiking. Biking. Running. Travel. Whatever your passion, we are all dirtbags. Outdoor writer Fitz Cahall and the Duct Tape Then Beer team present stories about the dreamers, athletes and wanderers.</p>",
    "A podcast from Accidents in North American Climbing, hosted by Ashley Saupe and presented by Mammut. https://americanalpineclub.org/sharp-end-podcast/. Like what you hear? Support the show by making a donation to the \"Sharp End Podcast Fund\" at https://membership.americanalpineclub.org/donations.",
    "Insight and analysis from the Test Match Special team - including interviews with top players and special features.",
    "Opening Up Cricket's podcast where we talk sport, fitness and mental health.",
    "Sky's pundits analyse and debate the big stories emerging from international and domestic cricket. Join in the debate on Twitter @SkyCricket.",
    "<p>A cricket podcast by two guys whose school team once got bowled out for 22, and the next week got bowled out for 13. And they never let it go. 'Acclaimed' - Financial Times</p>",
    "Learn how to bowl faster, straighter and with more skill by listening to Pace Journal podcasts with leading fast bowlers and coaches in world cricket. Visit the site: pacejournal.co or to get in touch, contact: speed@pacejournal.co",
    "<p>Stories from the Lord's, the Home of Cricket, with the people who made them. The Lord's Cricket Podcast, hosted by Will Roe, features one-on-one interviews with players who have lit up the Ground as they go down memory lane for some cricketing nostalgia.</p>",
    "Love Australian cricket? Then this is the podcast for you! Don’t get caught behind all the latest cricket news! Match previews, summaries, views and scores all right here in the one place! Follow and listen now!",
    "Join Rob & Rich on ‘The Leading Edge’ podcast talking all things cricket from every corner of our wonderful cricketing world.<br />We’ll be getting stuck into the big stories from all around the world as we discuss as much test cricket as we can along with ODI and T20I as well as the many exciting T20 competitions from Vitality Blast to the PSL, to the Kiwi Super Smash to the Big Bash and, of course, everyone’s favourite, the IPL.<br />Previews, reviews, gossip, signings, predictions (good and bad!), insight, interviews and opinions… join us for all the cricket chat.<br />To find out more about ‘The Leading Edge’ and to read all of our latest articles, visit us at <a href=\"http://www.leadingedgecricket.com\">www.leadingedgecricket.com</a>",
    "<p>The Following On Cricket Podcast from talkSPORT - bringing you all the best in cricket chat and make sure you join us as we follow England's journey!</p><p><br></p><p>We'll track the action, from matches, to news, exclusive player interviews, fan reactions and all the latest from the world of cricket! Make sure you subscribe so you don't miss out on any of the action!</p><p><br></p><p>You can also head over to <a href=\"https://twitter.com/Cricket_TS\" target=\"_blank\">talkSPORT Cricket</a> on Twitter for regular updates!</p><p><br></p><p>Find more from talkSPORT at <a href=\"https://talksport.com/\" target=\"_blank\">talkSPORT.com.</a></p>",
    "Edges & Sledges is a weekly cricket podcast focussing on Indian cricket and the IPL.\n\nConceived by the 1tip1hand blog team, the three podcast hosts are ordinary Indian cricket fans based in Singapore, London and Cincinnati. Edges & Sledges is where they come together to talk about the week’s biggest cricketing stories.\n\nDo get in touch with comments and queries on contact@1tip1hand.com or on Twitter @1tip1hand.\n\nKeep listening!",
    "If you love cricket then this podcast is for you. Get closer to the game than ever before with the longest running weekly Australian cricket podcast.  The show has twice been a finalist in the Australian Podcast Awards and has episodes placed in the National Film & Sound Archive.  The podcast is hosted by Andrew Menczel & Paul Dennett and features a wide variety of cricket journalists, current players and retired cricket greats. This is must listen for cricket fans.",
    "The only rider hosted podcast. Bringing you a view from within the closed doors and guarded mindset of the athlete, from both within motocross and from other realms of sport as well.",
    "ESPN experts Mel Kiper Jr. and Todd McShay keep tabs on the NFL draft throughout the year.",
    "Listen each week as the show talks about past, present and future success. The podcast will welcome friends, family, coaches and celebrities to talk about \"Who's Got It Better Than Us? Nooo-body!\" Join Coach Jim Harbaugh and guests each week to talk about attacking life, each day, with an enthusiasm unknown to mankind!\n \nJim Harbaugh is the head football coach for the University of Michigan Wolverines.  Along with co-host Ira Weintraub, Jim will be joined on shows by his lovely wife Sarah, father and former American Football player and coach Jack, brother and NFL football coach John, family and friends.",
    "Hosted by Las Vegas personality and founder/CEO of Pregame.com RJ Bell, the program gives fans a real-time Vegas perspective on each upcoming game’s kickoff, opening tip, and first pitch. Featuring FOX Sports Radio personality Jonas Knox, as well as famed betting experts Brad Powers and Steve Fezzik, the program informs and entertains sports fans with on-the-ground reporting – including breaking news and changing odds – right up until game time. ",
    "B/R Football Ranks: the show that takes the football world and puts it in the correct order. Ranker-in-chief Sam Tighe and B/R Insider Dean Jones join host Jack Collins in ranking all that's important (and all that's not) in football and life.",
    "A weekly review of the weekend’s football from Sky Sports’ expert and Manchester United legend Gary Neville",
    "The award-winning LaLiga podcast from Phil Kitromilides, Sid Lowe and Alex Kirkland. Every Monday throughout the season.",
    "Go inside the most popular sport in the world with the ESPN FC crew.",
    "The Football Weekly podcast squad brings you a twice-weekly dose of puns and punditry, news and analysis – from the Premier League and beyond",
    "Baseball is a game of tradition. It has remained largely unchanged for over 100 years, and it's easy to think that the players on the field are just as traditional as the game itself. But that couldn't be further from the truth. Today's game is filled with some of the most interesting and exciting personalities in the history of baseball. On-field, off-field and everything in between, enjoy a conversation among baseball people, and get to know the players and the game you already thought you knew.",
    "TrainerRoad's Ask a Cycling Coach podcast gives you the chance to get answers to your cycling and triathlon training questions with USAC/USAT Level I certified coach Chad Timmerman and other special guests.",
    "We’re going deeper than ever before and exploring what it means to be an athlete. Our guests range from pro cyclist Laurens ten Dam, who speaks about his struggles in the pro peloton and the time when his career almost ended, to Mirna Valerio, author of the blog “Fat Girl Running” who is trying to change people’s perceptions about what it means to be fit. We’ll speak with Ricky Gates about what he found when he was running every single street in San Francisco – all 1,300 miles of them. And we’ll hear from Brian Williams about what it was like to run the Comrades Marathon in South Africa with his son Tom after he had been exiled from his home country for 15 years for protesting apartheid. These are just a handful of the guests featured on Athletes Unfiltered – subscribe now so you don’t miss any of our second season!",
    "<p>Listen along as native Texan and fly fishing guide JT Van Zandt drifts through the important things in life with iconic guests. Much like the nature of a guide and client passing time on a drift boat, conversations here meander through life, the wild, personal philosophies, hardships and triumphs, and of course some fishing too.</p>",
    "From his beachside studios in Miami, ESPN's Dan Le Batard talks one-on-one with a mix of interesting personalities from sports, music, comedy and beyond. Published weekly, South Beach Sessions is the flagship podcast in the LeBatard and Friends Podcast Network. Dan is past his prime as an interviewer, and less curious than he has ever been, but he will bully the guests into carrying him",
    "Stories from athletes who don’t stop at sport. They spark change and redefine the rules.\nHear from the world’s greatest athletes on topics like equality, representation, leadership, confidence, and more. Brought to you by Nike. \n\n",
    "Listen to Keith Tozer talk Futsal!  He will interview and talk to the main players, coaches and people in futsal worldwide",
    "Introduction to a weekly podcast produced and hosted by ex-MLB player and current broadcaster Geoff Blum.",
    "For nearly 23 years, Mitch Levy hosted one of the most successful and longest running morning-drive sports radio talk shows in America. Outspoken and unafraid analysis loaded with humor and unparalleled interviews. Please join us as we embark on an exciting and somewhat mysterious new journey. Become a monthly \"patron\" to support the show & enjoy access to not only regularly scheduled episodes but BONUS podcasts as well. Goodbye terrestrial radio. Hello podcast world!",
    "Daily podcast hosted by Sean Tiplitsky where Sean reports the biggest and most interesting news stories inside the world of sports and gives a unique and passionate take on each and every topic. Support this podcast: <a href=\"https://anchor.fm/seanssportsstop/support\" rel=\"payment\">https://anchor.fm/seanssportsstop/support</a>",
    "\n      <p>NBC Sports national NBA Insider Tom Haberstroh sits down with some of the biggest names in the NBA to share the stories and the numbers behind the biggest games and biggest moments in the league. New episodes drop every Friday during the NBA season. </p>\n    ",
    "Always Aggravated is a signature podcast hosted by Mike Valenti, featuring \ncontent that is unique from his weekday radio show. Valenti will dish on an \narray of topics in a manner only Valenti can. Everything from sports to life \nto the issues of the day will be open for discussion, in an unfiltered and \ncasual setting each week. Valenti and his crew of Mike \"Sully\" Sullivan, \nDavid \"Hatchetman\" Hull, and Roberto Boschian will bring you a new episode \nevery Wednesday.\n\n",
    "Behind the Braves, the official podcast of the Atlanta Braves, takes fans on a journey to uncover the stories - known and untold - about our beloved team. Former Braves closer, World Series champion and current director of alumni relations Greg McMichael and MLB.com's Ricky Mast are joined by Braves legends, players and even famous fans, to share the passion and history of this proud franchise.",
    "We are three men passionate about all things college basketball. And we all have weaves.",
    "CBS Sports’ official college basketball podcast is the most entertaining and informative of its kind. Gary Parrish and Matt Norlander bring the sport into your ears three times per week with commentary, reporting, insider information and statistical analysis throughout college basketball all year long.",
    "Mike and Gus cover all the college basketball action 24/7 on the Screen the Screener College Basketball Podcast",
    "\n      Rob Dauster takes a look at everything happening across college basketball, including a weekly recap of action across the country and each conference, recruiting and a looking ahead to the future of the sport.\n    ",
    "<p>In a fresh iteration of a classic formula, comedians Jason and Randy Sklar share their unique comedic takes on an assortment of sporting issues and chat with an amazing array of guests.</p>",
    "A weekly college basketball podcast by Brendan Quinn of The Athletic and Dylan Burkhardt of UMHoops.com. We discuss Michigan, Michigan State, the Big Ten and the game at-large.",
    "Listen to Dan's daily radio show. With exclusive insider access, Patrick brings A-list guests from the world of sports and entertainment to the show.  Sharing his perspective on pop culture and sports, Patrick also brings a dose of humor to his fans.  To access the entire archive,  go to PodcastOne.com.",
    "Benigno & Roberts",
    " The world of sports betting is a crazy place, and even crazier when you have no idea what's going on. Join us each week as we look at the games ahead and give you everything you need to know to become a more informed sports bettor.  Follow along for the action @TheLongshotsPod on Twitter.  ",
    "Fantasy Football Counselor is a podcast created for you, the DIE HARD fantasy football fan! NO FLUFF, straight to the point Fantasy Football Advice. If you are looking for in depth, honest and well researched Fantasy and daily fantasy information, you have come to the right place! Joseph Robert's 10 hours a day of  Fantasy football studying, is put to work for you. Fantasy Football information changes so often.  Joseph Robert is up to date on all the latest information and offers you the best advice to win and dominate daily fantasy and your year long fantasy football  leagues. The ONLY Fantasy Football Podcast you'll need.",
    "Liars, cheaters, burglars, oh my! Enter the amusing, diabolical, and entertaining world of sports trickery and mayhem. Spencer Hall shares the absurd stories of stolen bats, pirated play calls, renegade cross-country road racers, and promising footballers who, it turns out, were never really footballers at all. A storytelling experience by SB Nation and the Vox Media Podcast Network.",
    "Chris Cooley's Official Redskins Podcast, The Chris Cooley Show, is Cooley's take on everything going on in Redskins Nation and around the NFL!",
    "Sometimes three-and-a-half hours is just not enough time to say everything that needs to be said. Sometimes Chad Abbott doesn't want us talking about certain things on the radio. This is the podcast for just those times, an after show after party with The Power Trip where anything goes!",
    "Baseball Podcast hosted by Austin Hartsfield, Dave Kwetkowski, and Gabe Faulkner. Giving you the news and crazy stats going on throughout minor and Major League Baseball.\n\nHave some awesome guests along the way including the Cespedes Family BBQ guys, Phillies Cole Irvin, beat writers and much more.\n\nIf you love baseball then you'll love us. Support this podcast: <a href=\"https://anchor.fm/paintingcorners/support\" rel=\"payment\">https://anchor.fm/paintingcorners/support</a>",
    "Sports on Earth senior columnist Joe Posnanski brings a funny, thoughtful perspective to all things sports-related (and some things completely unrelated). - ",
    "This Week In Baseball History is a weekly podcast devoted to the history of baseball, hosted by Mike Bates and Bill Parker, the co-founders of The Platoon Advantage and writers on many fine websites.",
    "Daily baseball statistical analysis and commentary",
    "Mina talks all things football with her unique brand of humor and insight. Her friends join each episode to talk about the NFL's latest storylines along with her football loving dog, Lenny, making frequent contributions.",
    "This is the Operation GritBox Podcast. Teaching TopFlight Performance. ",
    "All the latest in sports betting news, expert picks and analysis. The OddsShark Podcast has you covered for every major sport, political and entertainment wager on the board.",
    "Stuckey and Collin preview the upcoming college football card from a betting perspective with some NFL and other degenerate things sprinkled in. Pour a drink and come get in on the action.",
    "NFL and College Football Sports Betting Podcast hosted by Todd Fuhrman of Fox Sports' Lock It In and Payne from Payneinsider.com breaking down games from a Gambling perspective every Monday, Wednesday, and Thursday at BetTheBoardPodcast.com !\n\nFollow the guys on Twitter: \n@BetTheBoardPod\n@Payneinsider\n@ToddFuhrman",
    "The podcast channel for BangTheBook features sports betting analysis and free picks from some of the industry's top handicappers. With NFL, College Football, MLB, NBA, and College Basketball podcasts, we cover all the sports with betting tips, free picks, stats, and matchup analysis on all the games that you want to know about. Join us now for daily NFL and College Football Picks",
    "\n      <p><strong>Give us 10 minutes and we'll give you the arsenal necessary to successfully navigate the sports betting markets. 600 seconds of vital and actionable information from Covers.com - the top source for sport betting info and insight.</strong></p><p><a href=\"http://www.covers.com/index.aspx\" target=\"_blank\">www.covers.com/index.aspx</a></p>\n    ",
    "Sports betting expert and Host of VSiN's \"A Numbers Game\" on SiriusXM, Gill uncovers the best of sports handicapping including free picks, the ins and outs of gambling strategies, and the truth behind sports book and casino operations.\n\nTogether with industry high stakes handicappers and sports wagering experts, Gill covers NFL, college football, MLB baseball, golf, horse racing, and more.  Listen to this entertaining and informative podcast for a winning edge.",
    "The postgame podcast covering University of Oklahoma athletics for SoonerScoop.com",
    "\n      <p>Kevin Sheehan takes his 15-year sports radio career in DC to the podcast universe.&nbsp;His passion, knowledge, and historical perspective of all things DC sports has created a legion of fans over the years.&nbsp;His show is available Monday through Friday and includes all of the favorites like \"The Smell Test\", \"Scott Van Pelt Thursdays\", \"Skins Win If...\", and much more.&nbsp;</p>\n    ",
    "Guy Haberman and John Middlekauff come to you from the Bay Area where they used to do a terrestrial radio show. Middlekauff is a former NFL Scout. Haberman calls play-by-play. Both are locked in on everything. High school friends, college roommates, content producers. #HAM",
    "\"Stanford\" Steve Coughlin & Chris \"The Bear\" Fallica put their unique spin on the world of playing the odds in college football, horseracing and more",
    "On \"The Pat McAfee Show,\" Pat McAfee and his friends deliver one of a kind opinions that won't be heard anywhere else. Pat's a recently retired NFL All-Pro who has zero filter. A common man who has experience in an extremely uncommon professional athlete lifestyle is a beautiful concoction of hilarity for the average Joe. Both relatable and ridiculous, \"The Pat McAfee Show\" promises to inform, intrigue, and entertain. Thanks for listening. Cheers",
    "<p>Join NFL Network's Insider Ian Rapoport and fellow NFL reporters Mike Garafolo and Tom Pelissero for in-depth analysis on the biggest news in the National Football League and insightful conversations with the key players, coaches, and front office personnel.</p>",
    "A spectacular pick ’em podcast with Matt Jones and Drew Franklin.",
    "Watch the VIDEO version of our show at www.OSWreview.com! OSW Review (Old School Wrestling Review) is the #1 Wrestling video podcast in the world! As seen on Botchamania.com, and the biggest independent wrestling page on Facebook, PiledriverWrestling.net. We chronologically critique classic events from the Hulkamania Era in the WWF (WWE). Hosted by Jay Hunter, OSW Review features a panel of longtime (20+ years) wrestling fans. All Irish, All awesome!",
    "Colt Cabana travels ALL OVER THE WORLD as a full time independent pro wrestler. Each week Colt will document his travels along side his various friends within the industry.  Candid...funny....slice of life...real look at the life of a DIY, underground pro wrestler. PAST EPISODES available at Patreon.com/ColtCabana",
    "Hall Of Fame Superstar Sean “X-Pac” Waltman, and co-founder of AfterBuzz TV Keven Undergaro are teaming up together to bring a podcast with a full circle look at life from outside the squared circle.\n\nAfterBuzz TV presents X-Pac 1 2 360. X-Pac has many stories to tell that may help listeners relate, inspire them in their own lives, or just be entertained. And of course, there will be guests. So plan on seeing his group of usual suspects along with a mix of wrestlers, celebrities, and comedians.\nX-Pac has known and shared many road trips, locker rooms, and life moments with these guests.  Support this podcast: <a href=\"https://anchor.fm/x-pac-12360/support\" rel=\"payment\">https://anchor.fm/x-pac-12360/support</a>",
    "<p>Ray, Lunchbox and Eddie are The Sore Losers. Three guys in their 30’s based in Nashville who love to talk about sports...even if they aren’t right all the time! The show features commentary on daily sports stories with added humor and witty banter between friends.</p>",
    "Online since 1995, FantasyGuru.com is one of the oldest and most connected fantasy football information sites on the planet. Join fantasy industry pioneer John Hansen, film authority Greg Cosell, and a dedicated staff of full-time NFL experts as they provide you with the Xs-and-Os and analytical angles you need to conquer your fantasy league.",
    "<p>Jeff Erickson, Chris Liss, Jake Letarski, Joe Bartel, John McKechnie, Mario Puig, Andrew Laird, Scott Jenstad and guests from around the industry discuss both season-long and DFS advice Monday through Friday throughout the season.</p>",
    "Christopher Harris's fantasy football podcast. We ignore the box score and watch game film. Draft better. Manage smarter. Win.",
    "Double Technical is a new Sports Podcast! We talk everything Local Sports including Kentucky, Bengals, Reds, FC Cincinnati and NKU to start each show, and then we talk about National News. We want to have a platform for people to join in on the sports debate! Join in with your host Lucas Fryman every Monday and Friday! You can call/text us at (513) 788-1490! Join the Debate!  Support this podcast: <a href=\"https://anchor.fm/doubletechnical/support\" rel=\"payment\">https://anchor.fm/doubletechnical/support</a>",
    "<p>International Podcast devoted to discussing Special Teams topics and interviewing some of the biggest special teams names in the NFL and beyond! Contact Us: 4thDownExperiencePodcast@gmail.com Co-Hosts: Chris Husby Brian Jackson Professional Kicking Coaches</p>",
    " Chris Horwedel and Greg Crone have been good friends for more than a decade, but they never agree on anything.  On You're Wrong... And Here's Why, Chris and Greg will argue about some of the biggest stories in sports, with the listeners ultimately getting to decide who's right and who's wrong.   ",
    "Create Your Shot",
    "The fastest growing college football podcast out there. Saturday Down South has been the leading voice in SEC football for years, and is now giving college football fans a \"go to\" podcast for weekly commentary and discussion. It's SEC football, but for your ears.",
    "Welcome to Honkytalk where two honky’s give you ignorant opinions on stuff. We talk you laugh!!!! Support this podcast: <a href=\"https://anchor.fm/honkytalk/support\" rel=\"payment\">https://anchor.fm/honkytalk/support</a>",
    "<p>Want to dominate your league and get Fantasy Football bragging rights? Join host Adam Aizer and get analysis from writers Dave Richard, Jamey Eisenberg, Heath Cummings and the rest of our crew throughout the year. Start or Sit, Buy or Sell, Grade the Trade and plenty of your emails. This is the only podcast you'll need to win your league.</p>",
    "FantasyPros provides hard-hitting fantasy football analysis while keeping you entertained. Get the tips needed to win your league from a trusted network of 100+ experts. Find out who to draft, pick up and start while receiving analysis of the latest news from around the league.",
    "I varje avsnitt av MTB-podden får vi möta en person som inspirerar till att cykla mountainbike. Per Frost intervjuar tonsättande personer inom cykling",
    "Snett inåt bakåt – Sveriges mest (in)aktuella sportpodd.\nEn gång i veckan samlar Marcus Leifby sina sportnördigaste kompisar för att återbesöka en gammal – inte sällan bortglömd – händelse i idrottshistorien. Hur såg Bernt Ljungs skadebekymmer ut 1993? Vad tyckte Milanspelaren Demetrio Albertini om Jesper Blomqvists vita tubsockor? Vilket är Marcus finaste Jimisola Laursen-minne? Vet Antonina Ordina vem som sköt Olof Palme? Borde Johnny Holm stå krokimodell på GIH?\nIngen fråga är för stor, eller för liten, för Snett inåt bakåt.\nMissa inte heller chansen att delta i Sveriges just nu klurigaste frågesport #Motorblocket, där vinnaren får en slips ur Lars-Gunnar Björklunds slipssamling.",
    "We delve into the MTB world, talking to athletes, trainers, mechanics, brands and more, to bring you all the best insight that will inform and inspire you, and help you ride your bike faster, have more fun, and find out about more about the characters behind the sport that we love.",
    "A mountain biking podcast channel featuring in-depth interviews with world class riders and cycling industry professionals.",
    "ESPN fantasy experts Matthew Berry, Field Yates and Stephania Bell provide daily strategy, previews and injury reports.",
    "WWE Ambassador Dana Warrior presents TOTAL WARRIORS! ",
    "A witty, smack talk look at the world of sports mixed with a touch of pop culture conducted in an all-out Ramble! Hosted by Silicon Valley Exec, Dave Dabbah. The Ramble covers the NFL, NBA, MLB, NHL, NCAA, and more. Support this podcast: <a href=\"https://anchor.fm/theramblepodcast/support\" rel=\"payment\">https://anchor.fm/theramblepodcast/support</a>",
    "In Tales from the Association, Chris Horwedel hosts long-form conversations with former NBA players who walk us through their careers.  In this show, we aim to provide the casual fan with a unique, behind-the-scenes look at not only why a player picks a certain school, or team (or leaves that team), but what the thought process of those decisions was.\n\nWith incredible inside information and the occasional fascinating story about a former teammate, Tales from the Association is a must-listen for any basketball fan.",
    "Hunting. Angling. Public Lands. That's the meat of what BHA's Podcast & Blast with Hal Herring is about, and we cover the gamut. With guests that range from outdoor writers to backcountry hunters to legendary anglers, we seek to uncover the stories, the truths, the controversies, and the epic conversations that our public land heritage provides.",
    "The Wired To Hunt Podcast is the most highly rated and listened to deer hunting focused podcast in North America - with millions of episodes downloaded and enjoyed by hunters every year. Hosted by nationally published outdoor writer and QDMA Communicator of the Year Mark Kenyon, each new episode focuses on sharing deer hunting news, stories and strategies - straight from guys who live the deer hunting lifestyle every day. And expert whitetail hunting guests such as Mark and Terry Drury, Bill Winke, Dan Infalt, Adam Hays, Stan Potts, Steve Bartylla, John Dudley and many others are frequently interviewed to share their insights, experiences and strategies. If you are a whitetail addict, tune in to The Wired To Hunt Podcast to get your fix.",
    "Hunting Tips, Tactics, Strategies, and Preparation ",
    "A show that covers the ideologies and philosophies of the modern hunter while touching on key ideas like conservation, our value systems and how to construct a better public image. A recurring cast of top hunting voices help drive the conversation and keep things pretty damn interesting. \n\nPart of MeatEater, Inc.",
    "Shoot'n The Bull Podcast with Josh Keller and Ty Stubblefield is an entertaining and somewhat educational podcast driven by their adventures in the elk woods or any other hunt that comes to be.",
    "Hunt Talk Radio, Randy Newberg Unfiltered is a podcast covering hunting politics, public lands, and conservation topics; even a few things you didn’t need to know. The best hunters you’ve never heard of join Randy to answer questions from the Hunt Talk web forum, share ideas, reveal tactics, and give perspectives unique to public land hunting.",
    "Fantasy Football at it's very best.  Say goodbye to the talking heads of Fantasy Football and hello to The Fantasy Footballers.  The expert trio of Andy Holloway, Jason Moore, and Mike \"The Fantasy Hitman\" Wright break down the world of Fantasy Football with astute analysis, strong opinions, and matchup-winning advice you can't get anywhere else.  A high quality and entertaining show that will win you your Fantasy Football league -- in style.  The ONE Fantasy Football Podcast you can't leave off your roster.",
    "The Scout's Honor podcast provides inside information from teams along with unique perspective from Scouting Services, Inc. Dir. of Operations Dave-Te' Thomas. He and former CNN Sports anchor Paul Crane provide news, information and player insight from inside teams in all four major sports, football, baseball, basketball and hockey.",
    "All elk, all the time, and only elk.  Hunting elk is the aspirational pinnacle for most American hunters.  Corey Jacobsen, 10-time World Elk Calling Champion, and Randy Newberg, long-time public land hunting advocate, have combined to lower the hurdles for aspiring elk hunters and provide insight from their combined decades of elk hunting mistakes that will give useful information to elk hunters of all experience levels.  Brought to you by Rocky Mountain Elk Foundation and partners Sitka Gear, onX, goHUNT.com, Gerber Gear, and Rocky Mountain Hunting Calls.",
    "Beyond The Grid, supported by Bose, delivers great stories, fresh insight and amazing anecdotes from the world of F1. Each week Tom Clarkson brings you in-depth, personal conversations with the biggest names in the sport, from current superstar drivers and leading team bosses to legendary figures from history.",
    "The Blizzard is a quarterly football publication put together by a cooperative of journalists and authors. These podcasts feature some of the best articles from our back catalogue, and recordings of live Q&A events we hold with our writers around the UK. \n\nOur main aim is to provide a platform for top-class writers from across the globe to enjoy the space and the freedom to write what they like about the football stories that matter to them.\n\nFor more details - www.theblizzard.co.uk",
    "\n            \n        Since the 2010 FIFA World Cup; Santo, Sam and Ed have made television, radio and podcasts showcasing their unique take on the world game. Now it's time for them to ask the big questions. This time the boys are joined by guests from all walks of football life to find out: If you ran football what would you like to do? They want to get as many perspectives and ideas as they can. Think of it as a global suggestion box for the world game.\n            \n        ",
    "Stories about soccer from Howler Magazine",
    "The Asian Game is a podcast dedicated to telling the stories and sharing the history of the beautiful game in Asia - from Jordan to Japan, Korea to Kuwait and everywhere in between.\n​\nWith stories, analysis, insights and interviews with players, coaches and the key individuals in the game, The Asian Game will take you inside the game in Asia like never before.",
    "A documentary podcast on a different football club every month, told through the fans' eyes.",
    "WABC-AM | Cumulus",
    "Sunny in PHX! A Suns Podcast",
    "Thrill of It All with Jamie Thomas is a podcast & multi-media experience hosted by professional skateboarder Jamie Thomas. The show focuses on the inspiration & journey of influential skateboarders, entrepreneurs, & masters of many disciplines. The goal of the show is to offer unique insight while inspiring & encouraging listeners. The show is available in audio form via iTunes, SoundCloud, & Stitcher. A video version of the show is available on YouTube.",
    "Gamblers, Fantasy and Daily Fantasy players, this show is for you.  Long time buddies, Sean and Brad discuss the NFL, NBA and MLB in a new weekly podcast which explores betting lines, fantasy matchups and identifies sleepers for your daily fantasy lineups. \n\nSean owns and operates The Functional Sportsaholic and Gold Standard Sports Forecasting.  The analytics he has generated have won over 60% of his NBA bets and 67% of his NFL bets the last three seasons.  Brad is an old school gamer, betting on gut and instinct.  The two will disagree.  They'll bicker.  …And they'll win. \n\nFor advertising opportunities on this show, or any of the other shows on our network, contact us at: advertise@underdogsportsnetwork.com",
    "ESPN's Ariel Helwani talks to the biggest names, addresses the hottest topics and previews/reviews the most important fight cards from across the world of MMA.",
    "Fantasy football the way it’s meant to be. From NFL news to fantasy player previews, we’re with you 24/7. It's time to hear the fantasy football podcast you've always deserved, so let’s talk some fantasy football.  Support this podcast: <a href=\"https://anchor.fm/letstalkff/support\" rel=\"payment\">https://anchor.fm/letstalkff/support</a>",
    "<p>Football fans Jason Cowley and Stephen Bush dig into the global political stories surrounding the 2018 World Cup.</p>",
    "The comedy football podcast devoted to the 2018 FIFA World Cup. Barry Castagnola is the host with a panel of funny guests ready to laugh at everything happening in Russia (unless it puts our lives at risk!).",
    "Stats Insider is changing the way you watch, enjoy, and bet on sport by combining the love of the game with serious stats. Get all the insights on your favourite teams and players. Who’s overvalued and undervalued? What is their chance of winning the next match?\nMore than a tipping service, more than a form guide, the Stats Insider machine learning models predict the performance of each individual player, based on hundreds of algorithmic factors for each sport.\nSo, unprecedented insights into the sports you love is what we do, now what are you going to do with it?",
    "James loves football. Andy hates it. Who will win the argument as the World Cup 2018 plays out? The listeners, that's who.",
    "Bringing you the latest news from the Iceland team as well as offering you an inside view of Icelandic fan culture, insight and interviews with the team and staff and everything you need to know to be a true Iceland supporter  without having to understand Icelandic!",
    "Robbie Savage & guests discuss all the Premier League talking points and have some fun along the way. Plus Joe Thomlinson’s social round up & Rob’s Mum gives us her predictions.",
    "A narrative show about football and the human connection behind the beautiful game.",
    "Discussion, analysis and conversation from OptaPro on data analysis and analytics within professional football.",
    "<p>Bob Mortimer and Andy Dawson's podcast - brass hands, blue drink and more. It's not really about football, d'you know what I mean?</p>",
    "Listen to the award winning Second Captains free to air podcasts, presented by Eoin McDevitt, Ciáran Murphy and Ken Early. Subscribe to daily shows at secondcaptains.com/join \r\n\r\nJoin The Second Captains World Service and get access to our daily shows and much more. Become a Second Captains member at secondcaptains.com. \r\n\r\n- iTunes Podcast of the Year\r\n- iTunes Essentials Top 10 Podcasts of All-Time\r\n- The Guardian's 50 Podcasts You Need To Hear\r\n- Ireland's Most-Downloaded Podcast",
    "Stoppage Time is now a weekly soccer talk show, debating anything and everything in the world of soccer: Premier League, La Liga, Serie A, Champions League, World Cup, Copa America, Euros, you name it we’ll talk about it.  Tweet @maxbarilpods to engage with the show!  You can support the show at: PayPal.me/stoppagetime.  Submit topics you’d like to hear discussed at: Tinyurl.com/stoppagetime",
    "The latest from the Premier League, EFL, European football and more!",
    "Five minutes after a brutal Met or Yankee loss Evan wants to talk about it. \nMinutes after the Nets or Knicks played a classic game on the west coast Evan \nwants to break it down. A long form discussion on Monday Night Raw or the \nlatest TV Show he’s obsessing over. On the Evan Roberts podcast he will \ngive instant reactions to events and talk about things normally not discussed \non the midday show.\n\n",
    "Bomani Jones and Pablo Torre discuss the hottest topics of the day with their own unique spin.",
    "All things Seattle Seahawks brought to you by the boys over at Seattlehawktalk.com",
    "\"The Tony Kornheiser Show\" (now available exclusively on-demand) is a topical, daily talk show that starts with sports and quickly moves into politics, current events, entertainment and, really, whatever happens to be on Tony’s mind that day. The format of the show—regular sit-in guests with familiar interviews and segments—highlights not only the unique perspective of Tony Kornheiser but also the expertise of his network of friends.Join one of the most recognizable and outspoken commentators of sports and entertainment (longtime radio host in Washington, DC and current co-host of ESPN's PTI) and enjoy original episodes published every weekday ‪starting September 6th.",
    "Straight From the Horse's Mouth Radio Show is an interview podcast that features the most unique and interesting people in the horse world. I talk with artists, authors, inventors, entrepreneurs, therapists, horse communicators, anyone with an innovative and creative approach to horses. If you are passionate about horses - this is the show for you!",
    "You own a horse.  Now what?  The one thing for certain is your need to learn more.  More about tack. More about horsemanship.  More about care and feeding.  More about everything horses.  Follow our weekly podcast and you WILL learn more.",
    "Equestrian Legends is an online radio show (podcast) that celebrates the lives of men and women from different disciplines who have shaped the horse world in their chosen fields and, by popular acclaim, have become a legend in their lifetime. Part of the Horse Radio Network",
    "This delivery stream includes current Podcast episodes from the Daily Strides Podcast for Equestrians.  Providing step by step guided instruction on a full range of different topics to do with horse riding and horsemanship.  All episodes have a full blog post published at https://StridesForSuccess.com. New episodes are available every Monday.  Stop riding endless circles in the arena with your horse by subscribing to the Daily Strides Podcast for Equestrians today and begin Making Every Ride Great",
    "The Horse Radio Network is the leading podcast network for horse lovers worldwide.  With many equine podcasts to choose from you are sure to find something you will love!   This is the All Shows Feed that will give you every episode of every show we do.  Individual shows are also available on your podcast player.  ",
    "Your daily NBA podcast giving you all the news, updates and analysis in 30 minutes from the hosts of the Locked on Podcast Network.  Highlighted by the guest Ben Golliver of the Washington Post, Sam Amick of the Athletic, plus Josh Lloyd's Monday show of local experts on the biggest stories with the hosts of the Locked on Podcast Network.",
    "Finally, a podcast celebrating all the women who know and love football. TFG Managing Editor Melissa Jacobs talks to the most prominent female voices in all aspects of the NFL and shares a weekly musing on the intersection of football, society and feminism. ",
    "From Mike Pesca, host of the popular Slate podcast The Gist, comes the greatest sports minds imagining how the world would change if a play, trade, injury, or referee's call had just gone the other way. \n\nUpon Further Review is a limited edition Slate podcast based on the book of the same name. Over the course of five episodes Mike and a roster of podcast All-Stars will explore counterfactual sporting scenarios through a combination of speculative fiction, investigative journalism and sound-rich narrative. \n\nFrom turning points that every sports fan rues or celebrates, to the forgotten would-be inflection points that defined sports, Upon Further Review answers age old questions, and settles the score, even if the score bounced off the crossbar.\n",
    "<p>Since 1984 every wrestling promoter has tried to beat Vince McMahon and the World Wrestling Federation unsuccessfully… except one, Eric Bischoff. From a “C-Team Announcer” to the President of WCW, Eric did it all! The nWo, Monday Night Nitro, and most importantly beating Vince not once, but 83 times in a row! Hear all about it on 83 Weeks with Eric Bischoff and Conrad Thompson!</p>",
    "<p>Mike Francesa's \"Mike's On,\" heard weekdays from 6-6:30 p.m. on WFAN</p>",
    "\n      NFL.com's \"Around the NFL\" crew (Gregg Rosenthal, Dan Hanzus, Marc Sessler and Chris Wesseling) break down the latest football news, with a dash of mirth.\n    ",
    "Jerin Allen and Daniel Bien-Aime discuss weekly developments in sports, entertainment and culture.",
    "JJ Redick, iconic and legendary college basketball player from Duke University and current player for the NBA’s Philadelphia 76ers has taken his sweet shooting stroke behind the mic. The Chronicles of Redick will bring fans closer to the players and the life of a professional athlete with this first of a kind podcast, from a current NBA player's perspective. Join JJ each week as he chats with current basketball personalities and close friends to give you an inside look beyond the court.\n    ",
    "Tony Kornheiser is back for another year of antics covering the sports world and beyond.",
    "Alec Baldwin brings listeners into the lives of artists, policy makers and performers.",
    "A weekly hockey podcast that talks about nothing but the NHL with analysis, interviews, opinions and information you won't get anywhere else.",
    "<p>Presented by David Law and Catherine Whitaker, The Tennis Podcast is a downloadable tennis radio show featuring weekly chat, big-name guests, interviews and daily editions at the Grand Slam tournaments.</p>",
    "\n      Former NFL scouts Daniel Jeremiah and Bucky Brooks break down the latest news and action around the league from a scout’s perspective, alongside NFL player personnel executives.\n    ",
    "<p>The RotoWire baseball staff covers fantasy baseball year round, including draft prep, in-season strategy and much more! Hosts include: Jeff Erickson, Clay Link, James Anderson, Scott Jenstad, Todd Zola and Tim Heaney.</p>",
    "We discuss football. And wear blazers. Usually at the same time. Men in Blazers is driven by the belief that Soccer is America’s Sport of the Future. As it has been since 1972. ",
    "Soccer analysis, analytics, and commentary with hosts Mike Goodman and Michael Caley",
    "Long-running American soccer show covering the USMNT, Premier League, Champions League, MLS, and more.\n\nIf you enjoy analysis and silliness in equal measure, we're the podcast for you.",
    "The dunk that launched a sneaker war. The first woman to throw down. These and more are the stories of ESPN's podcast mini-series.",
    "How do you go from losing to winning? Columbia University's football team hasn't won in two years. Each week, we see what it takes to make a comeback. This isn't just about football.",
    "View the Episode Archive »\nSubscribe to the podcast via iTunes | RSS.\n#smartbinge Radiolab podcasts\n",
    "On Tales From The Show, Daniel Bower interviews former Major League Baseball players about their careers and lives before and after the pros. We talk about everything from when they found their love for the game, to their favorite clubhouse memories, the first and last time they stepped on a big league diamond, to what they have been up to since their playing days. Whether you are a baseball fan who wants to learn more about your heroes while getting a rare glimpse into the reality of \"The Show\", or just want to learn what it takes to reach the pinnacle of a profession, this podcast is for you.",
    "MLB.com executive reporter Mark Feinsand provides a unique look at the people building our favorite teams by engaging in candid interviews with front-office personnel from around Major League Baseball. How they got into the game, why they do what they do, how they envision the future of baseball and much, much more.\n\nListen to or download individual episodes below, subscribe via iTunes or use your RSS reader so you never miss a single episode.",
    "What is the Hoopchalk Basketball Podcast? The Hoopchalk Basketball Podcast is the best Youth Basketball podcast for young AAU basketball players and their families. Our motto is - NO MORE GUESS WORK! Our mission is to help young basketball players and their families successfully navigate the ever-changing world of youth basketball.\n\nIn this podcast we will unlock all of the locked doors that have become road blocks for youth basketball players. We will also help those who dream, but have no idea how to move towards their basketball goals. Figuring it out alone is a pretty daunting task. I was in your shoes. My son Moses and I invite you to learn from our wins and our losses. We hope it will help someone else in their basketball journey. \n\nIn this podcast, we will cover everything about youth basketball - from what to look for when joining a team, to college recruiting, to social media, and even how to develop the mental toughness that will allow your young athlete to soar in games.\n\n\"There I was with this kid who wanted to follow his dream of playing pro basketball and, as a non-basketball parent, I had no idea how to make it happen. When I asked others, I constantly heard things like - 'You just have to be good and people will find you.' I knew that waiting for the phone to ring couldn't be the key to success. So I started digging and I found out that, like every career, there is an actual path that you MUST take to even have a chance. I am excited to share my findings with you. Let's work together to make this happen for our little and not-so-little ballers!\" - Troy Horne\n\nTroy and Moses Horne\n\nSee you inside episode 1! Troy and Moses Horne hoopchalk.com",
    "Join Jim Litke and Tim Dahlberg for their newsy take on the week in sports, backed by the shoe leather, insight, experience and worldwide reach of The Associated Press sports department. Over the last three decades, they've covered every major championship around the globe multiple times, so expect cameos from big names and guests drawn from the week's headlines.",
    "A podcast about the lives of mountain climbers.",
    "Building on the belief that a deeper understanding of the natural world enriches all of our lives, host Steven Rinella brings a deep and relevant look at all outdoor topics including hunting, fishing, nature, conservation and wild foods. Filled with humor, irreverence and things that will surprise the hell out of you, each episode welcomes a diverse group of guests who add their own expertise on the vast world of the outdoors.\n\nPart of MeatEater, Inc.",
    "<p>The Yahoo Sports MLB crew talks baseball in a weekly show that includes interviews, analysis and more.</p>",
    "<p>NASCAR’s 15-time Most Popular Driver and winner of two Daytona 500s, Dale Earnhardt Jr., hosts his very own podcast, The Dale Jr Download on Dirty Mo Media. Earnhardt and co-host Mike Davis raise the bar with unparalleled perspective, candid commentary, and fascinating, first-person insight into the life of a broadcaster, celebrated racer.</p>",
    "Lauren Fleshman and Jesse Thomas are world class professional endurance athletes, authors, speakers, and co-own a nationally distributed food products business called Picky Bars. They also happen to be married, still, and are raising two small children. They use their experience, stories, writing, and humor to answer to answer listener questions about sports, family, business, and the balance between all three! It's a circus, but hey, we're all in it together!",
    "Every four years, people all over the world turn their eyes, ears, and hearts toward the most exciting sports competition on the planet: The World Cup. We Came to Win tells the stories behind the tournament’s most memorable moments. Like, how did one player become a God, and a villain, after breaking the rules? How did the semi-final of the 1990 World Cup save English soccer from falling apart? And how did one player turn a free-kick into an act of protest?\n\nThis series from Gimlet Media is an homage to the triumph and heartbreak, victory and defeat that we all experience from soccer (or football, or futbol, or whatever you call it). And it reminds us that so much of what we love about the beautiful game happens off the pitch.\n",
    "These are the people who took a hard left. Traded in their chips and changed their minds – all in the name of fresh air. And to get inside the minds of these enterprising misfits, we are letting them interview each other. Each week, teacher becomes student, interviewee becomes interviewer, grasshopper becomes… bigger grasshopper.",
    "For over forty years Jim Ross has been the Voice of Wrestling. From starting as referee in the regional territories to becoming the Executive Vice President for WWE, nobody has a story quite like Jim Ross.  From recruiting and hiring some of the biggest superstars in the industry to providing the soundtrack for the most important moments in wrestling history, \"Good Ole JR\" was there for it all. Join us every Thursday morning as Conrad Thompson grills JR like you've never heard before, uncut and uncensored!",
    "Get all the mixed martial arts fighting news and analysis you need. On Tuesdays, Peter Carroll and Niall McGrath tackle the latest MMA news in Europe on \"Eurobash.\" And on Wednesdays, Jose Youngs and others discuss the week's hot topics on \"The A-Side Live Chat.\" Produced by MMAFighting and SB Nation, and part of the Vox Media Podcast Network.",
    "High-impact interviews for those who love adventure and the outdoors. Host and journalist Shelby Stanger interviews world-class explorers, athletes, authors, scientists, health experts, and entrepreneurs about how they’ve taken their own wild ideas and made them a reality, so you can too. Some of the wildest ideas can lead to the most rewarding adventures. Take a listen to start living more wildly today.",
    "Co-hosted by BJJ Blackbelt Brenton McKiterick as well as The Unknown's founder/head coach Macgregor McNair, this podcast is designed to interview coaches, fighters and strength coaches who have built, innovated and accomplished incredible things in the combat sports and strength coaching fields.  Our true passion is to share high-quality information, and interesting insights from men and women at the top of their game.",
    "<p>Portland Trail Blazers star - and former journalism major at Lehigh – CJ McCollum hosts Pull Up alongside Jordan Schultz, of \"The Boardroom\" on ESPN+. Pull Up is a one-of-a-kind show that will give an unmatched look into the NBA and the life of a basketball superstar. CJ has been lauded as the next breakout star in sports media. But why wait till he retires to begin his next career? In Pull Up, CJ will talk about everything from where star players will go in free agency, to what it’s like to drop 50, to his favorite glass of wine. Pull Up will provide unmatched NBA access, plenty of laughs, and world-class guests in an unprecedented sports podcast showcasing an NBA and media star at the height of his career.</p>",
    "Mike Greenberg and Jalen Rose will be combining their unique personalities for Get Up, weekdays at 7 a.m. ET on ESPN. Get Up, get sports, get going.",
    "The True Players Podcast - Clipps & Drew break down the NBA and Hoop Culture from Aaron Afflalo to Zydrunas Ilgauskas and everything inbetween. Tune in for educated, unique commentary from two hosts that love listening to the sounds of their own voices. The Follow Through will feature guests from all facets of life... Passion is Priceless, find yours!",
    "Bomani Jones weighs in on sports, pop culture, social topics and much more from NYC.",
    "The Sports Media Podcast with Richard Deitsch is a weekly show that features interviews with members of the sports media about their work, as well as roundtables with sports media reporters about television, digital, audio/radio, print, and other forms of media. You can read Richard’s work at The Athletic and hear his words at Sportsnet 590 The Fan in Toronto.",
    "\n      <p>If you love Chris Rose and Kevin Millar on MLB Network’s <strong>Intentional Talk</strong>, then you’ll love <strong>Intentional Talk: Caught Listening</strong>. Caught Listening will provide fans with an original continuation of the TV show’s antics, interviews, and everything in between. Subscribe and listen, every Wednesday, starting&nbsp; March 28th!</p>\n    ",
    "\n      <p>Whether you call it football or soccer, you can’t understand it without understanding the modern world — and you can’t understand the modern world without understanding its most popular sport. Join host David Goldblatt for conversations about politics, culture, economics, immigration, religion, cinema —&nbsp;and of course, some all-time favorite goals.</p>\n    ",
    "ESPN fantasy experts Eric Karabell and Tristan Cockroft provide strategy, game overviews and injury reports.",
    "Sports Podcast featuring Frank Kaminsky",
    "A comedic look at the world of sports and pop culture! Hosted by Dave Dabbah. The Show covers the NFL, NBA, MLB, NHL, NCAA, and the world of entertainment. We could say more but trust us the show is funny...",
    "Marty Smith's America...The Podcast is an original podcast that incorporates Marty's unique brand of storytelling. Join the Marty Party to hear conversations with the biggest names in sports and entertainment. ",
    "A look into the lives of professional Indycar drivers, reality television stars, and great friends James Hinchcliffe and Alexander Rossi. Though Hinch and Rossi have seen plenty of success on the track, the show is meant to highlight their off-the-track lives, including their unfiltered opinions on what’s trending in popular culture, with each episode featuring a number of recurring, unscripted segments and an interview with a celebrity guest. Off Track is at heart a sports show, but Hinch and Rossi are well-versed in popular culture and have experience relating to influential figures across a variety of disciplines. The interviews consist of athletes, artists, and entrepreneurs -- really anyone with a passion for what they do, regardless of what that is. This is the first original production from CastBox.&nbsp;",
    "Subscribe and download 'The OTP: The Official Titans Podcast', produced by the Tennessee Titans",
    "The ultimate guide to decreasing pain, optimizing athletic performance & finding your true strength by Dr. Aaron Horschig. ",
    "<p>3 and Out with John Middlekauff, is part of the Colin Cowherd Podcast Network. 3 and Out is an unfiltered podcast covering the biggest stories in the NFL and college football. John brings his unique perspective as a former NFL scout, NFL analyst and radio host. In each episode, John will give his opinions and discuss the top stories in the football world. Follow John on twitter @JohnMiddlekauff and go to theherdnow.com to find the latest content. Subscribe now!</p>",
    "\n      <p>Julius ‘Dr J’ Erving is in the house and he’s letting listeners into his incredible life.&nbsp;&nbsp;Each episode focuses on the passions that drive this legendary man, from youth and education, to music and business, and of course basketball.&nbsp;Join Dr. J and influential friends from the worlds of sports, culture and entertainment each week for engaging and topical conversations. It’s just what the doctor ordered.&nbsp;</p>\n    ",
    "\n      Figure skating legends, turned commentators, now pop culture icons but more importantly, best friends. Enjoy the ride with Tara Lipinski and Johnny Weir on NBC.\n    ",
    "\n      <p>The official NBC Olympics podcast, from Vox Media and NBC Sports Group. Join us for insider coverage during the 17 intense days of competition at the 2018 Olympic Winter Games in PyeongChang.&nbsp;In the run-up to opening ceremonies, hear in-depth interviews with your favorite Winter Olympians. Plus, explorations of host country South Korea’s culture, history, and more from industry experts.</p>\n    ",
    "Welcome to the Book Club Track Club: a monthly book selection + podcast discussion curated by pro distance runners Alexi Pappas and Kyle Merber.",
    "PWTorch editor Wade Keller brings you post-show coverage following WWE Raw and Smackdown with a rotation of guest cohosts from the wrestling journalism and podcast field, plus live on-site correspondents from the arenas, live callers, and mailbag segments.",
    "Jeff Marek and Elliotte Friedman talk to a lot of people around the hockey world, and then they tell listeners all about what they’ve heard and what they think about it.  Plus, look for bonus episodes featuring interviews with personalities in the game or famous fans.",
    "The mountain bike & action sports podcast. \nThe HKT Podcast is brought to you by UK based distribution company HKT Products Ltd. We chat to the worlds biggest athletes, brand owners and personalities from a variety of different disciplines including mountain biking, BMX, motocross & more. \nIn short, we chat to rad people and have fun whilst doing it! \nDon't forget to follow us on our social media, subscribe and share your favourite episodes. \nEnjoy.Share.Ride\n#listentothehktpodcast",
    "A real life view inside College Football and the NFL. Told to you by the players and coaches that live it.  \n\nThe Host: Drew Lieberman\n\n•YouTube •Instagram •Twitter - @sidelinehustle",
    "Necessary Roughness is a funny, irreverent “morning show” styled sports talk show, bringing the energy and the fire on all of the topics that you care about! The show is hosted by Eric “E-Will” Williams, Cj Cobb and Christie Maggard",
    "CRAIG CARTON IS BACK.  FOR NEARLY THREE MONTHS HE WAS SILENT BUT NOW HES BACK.  THE FORMER HOST OF BOOMER AND CARTON AND THE MOST LISTENED TOO LOCAL MORNING SHOW HOST IN AMERICA IS BACK.  IF YOU LISTENED TO HIM ON WFAN RADIO OR WATCHED HIM ON CBS SPORTS NETWORK YOU WONT WANT TO MISS A SINGLE SECOND OF HIS PODCAST.",
    "Mariners general manager Jerry Dipoto and broadcaster Aaron Goldsmith sit down to discuss the latest news and developments with the Seattle Mariners, from the viewpoint of the front office.\n\nListen to or download individual episodes below, subscribe via iTunes or use your RSS reader so you never miss a single episode.",
    "<p>On Kanell &amp; Bell, hosts Danny Kanell and Raja Bell bring their professional sports experience to podcasting. Danny and Raja combined to come off the bench 241 times in their 18 years in the pros, now they're coming off the bench and behind the microphone 5 times a week to give raw sports insight from a former player's perspective.</p>",
    "Road Trippin': NBA is the natural evolution of its predecessor - \"Road Trippin': Richard Jefferson vs. Channing Frye.\" Stars from around the NBA take you on the road as they discuss everything going on in their world and the world as a whole. Come along for the ride.",
    "Podcast with 4-Time Fittest Man on Earth Rich Froning.",
    "🏀Louisville, KY native, born in the heart of college hoops and now, scandal. College basketball was rocked with scandal and corruption, as if we didn't already know that. Clearly not isolated, we look back at the most interesting recruitments in NCAA history. Timelines, context, red flags.. ",
    "ESPN gambling analyst Doug Kezirian and his cast of guests take you inside the world of Las Vegas as they explore the games surrounding the games on the field.",
    "\n      <p>During a coaching career spanning more than three decades, Les Miles has established himself as one of the most fascinating figures in all of sports. Regarded almost as much for his press conferences antics as his on the field accomplishments, Les’ reputation precedes itself. The Les Is More Podcast will quickly become a must-listen for anybody who loves college football. Combining a first-hand insider perspective with a distinctively personal and quirky approach, this weekly offering will cover the latest storylines on the college football landscape, as well as anecdotes and intimate experiences shared by Coach Miles, his family and the various figures he’s befriended throughout the years. For those in the know, this podcast isn't merely a part of the conversation surrounding college football — it is the conversation.</p>\n    ",
    "Cam Connor played in the NHL, winning the Stanley Cup, but he's known for two things: being one of hockey's toughest enforcers and telling a great story.In this podcast, with his son Kristofer Connor, listen to Cam share some classic hockey stories, including being one of two players to play with Wayne Gretzky and Gordie Howe, growing up with his best friend Rowdy Roddy Piper and how he saw the hockey world - his view from the penalty box.",
    "House of Highlights brings you the ultimate NBA fan podcast, hosted by four childhood friends talking all things NBA both on and off the court. Whether you're a casual fan or live and die for basketball, you won't want to miss Kenny, Pierre, Mike and Darrick bringing their hot takes to the mic, two times a week.",
    "RotoGrinders Daily Fantasy Football podcasts help you build better NFL DFS lineups for DraftKings, FanDuel and more!  Our team of expert analysts break down the NFL slates and give you the best data-supported advice in the business.",
    "This daily fantasy podcast is your first word in with game analysis for the upcoming slate at DraftKings, FanDuel, DRAFT and FantasyDraft.  StevieTPFL gives picks and talks game theory for Daily Fantasy Baseball, Daily Fantasy Football, Daily Fantasy Basketball and more.",
    "Nick Wright & Jenna Wolfe discuss the biggest stories in the world of sports. From LeBron James, to Tom Brady, this show will bring you the first, and most incisive, opinions on the best sports stories.",
    "El Pres, Big Cat and Rico Bosco break down the College Football slate from a degenerate gamblers point of view",
    "The ESPN College Football Podcast with Herbie & Pollack is hosted by Kirk Herbstreit, David Pollack and Kevin Negandhi. They will kick off each week on Monday discussing the games from that weekend. On Wednesday's, they react to the rankings and Friday's look forward to the biggest matchups ahead. This is the place to get all your college football info from the top analysts in the sport.",
    "Mina talks all things football with her unique brand of humor and insight. Her friends join each episode to talk about the NFL's latest storylines along with her football loving dog, Lenny, making frequent contributions.",
    "A new show. Fresh content. A different beast.",
    "Golden State Media Concepts’ Football Podcast is dedicated to college and NFL football. You’ll get all of the latest news, both on and off the field.",
    "<p>Fantasy Football Weekly is America's longest-running fantasy football radio show—and is now available as a podcast. The show is hosted by Fantasy Sports Hall of Famer, Paul Charchian, and includes co-hosts from legendary fantasy site Fanball.com. Each episode of Fantasy Football Weekly provides data-driven fantasy advice for every listener. We break down every NFL matchup from a fantasy standpoint, unearth sleepers, and answer the toughest questions facing fantasy owners. New episodes are available every Friday evening featuring previews of the upcoming NFL schedule.</p>",
    "James Richardson and the Totally Football Show team are here three times a week for the 2019/20 season. On Mondays, it's the Premier League; on Tuesdays, we're all about Europe; and on Thursdays, we'll wrap up everything from midweek and look ahead to the weekend",
    "www.areyouhearingthispod.com\nWe are a podcast featuring Jago M. and J. Smooth. Bringing you our take on Sports and Entertainment. Our conversation consists of NBA, NFL, college sports, music, and movie reviews. New pods drop every Monday & Friday! Always safe for work!",
    "Fantasy Football Weekly runs on Saturday mornings on KFAN AM 1130 in Minneapolis/St. Paul. The show is hosted by Paul Charchian from LeagueSafe.com.",
    "A daily round-up of the best of The Jim Rome Show",
    "What happens when the best athletes in the world lose? From Gatorade and Gimlet Creative, a podcast about how the world’s most competitive athletes use defeat as motivation to build strength from the inside out, and ultimately come out on top. Episodes featuring Serena Williams, Peyton Manning, Eli Manning, Matt Ryan, J.J. Watt, Karl-Anthony Towns Jr., Kyle Schwarber, and the people who know them best. The Secret to Victory premieres in July.\n \nVisit gatorade.com/podcast to learn more.\n \nThe Secret to Victory is hosted by Domonique Foxworth.",
    "'Sports Related' is a one-of-a-kind look at sports, pop culture, and entertainment, hosted by brothers Jordan Rodgers (SEC Network, The Bachelorette) and Luke Rodgers (CBS Sports). The show is rife with comedy, rants, surprise guests, and interviews with celebrities, athletes, and superstars of entertainment. It is a hilarious, pointed, and surprising look at the most up-to-date and relevant sports and non-sports happenings on planet earth.",
    "A podcast about the Golden State Warriors, the NBA, and other things. Featuring The Athletic's Ethan Strauss.",
    "\n      <p>Daredevils. Moonshiners. Women. TV. All of them had a role in creating the phenomenon of NASCAR, a sport that is all-American in more ways than you think. Host Rich Phillips, voice of Texas Motor Speedway, takes you behind the scenes and under the hood as he traces the history of stock car racing from its moonshine-running roots, to its current position at the forefront of technical innovation.</p>\n    ",
    "The Power Trip Morning Show - Sports, Movies, Music, Comedy and more...",
    "30+ year veteran Hall of Fame pro wrestling journalist Wade Keller from Pro Wrestling Torch Newsletter and PWTorch.com discusses the top stories of the week in pro wrestling with top-level guest cohosts and interviews pro wrestling's newsmakers each week. 640160",
    "Howard Beck takes on the biggest topics and invites A-List guests along for a fast-moving NBA podcast from Bleacher Report that goes the full 48.",
    "Great Sports Talk every weekday from 2-6pm.",
    "The HoopsHype Podcast With Alex Kennedy will bring you in-depth interviews with NBA players, executives, coaches and agents to give you a behind-the-scenes look at The Association.",
    "Matt and the Gang bring you the latest in UK news and views Mon.- Fri. from 10 to noon.",
    "Welcome to the official podcast account of 'The Dude & Bird Show.' Listen to these two Townies get loud about Boston sports & other nonsense every weekend. (Recorded on Saturdays) Follow on IG/Snap/Twitter: @dudeandbirdshow @HardiDude @JBird382 #GetLoudBoston #TDBS",
    "Let 'em Play Ball is a basketball podcast which shares the insiders knowledge on everything from AAU, High school, College and Pro Basketball.\nWe share valuable information to aid both parents and players alike as they aspire to take their own path to reach their Basketball goals and dreams. The information shared on this podcast will change your perception of the game and teach you the Do's and Don'ts, politics and business decisions that ultimately affect the player in ways they never imagined.\nSome of the most influential and impactful people stop by to share their stories with us in hopes of helping both parents and players gain clarity on everything from rankings to sneaker sponsored teams to why bad basketball is never going away. Why Listen to the Let'em Play Ball (basketball) Podcast? \nIt's simple, because the more you know the \"Game Behind the Game\" the better your chance of reaching your goals and dreams!\n\nBecome a patron on our Patreon for full interviews!",
    "Paul Finebaum provides his unique takes on the SEC and the world of college football.",
    "\n      Inside info on the Dallas Cowboys every week from Matt Mosley and Ed Werder, two guys who have covered the team for a combined 41 years working for The Dallas Morning News and ESPN. Occasional guests include Cowboys players past and present, some of the top analysts in the NFL, and Matt & Ed's egos.\n    ",
    "\n      <p>Your one stop shop for awful takes and general sports lunacy. From the only sports site worth a crap. Hosted by Drew Magary and David Roth</p>\n    ",
    "Join CBS Sports insider Brian Campbell as he brawls his way through the worlds of boxing, WWE and mixed martial arts in separate episodes each week. BC and his guests will share their unique takes on the hottest topics from the combat sports you love while welcoming in big-name guests.",
    "WWE Hall of Famer Jim Ross, considered the greatest announcer in wrestling history, brings his incredible celebrity roster of friends, his insight and analysis of today's wrestling stars and storylines, and YOU to his weekly discussion of everything squared circle. Join in the fun as Good Ol' JR takes your calls, makes a few of his own, and spreads the wrestling love around the globe.  To access the entire Ross Report archive,  go to PodcastOne.com.",
    "Live from Hollywood, CA by way of the Broken Skull Ranch, Pro Wrestling Hall of Famer, Action Movie/TV star, Steve Austin talks about anything and everything that pops into his brain.  Steve shares tales from his new life, unbelievable past adventures, talks to pro wrestling pals...you name it, Steve's on it.  For more episodes, go to podcastone.com/premium<br><br>\nGot questions? <a href=\"mailto:questions@steveaustinshow.com\">questions@steveaustinshow.com</a>\n",
    "\n      <p>Kyle Martino of NBC Sports takes a deep dive into some of the most debated topics bouncing around the soccer community. The former MLS and USMNT player examines a variety of subjects each week with thorough insight and analysis. Subscribe and dive in!</p>\n    ",
    "Soccer takes itself too seriously. We change all that with a swift boot to the ear. Hear weird news, comedy sketches, infighting, and merciless takedowns from the writers and editor of the award-winning blog DirtyTackle.net. From the pitch, to the stands, to the dregs of FIFA headquarters, no one is safe.",
    "Welcome to The Dive, a weekly podcast hosted by Kobe and Azael that takes a closer look at the world of League of Legends esports and the NA LCS. Releasing on Wednesday every week, the gang will be diving into the biggest international news, meta shifts and solo queue trends, and in-depth analysis of the NA LCS.\n\n#TheDiveLOL",
    "The Dak and Dunc Show is back and better than ever! A lot has changed since our last pod, and we'll catch you up. We'll also talk plenty of basketball and whatever else interests us each week. You'll hear from some familiar names each week as well. Thanks for coming back, we've missed you.",
    "Each morning, multi-platform sports personality Clay Travis shares his informed, outspoken, fearless and often funny commentary on the latest sports headlines, as well as pop culture commentary, interviews and listener interaction.",
    "Golden State Warriors star Draymond Green is joined by award-winning sports journalist Marcus Thompson and hops behind the mic to give his raw and unfiltered takes on everything on and off the hardwood.\n    ",
    "Michael Smith and Jemele Hill use their skill and personality to delve into a variety of topics from many different angles.",
    "\nHosted by RW Editor-in-Chief David Willey, The Runner’s World Show podcast brings listeners inside the runner’s world. The weekly mix includes stories of ordinary athletes doing extraordinary things, exclusive interviews with notable names in the sport, the latest from the experts on training, gear, injury prevention, and nutrition, and what’s happening behind the scenes at Runner’s World.\n",
    "The Players’ Tribune is the first content platform created, curated and controlled by athletes, providing unique insight into the daily sports conversation. Founded by Derek Jeter, The Players’ Tribune publishes first-person content from athletes, bringing fans closer than ever to the games they love. The Players Tribune Oral History Podcast Series will take fans inside the journey of some of the most historic moments in sports, told by the players that played it and lived it.",
    "\"I am a bowhunting athlete, training intensively each and every day to become the Ultimate Predator.\" - Cameron Hanes",
    "Stephen A. Smith offers up his unique perspectives on the world of sports and much more.",
    "Daily baseball statistical analysis and commentary",
    "The Sufferfest is a comprehensive training resour…",
    "Hosted by Hall of Fame basketball coach and bestselling author, John Calipari, Cal Cast is a weekly show with a focus on sports, leadership and achieving success.  Each episode will feature a conversation between Coach Cal and a high profile guest from the world of sports, business or entertainment.",
    "He’s a multiple world champion pro wrestler, lead singer of Fozzy, and a New York Times best-selling author. Listen in as Chris Jericho interviews some of the biggest names in wrestling, entertainment, comedy, and the paranormal. Don’t miss his unique, engaging, weekly take on all things pop culture.",
    " Your daily dose of all things NBA! The Hoops on Fox podcast gives you the BEST basketball conversations from Fox Sports including studio show interviews, special content from Chris Broussard, post game interviews from NBA stars around the league and much more!",
    "Adam Schefter talks with the biggest names in and around football, taking you inside what makes them tick and how they got to where they are.",
    "You know 'em, you love 'em. Longtime friends and veteran voices, Mike Golic and Trey Wingo, join forces to bring you \"Golic and Wingo.\" Sports, life and the biggest names in the game... Every day. You ain't heard nothin' yet.",
    "Original audio documentaries from the makers of the acclaimed 30 for 30 film series, featuring stories from the world of sports and beyond. 30 for 30 offers captivating storytelling for sports fans and general interest listeners alike, going beyond the field to explore how sports, competition, athleticism and adventure affect our lives and our world. Sports stories like you've never heard before.",
    "ESPN MLB Insider Buster Olney leads the baseball discussion alongside other top analysts.",
    "It's the most comprehensive Fantasy Baseball Podcast you'll find. We're dedicated to helping you win your league while keeping you entertained at the same time. Find out who to add, drop, start and sit while getting the best advice every day.",
    "Sports and fantasy sports collide as one man tries to cover everything under the sun or fall asleep trying.",
    "Interviews from top skiers in the world about fitness, nutrition, routine, overcoming fear, loss of friends and more...",
    "Welcome to the place where action sports, celebrities, and badasses collide.  Hosted by professional off-road racer, media personality, and nationally syndicated radio host Jim, this show is your weekly glimpse behind the scenes with some of the biggest personalities in the world today from Action Sports, MMA, Racing, Sports, Hollywood, and Music.  Join Jim and some of his badass friends every Thursday as they take you on a ride you won't find anywhere else.  Suggesting a Guest or Topic? Hit up @JimBeaver15 on Twitter or Instagram!",
    "Wrestling Perspective  hosted by NWA's Eli Drake and Denis Farrell",
    "\n      So you want me to cast my pods? The least you can do is subscribe to them. What’ll you get? Interesting conversations that veer toward the politically incorrect the same way a Phil Mickelson tee shot veers toward a hospitality tent. That said, my approach to interviewing is simple: “I have guests not victims and the only stupid question is the one that’s not asked. (Unless you count the idiotic queries Gary McCord texts me on a regular basis.) Go ahead and subscribe. It’s free and I guarantee the interviews will at least rise to the value of that price point.\n    ",
    "The ModGolf Podcast talks with golf's top influencers, entrepreneurs, innovators and disruptors about their vision and solutions to re-imagine, transform and grow the game.\nThe ModGolf Podcast has been ranked #5 on 2018's most comprehensive list of \"Top 25 Golf Podcasts\" (https://blog.feedspot.com/golf_podcasts/), based on our quality and consistency of posts, industry expert reviews and social media influence/popularity. Please subscribe to The ModGolf Podcast to help us grow and move up the rankings in 2019!\n</b>\nWe are also proud to have Golf Genius Software (https://www.golfgenius.com/) British Columbia Golf (http://britishcolumbiagolf.org/) and NextLinks (http://www.nextlinks.com/) as ModGolf Podcast Sponsor Partners! Without their generous support, we wouldn't be able to bring you these engaging golf innovation stories.\nSponsor Partners https://files.fireside.fm/file/fireside-uploads/images/1/1ea879c1-a4a2-4e10-bea4-e5d8368a3c7a/TmU0F2PO.jpg (http://britishcolumbiagolf.org/)\n</b>\nWe'd love to hear from you! Have any ideas or guests you'd like to hear on future episodes? Contact Colin directly here (https://modgolf.fireside.fm/contact) or on Twitter @ModGolfPodcast (https://twitter.com/ModGolfPodcast) to start the conversation.\nThe ModGolf Podcast https://uploads.fireside.fm/images/1/1ea879c1-a4a2-4e10-bea4-e5d8368a3c7a/rav5Zc0l.jpg\n",
    "Podcast by Golf Digest",
    "Sean Zak and Dylan Dethier bring a fresh perspective to covering all things in the sport, bringing insider knowledge, unconventional insights and lively interviews with the game’s most entertaining characters. Join us weekly in the Drop Zone!",
    "We help golfers understand what it ACTUALLY takes to get better at golf and perform your best. \n\nIgnore the BS and cut to truth as we talk with leaders in the industry, from professional golfers, coaches, instructors, biomechanists, researchers and more. \n\nHost, Cordie Walker is on a mission to figure out how to improve the way we learn and get better at golf.",
    "Winning is a mental skill, mastered by the best of the best, and held as a secret by those dominating the competition. Not anymore. In this weekly podcast, join Dr. Bhrett McCabe, a clinical sports psychologist to multiple National Champions and Pro athletes and a former 2X Division 1 National Champion himself, as he exposes the “secrets” of human performance through in-depth interviews with world class athletes, elite-level coaches, and the most brilliant business minds in the world. New episode drops every week!",
    "Your body is your most valuable piece of golf equipment and our most important weapon in the war against bogies.  Join us for weekly episodes containing proven, practical advice, great stories and strategies to inspire you to reach your golf and fitness goals…and to finally eliminate the snowman.  ",
    "Jay's Plays, hosted by Jay Flemma, is a podcast featuring in-depth interviews with voices spanning the golf universe, including writers, golf course architects and more.",
    "My radio show, Teeing It Up with Jeremy Schilling, is a 30-minute show looks at the world of sports using insightful analysis and thought-provoking interviews",
    "The 19th Hole Golf Show is a golf podcast featuring in-depth, intelligent discussion of the most important topics in golf. Host Ryan Ballengee from Golf News Net talks about recent events and issues on the PGA Tour, European Tour, LPGA Tour and other major golf tournaments around the world. He digs in on golf course architecture, fantasy golf, golf travel and the issues facing the business of the game. Ryan covers a little bit of everything in golf, and he's joined occasionally by some of the biggest names in the game to provide perspective.",
    "\n      <p>GolfChannel.com writers discuss and debate the latest news from the PGA Tour, European Tour, LPGA, Web.com Tour, Champions Tour, College Golf, and the amateur game.</p>\n    ",
    "Matt Barrie and Michael Collins break down the latest news and trends from the world of golf.",
    "Shane Bacon brings you a weekly podcast discussing the world of golf from all angles. Shane speaks with current and former stars from the world, while bringing you the best stories in the game.",
    "State of the Game was one of the first golf podcasts to hit the internet and remains one of the most respected. Hosted by Rod Morri and boasting two of the game's most important voices in co-hosts Mike Clayton and Geoff Shackelford, State of the Game is the go to podcast for untainted and unfiltered analysis of the game at every level. If you're looking for swing tips and gear reviews you've come to the wrong place but for thoughtful discussion about the big issues facing the game you'll find this a comfortable home.\n",
    "Australian golf podcast co-hosted by Andy Maher & Mark Hayes, covering all areas of the game across Australia and around the world. This golf show will deliver compelling interviews with a variety of guests that golf fans will love.",
    "Join Mark Allen and Craig Spence each week as they discuss the latest from the world of golf.",
    "The iSeekGolf podcast is a weekly audio show which offers coverage and opinion on all aspects of the game with interesting insights, interviews and guests.\nFrom authors, journalists and commentators to players, administrators and the all-important every day golfer, the iSeekGolf podcast serves as the \"director's commentary\" on iSeekGolf's comprehensive coverage of the game.\nWe’ll talk about the latest in tour news, golf books, travel destinations, equipment, instruction, course architecture and more and just one rule will guide everything we do: if it’s interesting, fun and to do with golf, you’ll hear about it on the iSeekGolf podcast.\n",
    "Jalen Rose and David Jacoby give the people what they want, breaking down sports and pop culture as only they can.",
    "Locked on Celtics is a daily Boston Celtics podcast by MassLive beat writer John Karalis. It's an inside look at the C's from a former professional basketball player who is at practices & games. Hear from players, call in to the voicemail line, and hear from some great guest hosts. It's the #1 podcast choice for Celtics fans. Part of the Locked on Podcast network.",
    "Host Brad Rowland brings you a daily glance at the Atlanta Hawks and the NBA with the latest insight, analysis and news that every fan of the team needs. Locked On Hawks is part of the Locked On Podcast Network. #atlantahawks #hawks #nba",
    "<p>Troy Haliburton and guests talk Washington Wizards, and recap news around the NBA with daily Locked on Wizards podcasts, part of the Locked on Podcast Network.</p>",
    "Jeff Garcia, original co-founder of Project Spurs. He is also the former co-host of ESPN San Antonio's \"Halftime Sports,\" and currently is the Spurs writer for News 4 San Antonio & Fox 29 San Antonio. He hosts a daily look inside the San Antonio Spurs and the NBA with the Locked On Spurs podcast, part of the Locked on Podcast Network #spurs #nba",
    "Gavin Schall and Alex Wolfe host the Locked On Knicks podcast, giving you a daily look inside the New York Knicks and the NBA with all the latest news, insight and expertise. From Clyde-isms, to Mitchell Robinson highlights, to rampant draft and free agency speculation, Alex and Gavin have you covered every day on Locked On Knicks, part of the Locked On Podcast Network.",
    "Brady Trantham is the lead Oklahoma City Thunder insider for 107.7 The Franchise in OKC. In addition to his Franchise duties -- content can be found on thefranchiseok.com, co-host of the OKC-82 Podcast -- Trantham now heads the Locked On Thunder Podcast, part of the Locked On Podcast Network. Join Brady as the Thunder reposition and replenish their way back to the top of the NBA. Trantham has covered the Thunder since 2014 with Thunder Digest and the Franchise in 2018. Brady is on the ground every day with the team from practices, shoot arounds, games, charity events and everything in between. A native Oklahoman, Trantham provides insight, thoughtful questions and some fun to cure your OKC Thunder content fix. #thunder #nba #thunderup",
    "Locked on Rockets, part of the Locked on Podcast Network, offers a daily look inside the Houston Rockets and the NBA. The show is hosted by Jackson Gatlin (@JTGatlin), a producer with the Rockets' flagship station SportsTalk 790. #Rockets #NBA",
    "Hosted by Fear the Sword site manager Chris Manning, the Locked On Cavs podcast is a daily look at the Cleveland Cavaliers. As the Cavs move on from the second LeBron James era and builds around Kevin Love, Collin Sexton, Cedi Osman and whomever they take in June, this is the show that will keep you up-to-date on the team and make you the smartest fan in the room. The show is part of the Locked On Podcast Network, the No. 1 daily local sports podcast network. \n\nReach the show at lockedoncavs@gmail.com or @LockedOnCavs on Twitter and Facebook.",
    "Anthony Irwin brings you a daily look into the Los Angeles Lakers and the NBA. He digs deep into all the latest around LA's premiere franchise on \"Locked On Lakers\" podcast, a part of the \"Locked On Podcast Network\". #nba #lakers",
    "Ben Beecken brings you an in-depth, daily look at the #Wolves and the NBA. Locked On Wolves is the best way to get quick-hitting, accurate, and year-round Minnesota Timberwolves analysis. The Locked On Wolves Podcast is part of the Locked on Podcast Network. Follow @bbeecken and @lockedontwolves on Twitter to stay up-to-date with the latest Wolves news and reaction. #NBA #Timberwolves #Twolves",
    "Locked on Clippers, a daily LA Clippers podcast from hosts Charles Mockler (@charlesmockler) & William Updyke (@willupdyke). Part of the Locked on Podcast Network. Check back every weekday for new content about the NBA & Los Angeles' greatest basketball team...THE CLIPPERS.",
    "The Locked On Mavericks Podcast hosted by Nick Angstadt and Isaac Harris is the best (and only) daily Dallas Mavs show in existence. Every day Nick and Isaac discuss the latest on Luka Doncic, Kristaps Porzingis, Dirk Nowitzki, the Draft, Free Agency and the rest of the NBA. Past guests include Mark Cuban, Luka Doncic, Harrison Barnes, and more. Part of the Locked On Podcast Network.",
    "Portland Trail Blazers beat writer Mike Richman (@mikegrich) brings you a daily look into your favorite team. Go deep on the Blazers and the NBA with the Locked On Blazers podcast. Part of the Locked On Podcast Network.",
    "Philip Rossman-Reich of Orlando Magic Daily analyzes the Orlando Magic every day on Locked On Magic. Get your daily Magic fix from the highs of chasing the Finals with Shaquille O'Neal and Penny Hardaway to the lows of the Dwight-mare and rebuild. Everything Orlando Magic is covered on Locked On Magic every day on the Locked On Podcast Network.",
    "Charles T Hamilton brings Warriors fans inside their team and the NBA with a daily podcast. Locked on Warriors is part of the Locked on Podcast Network  #warriors #nba  #stephcurry #goldenstate",
    "Official Golden State Warriors shows hosted by Laurence Scott with interviews and analysis direct from the team focusing on topics from around the NBA",
    "NBA, NBA Draft and College Basketball Expert Sam Vecenie talks all levels of hoops.",
    "Insights and observations from across the NBA... a podcast for the intellectually curious NBA fan.",
    "The Armchair All Americans is an online media publication specializing in the localization of collegiate and professional sports.",
    "Rachel Nichols and a rotating cast of ESPN NBA Insiders and analysts keep tabs on everything around the league.",
    "The NBA's biggest stars, coaches, executives and newsmakers regularly join ESPN's Adrian Wojnarowski on The Woj Pod. Interviews, analysis and storytelling from an unmatched lineup of NBA guests anywhere - only on The Woj Pod.",
    "Nate Duncan hosts the most in-depth NBA basketball podcast, featuring detailed game breakdowns, salary cap analysis, and scouting.",
    "Hosted by Ben Golliver and Michael Pina, SI’s Open Floor podcast brings you breakdowns of the biggest news, moves and more from around the NBA.",
    "The Starters is a daily NBA podcast hosted by J.E. Skeets and Tas Melas that breaks down the league's biggest games, story lines, and off-court antics.",
    "ESPN's Zach Lowe talks to various basketball people about various basketball things.",
    "Live from Hollywood, CA by way of the Broken Skull Ranch, Pro Wrestling Hall of Famer, Action Movie/TV star, Steve Austin talks about anything and everything that pops into his brain.  Steve shares tales from his new life, unbelievable past adventures, talks to pro wrestling pals...you name it, Steve's on it.  For more episodes, go to podcastone.com/premium<br><br>\nGot questions? <a href=\"mailto:questions@steveaustinshow.com\">questions@steveaustinshow.com</a>\n",
    "BangTheBook Radio is the industry leader in presenting sports betting information and analysis. Our radio show segments feature some of the most profitable handicappers and sharpest analysts in the wagering markets of college football, NFL, MLB, NHL, NBA, college basketball, and UFC. Host Adam Burke guides the discussion through important sports gambling topics and free picks are always available on these podcasts. Whether you're just looking to build your bankroll, are new to betting on sports, or know what you're doing and want to get better, BangTheBook Radio is the place for you.",
    "Sports? with Katie Nolan is a weekly show about sports and all the things tangentially related to sports. Its friends would describe it as \"curious,\" \"fun,\" and \"a podcast.\" Weekly guests will include sports fans from all sorts of industries: comedy, film, television, science?",
    "First Take is always a heated discussion as Stephen A. Smith, Max Kellerman and guests debate about the day's top stories.",
    "The Skip and Shannon: Undisputed Podcast. Skip Bayless, Shannon Sharpe, and Jenny Taft discuss the biggest stories in the world of sports. It's unscripted and unfiltered. Don't miss the television show Monday-Friday at 9:30am ET on FS1.",
    "Dan Le Batard, Stugotz and company share their unique perspectives from Miami Beach's Clevelander Hotel. ",
    "Tony Kornheiser and Michael Wilbon face off in the nation's capital on the day's hottest topics.",
    "A no-nonsense Pro Football scouting show with detailed player evaluations as well as bold predictions on players and teams. Support this podcast: <a href=\"https://anchor.fm/profootballscoutingpod/support\" rel=\"payment\">https://anchor.fm/profootballscoutingpod/support</a>",
    "Ryen Russillo gives you his unfiltered take on the biggest stories in the sports world.",
    "The Herd with Colin Cowherd is a thought-provoking, opinionated, and topic-driven journey through the top sports stories of the day."
  ]
}