{
    "descs": [
      "New Podcasts every week!  Selling? Buying? Investing? Trying to keep your kids from RUINING the house before showing appointments?  Want to know what Realtors REALLY look for in a house?  Tune in!",
      "Shelly Palmer, Ross Martin and some of the world's most intriguing people will challenge you to think differently about business, money, culture, technology, media, marketing and more. With digital transformation upending companies, industries and careers, you need answers so let Shelly and Ross help you survive the disruption.",
      "Security Today is a podcast centered around physical security and the security industry. From articles to philosophies to trending topics, Uncle Baer leads you down the info hole of Security Today.\n@unclebaer_ on IG and Twitter",
      "The world is looking to innovation and technology as a platform for a better future. Where will the jobs of tomorrow come from? How will our children learn, shop, enjoy the environment, engage politically and give back? \n\nWe’re entering an era where creativity will be integral to survival— a time where constant re-education and reinvention will be the key to remaining relevant. Our children will have to breathe disruption, be open to all possibilities and be the constant entrepreneur. What this future will look like is the purpose of this podcast. Brilliant Minds, a 2-day ideas festival, is the physical manifestation of this podcast. \n\nCreated in 2015 by Ash Pournouri, Founder of At Night Management, and Spotify’s founder Daniel Ek, Symposium Stockholm provides a week-long festival for creative individuals with powerful ideas to come together and experience a creative home, at the intersection of tech, music, fashion and innovation.\n\nCurated at the heart of the Symposium Stockholm week is the flagship event Brilliant Minds. This is an intimate 2-day long event where the guests meet in a marriage of historic foundations and a vast array of creative sectors come together unlike anything the thought leadership community has experienced before. It’s a Coachella for the mind and soul, a voyeuristic peak into the human condition, and the joy and curiosity that’s awakened when humans interact, laugh and gather.\n\nWe aim to break the hottest talent and be a platform for innovators to the world. The beauty of Brilliant Minds is its pristine vision toward the highest levels of thought leadership with no agenda, no commercialism, beyond spreading and generating great ideas, and bringing the best people together. We are an event whose currency lies solely in people and you can hear their powerful voices in the Brilliant Minds Podcast. \n\nThis podcast will be the heart of our event. We will share the ideas and views of our speakers through it, and you can follow us on the road year-round as I meet with our Brilliant Minds community and build our platform of global creators, interviewing them, partnering with them on smaller events, collaborating and co-creating a better future together. \n\nPlease join me, Natalia Brzezinski the CEO of Symposium, and be a part of this community. ",
      "The intersection of Data Analysis and Passion.    Casual Conversations with the Tableau #DataFam and beyond give a human voice to the Data Story.",
      "CNET's Sophia Fox-Sowell discusses top technology news stories in a short and digestible format.",
      "Learn the latest news, trends, and insights into what’s happening in healthcare IT with the Healthcare IT Today podcast hosts, John Lynn and Colin Hung.",
      "THE LifeStyled COMPANY Podcast",
      "The Data Center Podcast is produced by Data Center Knowledge, the leading information source for all things data center. In our podcast we interview technology and business leaders in the data center industry to get to know them better and to ask for their take on where things are going in the constantly changing world of cloud, internet, and enterprise infrastructure, which are increasingly becoming one thing.",
      "‘Learning Is the New Working’ is a new podcast from Chris Pirie, ex-Microsoft Chief Learning Officer and now independent investigator of The Future of Workplace Learning. A set of stimulating conversations with some of the leading thinkers and edge practitioners in the modern Workplace Learning space, from Chief Learning Officers  to Learning Experience Designers, from Neuroscientists  to Technologists, vendors of Learning Tech, and the HR leaders charged with developing human capital potential.  Our topics are everything from the American skills crisis to our scary, but fascinating, century: how the rise of the robots, AI, employment and demographic change are re-shaping all our lives - in work and out of it. We will also explore how the process of Learning is itself changing with current and emerging technology, share war stories about which new ways of delivering Learning work, what Sales Enablement is versus what it could be, what a ‘Learning Science’ might offer… all with the ultimate aim of empowering the CLO.",
      "You probably know their apps, but probably don’t know how they came to be. Join us every episode for a casual conversation with some of the best indie developers out. ",
      "A podcast full of funny stories and rapid-fire questions. You'll get entertaining insight into Front-end, Back-end, and Full-stack Developers along with UI/UX Designers at different stages of their career journey in each of our quick episodes. Get your questions answered by security experts, long-time designers, self-taught developers, and all types of techies. You'll get a glimpse into the industry beyond just the technical skills. Join us as we listen to our guests twice per week, as they answer some rapid-fire questions and share some incredible stories.",
      "In this new series from T-Mobile for Business and iHeartRadio, Oz and Karah look closely at how 5G innovations will revolutionize the way we work, socialize and interact with the world. They'll explore how the 5G revolution has the potential to change everything from airline travel to manufacturing to sports to disaster relief, and what the next generation of wireless really means for the businesses that serve us.",
      "Podcast by Hackaday",
      "Hosted by @axbom & @beantin, UX Podcast is for those who are passionate about balancing business, technology and people within the realm of digital media. Recorded twice monthly in Stockholm, Sweden.",
      "This is your Product Management podcast featuring PMs from Google, Facebook, LinkedIn, Spotify, Twitter and other tech companies/ startups. Tune in if you’re a manager, designer, engineer, entrepreneur or marketer who wants to learn the latest best practices and break into Product.",
      "From development and design to marketing and support, Under the Radar is all about independent app development. It's never longer than 30 minutes.  Hosted by Marco Arment and David Smith.",
      "Conversations with world experts on changing technologies and future of the web. The Web Ahead is your shortcut to keeping up. Hosted by Jen Simmons.",
      "This is a podcast about engineering disasters and systemic failures, from a leftist perspective, with jokes",
      "Michael O'Neal and his co-hosts bridge the gap between the clueless big box stores and the snobby stereo shops. Every show is filled with gear reviews, commentary, and interviews aimed to find out what makes a real world difference in your listening experience, how to get the most bang for your buck, and frankly, how to begin experiencing your music in the way it was intended.",
      "\n      TechBuzz China by Pandaily is a biweekly technology podcast that is all about China's innovations. It is co-hosted by Ying-Ying Lu and Rui Ma, who are both seasoned China-watchers with years of experience working in the technology space in China. They share and discuss the most important tech news from China every week, and include commentary from investors, industry experts, and entrepreneurs.\n    ",
      "\n      <p>We’ve entered a new era. The creation and collection of information play an ever-increasing — yet often hidden — role in our lives. Algorithms filter all sorts of experiences, from the mundane to the monumental. The fuel that powers and curates these experiences is…data. Data are the new oil; whoever controls data has power. Is this making things better? Worse? Raw Data is a show about <strong>how information becomes power</strong>. What are the implications for all of us, now that mountains of data are more accessible and malleable than ever?</p>\n\n<p>Episodes post on Thursdays. From Stanford and PRX.</p>\n\n<p>Hosted by Andrea Mustain and Mike Osborne.</p>\n\n<p>We love hearing from you! Please email us at <a href=\"mailto:hello@rawdatapodcast.com\" rel=\"nofollow\" target=\"_blank\">hello@rawdatapodcast.com</a></p>\n    ",
      "Our Ludicrous Future is a collaboration between Joe Scott, Tim Dodd, and Ben Sullins. We have an obsession with how wild our future is going to be given the pace of technological innovation. Each week we get together to talk about the latest from SpaceX, Tesla, The Boring Company, Neuralink, and more.",
      "You are here because you are a thought and brand leader creating the future.\n\nExploring the outer and inner worlds of exponential innovation, growth and “what’s next”.\n\nThe future of technology, the psychology and spirituality of success, explosions in exponential thought and technologies, innovation and leadership and other topics.\n\nMore information at: \n\nhttps://www.linkedin.com/in/alex-hammer-888a022/\n\nand\n\nhttps://alexhammerbooks.com/",
      "I'm Josh Long (http://twitter.com/Starbuxman), a humble Spring advocate at @Pivotal and this is a (http://twitter.com/BootifulPodcast) a Bootiful Podcast, a celebration of the real heroes that drive ecosystems.",
      "Vic Hudson talks to other independent developers about bringing their apps from concept to product, and everything in between.",
      "Your new favorite podcast from two dudes who love Bitcoins & have nice beards. Back in 2018, BitBoy and JChains met up at a conference in Chicago. Both were in the Crypto space for a while and jokingly decided to start a podcast. 2 weeks later they were recording their first episode, and it took off from there. They're just two dudes, with nice beards, and love for Bitcoin… and the crypto community.",
      "Discussing the world of iOS Development and the latest news in Swift. Support this podcast: <a href=\"https://anchor.fm/seanallen/support\" rel=\"payment\">https://anchor.fm/seanallen/support</a>",
      "Discussing the issues that face podcast producers and podcasting. Each Roundtable features a new podcaster from the community of viewers listeners. We talk less about the 'how-to' and more about the 'why.' You'll learn how to improve your podcast through the shared experience of other podcasters.",
      "Weekly deep dives on data management with the engineers and entrepreneurs who are shaping the industry",
      "Base Layer will be providing insights from founders and investors in the base layer of cryptoassets. Simplifying complex projects and the technology being developed, from interoperability to relayers and more - who is building the future, why are they and how are they doing it.",
      "The Past | The Present | Hence, the Future Support this podcast: <a href=\"https://anchor.fm/hencethefuture/support\" rel=\"payment\">https://anchor.fm/hencethefuture/support</a>",
      "We publish research on frontier technology, the themes driving it, and the companies making it a reality. This podcast includes audio versions of select research notes.",
      "Are you a researcher or data scientist / analyst / ninja? Do you want to learn Bayesian inference, stay up to date or simply want to understand what Bayesian inference is?\n\nThen this podcast is for you! You'll hear from practitioners of all fields about how they use Bayesian statistics, and how in turn YOU can apply these methods in your modeling workflow.\n\nWelcome to « Learning Bayesian Statistics », a fortnightly podcast on… Bayesian inference - the methods, the projects and the people who make it possible!",
      "New perspectives from the bleeding edge of product management with Ryan Singer and Chris Spiek.",
      "Consequential is a podcast that looks at the human side of technological change and develops meaningful plans of action for policymakers, technologists and everyday people to build the kind of future that reduces inequality, improves quality of life and considers humanity. Over the course of the first season, we will unpack important topics like industry disruption, algorithmic bias, human-AI collaboration, re-skilling and the future of work, as well as discuss policy interventions for using emerging technologies for social good.\n\nConsequential is hosted at Carnegie Mellon University's Block Center for Technology and Society. For information on upcoming episodes, visit: https://www.cmu.edu/block-center/podcast-consequential/index.html",
      "The Stack Overflow podcast is a weekly conversation about working in software development, learning to code, and the art and culture of computer programming. Hosted by Sara Chipps, Paul Ford, and Ben Popper, the series will feature questions from our community, interviews with fascinating guests, and hot takes on what’s happening in tech.\nAbout Stack Overflow\nFounded in 2008, Stack Overflow is the largest, most trusted online community for developers to learn, share their knowledge, and build their careers. More than 50 million professional and aspiring programmers visit Stack Overflow each month to help solve coding problems, develop new skills, and find job opportunities.",
      "Intel® Chip Chat is a recurring podcast series of informal, one-on-one interviews with some of the brightest minds in the industry. Hosted by Intel employee Allyson Klein since 2007, Intel Chip Chat strives to bring listeners closer to the innovations and inspirations of the men and women shaping the future of computing, and in the process share a little bit about the technologists themselves.",
      "\n      <p>Every story is a tech story. We live in a world where algorithms drive our interests, scientists are re-engineering our food supply, and a robot may be your next boss. Host Arielle Duhaime-Ross explores why–and how–tech is changing everything. Produced by Recode and Stitcher, and part of the Vox Media Podcast Network.</p>\n    ",
      "A weekly Apple and tech lifestyle discussion hosted by DailyTekk founder Chris The Content Creator. Let Chris bring you some perspective on the latest tech news, catch up on what's new at DailyTekk and come away with a little motivation for the week while you're at it! What is this really? It's just some friends having fun talking tech. Subscribe to join the conversation or catch the video version of DailyTekk AfterParty on YouTube! ",
      "SecureMac presents The Checklist. Each week, Ken Ray and August Trometer hit security topics for your Mac and iOS devices. From how-to's and safety tips, to security news of the day, The Checklist by SecureMac takes a conversational, solutions oriented approach to security for the average user. Check in each Thursday for a new Checklist!",
      "Desmond Bowe and Chris Bell present a titillating discussion about Elixir application design and the state of the ecosystem.  Ask us a question at https://github.com/elixirtalk/elixirtalk and follow us on Twitter @elixirtalk",
      "Happy Hour is a podcast hosted by Benjamin Mayo, Zac Hall and the staff of 9to5Mac discussing the latest in tech news.",
      "A Podcast About Cloud Native Software Development, AWS, and Distributed Systems",
      "Hosted by the Panasonic TOUGHBOOK team, RUGGED RANTS dives into the future of tech innovation and what we can expect as work changes across industries. We’re rugged, ranting and ready to tackle anything!",
      "The All Things Java Podcast",
      "Aviation Week & Space Technology editors take a look at some of the bigger-picture issues in the world of aerospace and defense",
      "Each Sunday, Brad Shoemaker and Will Smith discuss a new technology topic. Come for the long-form conversations about virtual reality, space travel, electric cars, refresh rates, and a whole lot more. ",
      "On DevOps on AWS Radio, we cover topics on applying DevOps principles and practices such as Continuous Delivery on the Amazon Web Services cloud. This is what we do at Stelligent for our customers. We’ll bring listeners into our roundtables and speak with engineers who’ve recently published on our blog and we’ll also be reaching out to the wider DevOps on AWS community to get their thoughts and insights.",
      "Learn about all aspects of electric vehicle technology and the EV industry from the founder of the award-winning cleantech company AVID Technology and our expert special guests!<br /><br />U.K. based AVID is a rapidly growing company in the electric and hybrid vehicle field, working with some of the most innovative and successful vehicle manufacturers from around the world. We will be uploading a variety of podcast types all with the aim to allow you to understand more about the technology that is allowing the electric vehicle boom to be possible.<br /><br />Make sure to subscribe so you never miss out on an episode, and don't forget to visit our website to see more information on the technologies being discussed and to read our white papers and blogs. Site: <a href=\"https://avidtp.com/\">https://avidtp.com/</a>",
      "Listen and learn about different reverse engineering hardware projects and methods as Alvaro (@alvaroprieto) and Jen(@rebelbotjen) talk with guests about their work.",
      "Stephen Wolfram is the creator of Mathematica, Wolfram|Alpha and the Wolfram Language; the author of A New Kind of Science; and the founder and CEO of Wolfram Research. Over the course of nearly four decades, he has been a pioneer in the development and application of computational thinking—and has been responsible for many discoveries, inventions and innovations in science, technology and business.\n\nOn his podcast, Stephen discusses topics ranging from the history of science to the future of civilization and ethics of AI.",
      "The front page of the Internet--also known as Reddit--is making noise. Hosts Ben Brock Johnson and Amory Sivertson dig into the site's vast and curious ecosystem of online communities, collaborating with Reddit's 330 million users and over 140 thousand communities to find all kinds of jaw-dropping narratives. A collaboration between WBUR and Reddit.",
      "What happens when software eats the world? Industry veterans Paul Ford and Rich Ziade chat with their friends about technology, design, and business from a distinctly East Coast point of view. Decades of experience inform their no-BS, quick-witted patter about what digital transformation really means. Created by Postlight, the digital product studio they co-founded in New York City",
      "This is the GIS show.  I talk with people who really understand GIS and how it is used in the world.  These are the people who make the magic happen.\n\nWith Geographic Information Systems we are:\n     Modeling the world.\n     Creating maps.\n     Analyzing patterns.\n     Enabling new kinds of decision-making.\n\nMaps are cool but there is so much more to talk about!\n\nMusic by Lee Rosevere.  Bridgeport from Canada Line (A Musical Suite in Real Time)",
      "A show about the Rust programming language and the people who use it.",
      "This podcast will teach beginner & intermediate Microsoft Excel users the different Excel tools like: Formulas, Pivot Tables, Charting, Analysis, Macros, VBA, Dashboards, Power BI, Add-Ins, Shortcuts plus much more.\nI interview Excel MVPs and experts around the world to share their Excel insights, knowledge, tips and tricks that will get you on the way to becoming an advanced Excel user, just like them.",
      "A podcast about data science and analytics culture.",
      "Swift over Coffee is a podcast that helps you keep your Swift skills up to date the easy way, hosted by Paul Hudson and Sean Allen. Each episode has news, our picks of the week, plus an open ballot where you can share your views on important topics.\n\nFollow us on Twitter at @swiftovercoffee.\n\nNote: all the discussion from Sean and Paul is licensed under CC BY-SA 3.0. Our regular intro/outro music is also licensed under CC BY-SA 3.0, and is called \"Dropping out of School\" by Brad Sucks.",
      "<p>A tech podcast for the gadget lovers and tech heads among us from the mind of Marques Brownlee, better known as MKBHD. MKBHD has made a name for himself on YouTube reviewing everything from the newest smartphones to cameras to electric cars. Pulling from over 10 years of experience covering the tech industry, MKBHD will keep you informed and entertained as he takes a deep dive into the latest and greatest in tech and what deserves your hard earned cash. New episodes every other week.</p>Take our survey: https://bit.ly/2EcYbu4",
      "<p>What’s NEXT is a new podcast from Samsung NEXT that explores the technologies of the future and what they mean for us today.</p><p>In each episode, we'll talk to startup founders and experts in the worlds of AR, IoT, machine learning, and more.</p><p>Episodes are released every other week. To learn more, visit samsungnext.com/podcast... and be sure to subscribe so you never miss an episode.<br></p>",
      "\n       The Virtually Speaking Podcast is a weekly technical podcast dedicated to discussing VMware topics related to storage and availability. Each week Pete Flecha and John Nicholson bring in various subject matter experts from VMware and within the industry to discuss their respective areas of expertise. \n    ",
      "A podcast made by people who love running Linux.",
      "Every week TWiT hosts talk to the smartest people in the world about the most important topics in technology. Join Leo Laporte, Jason Howell, Mikah Sargent, Denise Howell, or Ant Pruitt for these enlightening one-on-one interviews.\n\nRecords live every Friday at 2:30pm Eastern / 11:30am Pacific / 19:30 UTC.",
      "<p>Ask questions. Research. Test. Analyze. Iterate. Make lives better. Engineering begins &amp; ends with people. Settle in with Michigan Engineering monthly for stories about breakthrough research &amp; the people making it happen.&nbsp;</p><p>RE: Engineering Radio is a podcast reinventing how we talk about research. Produced by the University of Michigan College of Engineering,</p>",
      "\n      All JavaScript podcasts produced by Devchat.tv:\n  - JavaScript Jabber\n  - My JS Story\n  - JS Rants\n    ",
      "\n                Get in-depth coverage of security news and trends at WIRED.  A SpokenEdition transforms written content into human-read audio you can listen to anywhere. It's perfect for times when you can’t read - while driving, at the gym, doing chores, etc. Find more at www.spokenedition.com\n            ",
      "The podcast that covers the latest news, notes, commentary and listener questions on Microsoft cloud technologies including Windows Azure, Office 365 and SharePoint.",
      "Frederick Munawa here. I’m a Blockchain Consultant for entrepreneurs and financial services firms. \n\nBlockchain Innovation is where I interview the brightest minds in Blockchain and cryptocurrency – entrepreneurs, executives, and top academics – to discuss present and future applications of Blockchain Technology.\n\nWhy? To determine how Blockchain can be used to increase profits, cut costs, and disrupt traditional industries and business models – so you can borrow their strategies, tools, and tactics for your own success. \n\nJoin me every Tuesday to learn how the brightest minds in Blockchain are pushing the envelope with Initial Coin Offerings (ICOs) & crowdsales, public blockchains, private blockchains, Bitcoin, Ethereum, Hyperledger, smart contracts, and much more.",
      "A weekly podcast brought to you by The Information, a subscription tech news site doing deep dives and investigative looks at the tech and media industries. Each episode highlights some of the major happenings in tech business world, featuring the reporters at The Information. It's interviews, analysis, and wrap-ups to help give you insights into what the biggest companies in the industry are thinking.",
      "The Packet Pushers Podcast Network offers continuous professional development for IT professionals. Keep up with networking, security, cloud, career, and more. We bring the IT community together--engineers, architects, vendors, developers, educators, etc. In this feed, listen to every conversation we record!",
      "The eLearning Guys is a discussion show about Articulate Storyline development and all things e-learning by two guys passionate about education, multimedia, creativity and problem solving.\nNejc and David have been working in the eLearning industry for over a decade and they share their experiences with Articulate Storyline and their eLearning adventures with you.\nTo learn Articulate Storyline on your time and at your pace, visit https://www.masterstoryline.com.\n",
      "Technology in many shapes, forms, and devices is already shaping nearly every aspect of your life. How? On your smart phone and tablet with thousands of apps to enhance your work and daily living. On streaming media that lets you watch TV and movies anytime anywhere. On social media where your voice is instantly amplified to reach the world. Think you’ve seen it all? Not! There’s more to come and you’re part of making it happen – right now. Join host Bonnie D. Graham as she speaks with future-focused visionaries on Technology Revolution: The Future of Now, broadcasting live every Wednesday at 8 AM Pacific Time/11 AM Eastern Time, on the Business Channel.",
      "Introducing our new podcast, 16 Minutes, a short news podcast where we cover the top headlines of the week, the a16z podcast way -- why are these topics in the news; what's real, what's hype from our vantage point; and what are our experts' quick takes on these trends?\n\nAbout the a16z Podcast: Discusses tech and culture trends, news, and the future -- especially as ‘software eats the world’. It features industry experts, business leaders, and other interesting thinkers and voices from around the world. This podcast is produced by Andreessen Horowitz (aka “a16z”), a Silicon Valley-based venture capital firm. Multiple episodes -- and now shows -- are released every week; visit a16z.com for more details and to sign up for our newsletters and other content as well!",
      "“Finding Your Frequency” is about more than just content and code. It is more than just philosophy and polishing your image. It’s about both failure and success, the difference between the two and all of the steps in between! Jeff and Ryan discuss the digital media space and all of its aspects. It’s about making the mistakes, taking the chances summoning the intestinal fortitude to step out of your comfort zone and discovering what you can accomplish when you decide to try, decide to learn, decide that you have something to say and Find Your Frequency! It’s live every Friday at 12 Noon Pacific Time and 3 PM Eastern Time on the VoiceAmerica Variety Channel.",
      "We discuss technology the automotive industry and life. Support this podcast: <a href=\"https://anchor.fm/savagegeese/support\" rel=\"payment\">https://anchor.fm/savagegeese/support</a>",
      "5by5 special events. Hosted by Dan Benjamin.",
      "What are the most important technology stories right now? From products and companies to services and trends, Download’s weekly panel of experts analyzes the biggest topics in tech … and a few you may have missed. Hosted by Stephen Hackett and Jason Snell.",
      "Get the most from your Mac! The show features news, tips, tricks, techniques, tutorials and reviews geared toward the casual, home and business Apple user. Covers the Mac, iPad, iPhone and other Apple products.",
      "Facebook. Apple. Amazon. Netflix. Google. These five tech giants have changed the world. But how? And at what cost? Recode’s Jason Del Rey starts with The Rise of Amazon. Over two decades, an online marketplace for books became the world’s most valuable company. We examine how it got its power, what it’s doing with it, and what might happen to it in the future. Produced by the Vox Media Podcast Network.",
      "A community celebration of JavaScript and the web.  This show records LIVE on Thursdays at 1pm US/Eastern time. Panelists include Suz Hinton, Feross Aboukhadijeh, Kevin Ball, Emma Wedekind, Jerod Santo, Nick Nisi, Divya Sasidharan, Mikeal Rogers, and Chris Hiller.\n\nTopics discussed include the web platform (Chrome, Safari, Edge, Firefox, Brave, etc), front-end frameworks (React, Ember, Angular, Vue, etc), Node.js, web animation, SVG, robotics, IoT, and much more. If JavaScript and/or the web touch your life, this show’s for you.\n\nSome people search for JSParty and can't find the show, so now the string JSParty is in our description too.",
      "Conversations with the hackers, leaders, and innovators of software development.  Hosts Adam Stacoviak and Jerod Santo face their imposter syndrome so you don’t have to. Expect in-depth interviews with the best and brightest in software engineering, open source, and leadership. This is a polyglot podcast. All programming languages, platforms, and communities are welcome. Open source moves fast. Keep up.",
      "Liftoff is a fortnightly podcast about space, the universe, and everything. You don’t need to be a rocket scientist to understand the latest developments as explained by enthusiastic space fans Stephen Hackett and Jason Snell. Hosted by Jason Snell and Stephen Hackett.",
      "All About Android delivers everything you want to know about Android each week--the biggest news, freshest hardware, best apps and geekiest how-tos--with Android enthusiasts Jason Howell, Florence Ion, Ron Richards, and a variety of special guests along the way.\n\nRecords live every Tuesday at 8:00pm Eastern / 5:00pm Pacific / 01:00 (Wed) UTC.",
      "Connected is a weekly panel discussion on Apple and the impact of technology on our lives. With each co-host having a unique background — and accent — Connected provides a perspective that no other show can. Hosted by Federico Viticci, Myke Hurley, and Stephen Hackett.",
      "\n      On the Inside Intercom podcast you will hear the team from Intercom interview makers and do-ers from the worlds of product management, design, startups and marketing.\n    ",
      "Material is a weekly discussion about the Google and Android universe. Your intrepid hosts try to answer the question, “What holds up the digital world?” The answer, so far, is that it’s Google all the way down. Hosted by Andy Ihnatko and Florence Ion.",
      "<p>I'm Courtland Allen, and on IndieHackers.com I've interviewed hundreds of people about how they've turned their ideas and side projects into profitable online businesses. Explore the stories, challenges, and tactics behind the indie hackers who are escaping the 9-to-5 grind and building their own revenue-generating machines.<br></p>",
      "Technical interviews about software topics.",
      "The official podcast of the freeCodeCamp open source community.\n\nLearn to code with free online courses, programming projects, and interview preparation for developer jobs.",
      "A podcast for developers interested in building great software products. Every episode, Adam Wathan is joined by a guest to talk about everything from product design and user experience to unit testing and system administration.",
      "Your weekly source for the best stories and insights from the world of Windows, Windows Mobile, Surface, HoloLens, and Xbox. Hosted by Daniel Rubino and Zac Bowden.",
      "Upgrade looks at how technology shapes our lives, from the devices in our hands and pockets to the streaming music and video services that keep us entertained. Hosted by Myke Hurley and Jason Snell.",
      "Conversations about React with your favorite developers.",
      "Every week our TWC9 Hosts go through hundreds of blogs, videos, and announcements to find the most important news in the developer community. Topics include Microsoft .NET development, Visual Studio tips and add-ons, developing for Windows and the Web, and gratuitous gadgets. ",
      "The data of the world around us, hosted by data science super geeks. For the nerdy and nerd curious.",
      "Podcast will consist of morning show \"best of\" highlights, interviews with local and national guests listeners can only hear on the podcast and various topics discussed in a more in depth fashion that wouldn't normally fit with the \"music driven' on air format.",
      "R is a free and open-source statistical computing environment.  It has quickly become the leading choice of software used to develop cutting-edge statistical algorithms, innovative visualizations, and data processing, among other key features.   R has seen tremendous growth in popularity and functionality over the last decade, largely due to the vibrant and devoted R community of users.   Whether you have experience with commercial statistical software such as SAS or SPSS and want to learn R, or getting into statistical computing for the first time, the R-Podcast will provide you with valuable information and advice that will help you to tap into the power of R.  Our intent is to start with the basic concepts that can be a struggle for those new to R and statistical computing.  We will give practical advice on how to take advantage of R’s capabilities to accomplish innovative and robust data analyses.  Along the way we will highlight the additional tools and packages that greatly enhance the experience of using R, and highlight resources that can help people become experts with R.  While this podcast is not meant to be a series of lectures on statistics,  we will use freely and publicly available data sets to illustrate both basic statistical analyses as well as state-of-the-art algorithms to show how powerful and robust R can be for analyzing today’s explosion of data. In addition to the audio podcast, we will also produce screencasts for hands-on demonstrations for those topics that are best explained via video. \n",
      "The official podcast of Data Science Salon. We interview top and rising luminaries in data science, machine learning, and AI on the trends and business use cases that are propelling the field forward. The Data Science Salon series is a unique vertical focused conference which brings together specialists face-to-face to educate each other, illuminate best practices, and innovate new solutions in a casual atmosphere with food, great coffee, and entertainment.",
      "Technology, machine learning and algorithms. Come join the discussion!  https://discord.gg/4UNKGf3",
      "Bite-Sized Big Tech",
      "The Data Skeptic Podcast features interviews and discussion of topics related to data science, statistics, machine learning, artificial intelligence and the like, all from the perspective of applying critical thinking and the scientific method to evaluate the veracity of claims and efficacy of approaches.",
      "Smart machines based upon the principles of artificial intelligence and machine learning are now prevalent in our everyday life.  For example, artificially intelligent systems recognize our voices, sort our pictures, make purchasing suggestions, and can automatically fly planes and drive cars. In this podcast series, we examine such questions such as: How do these devices work? Where do they come from? And how can we make them even smarter and more human-like? These are the questions that will be addressed in this podcast series!",
      "Every two weeks, we air an interview with a data scientist or someone on their way to becoming a data scientist, to learn about their path to get to where they are today. We also discuss a data science learning activity for the Becoming a Data Scientist Learning Club.\n\nTopic tags: data science, data analysis, databases, careers, education, learning, technology, python, R, computer programming, statistics, business, machine learning",
      "Leading women in data science share their work, advice, and lessons learned along the way with Professor Margot Gerritsen from Stanford University. Hear about how data science is being applied and having impact across a wide range of domains, from healthcare to finance to cosmology to human rights and more.\n\nThis podcast is brought to you by the Stanford Institute for Computational & Mathematical Engineering (ICME) and the Stanford School of Engineering. Generous support for this podcast and other Women in Data Science initiatives has been provided by Intuit, Microsoft, SAP, Walmart Labs, and Western Digital.",
      "Hosted by Al Martin, IBM VP of Data and A.I. Development, Making Data Simple provides the latest thinking on big data, A.I., and the implications for the enterprise from a range of experts.",
      "Witty, irreverent look at the world through scientists' eyes. With Brian Cox and Robin Ince.",
      "<p>Flash Forward is a show about possible (and not so possible) future scenarios. What would the warranty on a sex robot look like? How would diplomacy work if we couldn’t lie? Could there ever be a fecal transplant black market? (Complicated, it wouldn’t, and yes, respectively, in case you’re curious.) Hosted and produced by award winning science journalist Rose Eveleth, each episode combines audio drama and journalism to go deep on potential tomorrows, and uncovers what those futures might really be like. The future is going to be weird, so let's get ready for it together.</p>",
      "Shankar Vedantam uses science and storytelling to reveal the unconscious patterns that drive human behavior, shape our choices and direct our relationships.",
      "<p>This podcast might not actually kill you, but it covers so many things that can. Each episode tackles a different disease, from its history, to its biology, and finally, how scared you need to be. Ecologists and epidemiologists Erin Welsh and Erin Allmann Updyke make infectious diseases acceptable fodder for dinner party conversation and provide the perfect cocktail recipe to match</p>",
      "The DevSecOps Days is a recorded series of discussions with thought leaders and practitioners who are working on integrating automated security into every phase of the software development pipeline.",
      "The Cybercrime Magazine Podcast is your destination for cybersecurity facts, figures, predictions and statistics. Listen to interviews with top industry experts, Fortune 500 CISOs, and cybersecurity CEOs – plus rundowns of the latest news involving hacks and breaches, coverage of topics such as women in cyber, programs at high schools and colleges, and more. Subscribe on Apple Podcasts, SoundCloud, or Google Podcasts to get new episodes as they become available.",
      "Discussions, tips, and debates around improving the communications and services that security vendors provide to their customers, the security buyer.",
      "Each week the CyberWire’s Hacking Humans Podcast looks behind the social engineering scams, phishing schemes, and criminal exploits that are making headlines and taking a heavy toll on organizations around the world. We talk to social engineering experts, security pros, cognitive scientists, and those practiced in the arts of deception (perhaps even a magician or two). We also hear from people targeted by social engineering attacks and learn from their experiences.",
      "Cyber Speaks LIVE is a weekly InfoSec podcast series hosted by Duncan McAlynn (@infosecwar) and his special guest co-hosts, where YOU get to participate in the discussions with full video and audio. Following the live recording, we add the audio-only stream into our podcast feed for our awesome subscribers. \n\nCyber Speaks LIVE gives YOU, the InfoSec community, a voice that can be heard around the world! \n\nFollow us on Twitter for upcoming guests announcements and live recording invites, @cyberspeakslive. ",
      "AI with AI explores the latest breakthroughs in artificial intelligence and autonomy, and discusses the technological and military implications. Join Andy Ilachinski and David Broyles as they explain the latest developments in this rapidly evolving field.\n\nThe views expressed here are those of the commentators and do not necessarily reflect the views of CNA or any of its sponsors.",
      "<p>In a major new series Danny Fortson paints a picture of Silicon Valley - how it became the most important driver of tech and society on the planet, and where the people who run it are planning on going next.</p><p><br></p><p>Danny has been the West Coast correspondent for The Sunday Times since the beginning of 2017, covering all things technology and Silicon Valley. He also hosts the weekly Danny in the Valley podcast. Before moving to California, where he was born and raised, he spent more than a decade in London, where he grew up.</p><p><br></p><p>You can read more of Danny's reporting from Silicon Valley by subscribing to The Times and Sunday Times at https://www.thetimes.co.uk/subscribe/</p><p><br></p>",
      "Podcasts from Equine Veterinary Journal (EVJ)",
      "Your Microsoft Cloud News from a couple of IT Pros",
      "Altcoin Sidekick. https://www.altcoinsidekick.com/",
      "A fortnightly, limited interview series exploring the world of Apple Watch and how it’s changing people’s lives.",
      "Technology companies are locked in an arms race to seize your attention, and that race is tearing apart our shared social fabric. In this inaugural podcast from the Center for Humane Technology, hosts Tristan Harris and Aza Raskin will expose the hidden designs that have the power to hijack our attention, manipulate our choices and destabilize our real world communities. They’ll explore what it means to become sophisticated about human nature, by interviewing hypnotists, magicians, experts on the dynamics of cults and election hacking and the powers of persuasion. How can we escape this unrelenting race to the bottom of the brain stem? Start by subscribing to our new series, Your Undivided Attention. ",
      "How the first moon landing was saved. The full story of the people who made Apollo 11 happen and prevented it from going badly wrong. Hosted by Kevin Fong. Theme by Hans Zimmer.",
      "A weekly Apple news and rumors podcast from a developer's perspective. Hosted by 9to5Mac's Gui Rambo and John Sundell.",
      "Exposing Lies † Sharing Truth\n\nFrom the political to the paranormal and economics to the esoteric, we cover it.\n\nAnti-Transhuman, Conscious Media & Alternative News, Occult Information, Truth Seeking Artist - Find Us On YouTube & Subscribe\n\n\n\nWebsite: http://factionsoffreedom.jimdo.com/\nEmail: FreedomsFaction@Gmail.com\nInstagram: @Freedom_Faction, @Freedoms_Faction\nFaceBook: https://www.facebook.com/factionsoffreedom/\nTwitter: @FreedomsFaction, @NoizceEra\nDonate: https://www.paypal.me/noizceera\nParadox Radio:  https://factionsoffreedom.jimdo.com/paradox-radio/, https://www.facebook.com/FreedomsParadoxRadio/\nThe Battalion’s Bazaar: https://factionsoffreedom.jimdo.com/the-battalion-s-bazaar/\nOperation Dunamis: https://www.gofundme.com/operation-dunamis\nExclusive Membership: https://www.patreon.com/FreedomFaction",
      "Lew Later is a show discussing technology, the internet and the future.",
      "Home: On is a show focused on home control and home automation topics for the enthusiast and do-it-yourself communities. We run through industry news, take a closer look at interesting products, share project ideas, and present topics for information and education. Host Richard Gunther is joined by a rotation of co-hosts and guests from the space, including industry experts, consumers, and company representatives.",
      "A weekly look at all things Microsoft, including Windows, Office, Xbox, and more, from two of the foremost Windows watchers in the world, Paul Thurrott of Thurrott.com and Mary Jo Foley of All About Microsoft.\n\nRecords live every Wednesday at 2:00pm Eastern / 11:00am Pacific / 19:00 UTC.",
      "Get the latest Apple news and views from the top names in Mac, iPhone, iPod, and iPad journalism.\n\nRecords live every Tuesday at 2:00pm Eastern / 11:00am Pacific / 19:00 UTC.",
      "How are the things we're talking about being talked about somewhere else in the world? Gregory Warner tells stories that follow familiar conversations into unfamiliar territory. At a time when the world seems small but it's as hard as ever to escape our echo chambers, Rough Translation takes you places.",
      "We are a podcast that talks about coding and anything else we can think of. Our topics cover a wide range of topics in this industry, a quick overview would be things like Imposter Syndrome, Social Media, Coders, Frameworks and etc.",
      "Follow along as Mark Zuckerberg hosts a series of conversations on the future of technology and society. He and his guests take on the biggest questions about tech's place in the world — along with the opportunities, challenges, hopes, and anxieties that come with it.",
      "<p>With secret labs and expert guests, Sleepwalkers explores the thrill of the AI revolution hands-on, to see how we can stay in control of our future.</p>",
      "The Biotech Venture Capital Podcast",
      "Genetic Engineering & Biotechnology News (GEN) has retained its position as the premier biotech publication since its launch in 1981. GEN publishes a print edition monthly and has additional exclusive editorial content online, including news and analysis as well as webinars, videos, and polls. GEN's unique news and technology focus covers the entire bioproduct life cycle, including drug discovery, early-stage R&D, applied research (e.g., omics, biomarkers, and diagnostics), bioprocessing, and commercialization.\nGEN's print magazine, which also can easily be accessed online, includes feature articles on emerging technologies, product roundups, in-depth overviews from key scientific and bioindustry meetings, and industry-standard tutorials and technical articles on drug discovery, bioprocessing, and assay technologies.",
      "The Cell Culture Dish Podcast – Providing the latest for the cell culture industry!",
      "\n            \n        Science, culture and everything in between. Feel the heat. All species welcome.\n            \n        ",
      "The Bio Report podcast, hosted by award-winning journalist Daniel Levine, focuses on the intersection of biotechnology with business, science, and policy.",
      "Podcast by STAT",
      "<p>There are a lot of fads, blogs and strong opinions, but then there’s SCIENCE. Science Vs is the show from Gimlet Media that finds out what’s fact, what’s not, and what’s somewhere in between. We do the hard work of sifting through all the science so you don't have to. This season we tackle  football concussions, heartbreak, 5G networks, sleep, free healthcare, police use of force, asteroids and more.</p>",
      "\"The Long Run\"\n\nAntarctic explorer Ernest Shackleton, if he were alive, would appreciate biotech. Today’s scientific entrepreneurs must be ready for the “hazardous journey, bitter cold, long months of complete darkness, constant danger, safe return doubtful, honor and recognition in case of success.” Today, the men and women who strive to apply science for the betterment of human health have a historic opportunity. They need stamina, and resilience, to achieve something meaningful. Biotech’s relationship with the society that sustains it has never been more tenuous. \n\nJoin host Luke Timmerman for in-depth, thought-provoking conversations with biotech newsmakers pursuing these great opportunities of the 21st century.",
      "Welcome to The Future Labs, a podcast series featuring today's leaders on tomorrow's future. We speak to experts around the globe about their role in changing the world for the better. Join us every other week for a fresh new episode.",
      "\n      <p>TV Tech Guy Rich DeMuro offers tech news, gadget reviews, helpful apps and answers your questions. From KTLA-TV Los Angeles.</p>\n    ",
      "A podcast about building things on the web",
      "There's lots of media of the late Steve Jobs, primarily from his famous introductions of Apple products over the years, and his oft-quoted Stanford commencement address. But, by far, the largest trove of interviews of the legendary innovator candidly answering unrehearsed questions and explaining his views on technology and business comes from his six lengthy appearances at our D: All Things Digital Conference, from 2003 to 2010. As a memorial to a great man, and, in the spirit of sharing a priceless piece of history, we are making all six of these appearances available free, in high quality. We thank Apple for its cooperation in making this podcast available for all. Photo credit: Asa Mathat",
      "<p>What is technology doing to you?\n\nCivilian podcast producer Alia Tavakolian has always felt like a dumb tech consumer.\nVeteran tech-journalist Bob Sullivan has spent his life showing people they're not dumb tech consumers - they're being hacked. \n\nEach week, Bob and Alia join forces to answer your questions and untangle your sanity from this dark, scary world wide web.\n\nSo, Bob is a Spoke Media original.</p>",
      "How will the future unfold? What is the impact of technology on business & society? As technology reorders the world in which live, who will be the winners and who will be the losers? Join Azeem Azhar, curator of the Exponential View newsletter, in deep conversation with the world's leading thinkers and practitioners exploring these and other important questions.\n\nThe views expressed on this podcast are those of its hosts, guests, and callers, and not those of Harvard Business Review.",
      "Learn about getting the most from your Apple technology with focused topics and workflow guests. Creating Mac Power Users, one geek at a time since 2009. Hosted by David Sparks and Stephen Hackett.",
      "Amazing things humans have learnt from the animal kingdom. Inspiring, fascinating, bingeable.",
      "A podcast by Buildertrend that explores the people, technology and innovations of the construction industry.",
      "The new and the next is in OZY's DNA. In our newest podcast, The Future of X, OZY fast-forwards 50 years to explore the industries and domains that will shape our world, and some of the dreamers doing the shaping. In our first season, we explored healthcare in 2069. Next up? The future of the workplace.",
      "In-depth conversations about Swift and software development in general, hosted by John Sundell.",
      "Technology is reshaping our cities—often without permission and sometimes without a clue. Hosted by urban innovation expert Molly Turner and startup advisor Jim Kapsis, the new podcast from CityLab will ask the questions nobody is asking about what needs to change for tech to help solve more problems than it creates.",
      "Welcome to DamonsBraveNewWorld...\nThe Greatest Science-Fiction PodCast on Earth and in The Galaxy!\nDBNW is a collection of stories about a Celestial Civilization called DianToz and The AlPha Religion.",
      "<p>This future-gazing series examines an assortment of speculative scenarios, what-if conjectures and provocative prophecies. Not all of them will come to pass, but thinking about possible futures can help us understand the present, and catch glimpses of the world ahead.</p>",
      "<p>Welcome to Black Mirror Cracked - the podcast for all your Black Mirror needs. We alternate between episode analysis and interviews featuring journalists, actors from the show and even <a href=\"https://aca.st/d20bf3\" target=\"_blank\">Charlie Brooker</a> himself!</p><p><br></p><p>For more Black Mirror stuff, follow our Twitter <a href=\"twitter.com/blackmirrorcrrr\" target=\"_blank\">@BlackMirrorCrrr</a>, join the conversation in our <a href=\"facebook.com/groups/1794095810893271/\" target=\"_blank\">Facebook group</a> or read more at <a href=\"https://www.mirror.co.uk/all-about/black-mirror\" target=\"_blank\">mirror.co.uk/blackmirror</a> Thanks for listening!</p><p><br></p><p>Black Mirror Cracked is hosted by <a href=\"https://twitter.com/Jymography\" target=\"_blank\">James Ide</a> and produced by <a href=\"https://www.twitter.com/Danoogie\" target=\"_blank\">Daniel Jackson</a>.</p>",
      "<p>After more than a decade in London, Danny Fortson returns to Silicon Valley to meet the techies trying to change the world - and make loads of money while doing it.</p>",
      "Why are people designing video games in war zones? How do you catch a catfisher? Can we trust AI lie detectors? Each week, Jordan Erica Webber is joined by experts to answer these questions on our digital culture podcast, Chips with Everything",
      "Keep up to date with independent, authoritative and trustworthy discussion of the tech news of the day. Tom Merritt and co-host's home for daily tech news. ",
      "<p>This is not a traditional career podcast. It’s a podcast for people who’ve looked at their interests to shape the work they do. What does it mean to be a philosopher? How is Big Tech affecting us? How do you combine activism with being the editor of a magazine? Award-winning author Emma Gannon has a gentle line of questioning that starts with work, and ends up wherever the conversations lead. Named Best Business podcast by Vuelio, Ctrl Alt Delete is a gateway into new ideas – with over 5million downloads and past guests including Alain de Botton, Dame Steve Shirley and Mrs Hinch.</p>",
      "Join Matt Cardona (WWE Superstar Zack Ryder) and Brian Myers (WWE Superstar Curt Hawkins) as they talk about one of their favorite hobbies, collecting wrestling toys! Each week listen to two members of Mattel's “Elite Squad” chat about the latest news, upcoming releases, toy history, vintage collecting and much more!",
      "\n      <p>It's the question of our times: How is technology impacting our humanity? \"Should This Exist?\" invites the creators of radical new technologies to set aside their business plan, and think through the human side: What is the invention’s greatest promise? And what could possibly go wrong? Show host Caterina Fake (Partner, Yes VC; Cofounder Flickr) is a celebrated tech pioneer and one of Silicon Valley’s most eloquent commentators on technology and the human condition. Joined by a roster of all-star expert guests who have a knack for looking around corners, Caterina drops listeners into the minds of today’s ingenious entrepreneurs and guides them through the journey of foreseeing what their technology might do to us, and for us.&nbsp;Should This Exist? is a WaitWhat original series in partnership with Quartz. </p>\n    ",
      "<p>One Vision podcast co-hosted by Theodora Lau, Arunkumar Krishnakumar and Bradley Leimer brings purposeful innovation to spotlight.</p><p>Its where impact meets innovation. One Vision is a convergence of minds that dream of a sustainable world for future generations galvanized by innovation.</p><br><p>We speak to startup founders, investors, industry players, thought leaders and policy makers in the innovation ecosystem and get their views. While there have been a lot discussed about innovation in the western world, we believe that impact at scale can be achieved in the emerging markets too. In recent times we have seen several leap frog moments across the emerging world. What Alibaba and Tencent have achieved in China, PayTM in India and MPesa in Africa are great examples of impactful stories. We talk to many emerging market players and highlight their efforts to create such leap frog moments.</p><br><p>We believe there are many innovation stories that have impact on people's life across the world. We identify these stories and talk to them about their journeys, successes and challenges they have had to overcome. In providing a stage for these entrepreneurs, thought leaders and innovators, we hope to inspire a generation looking to effect positive change. One Vision, One Dream, One Voice for One sustainable future.</p>",
      "Get the most out of your iPhone and iPad. Editors of iPhone Life magazine share with you the latest Apple news, best apps, iPhone tricks, and the coolest accessories.",
      "Filled with interesting stories, almost breaking news, a pinch of wit and a dash of banter. Some YouTube outtakes, and a few guests who actually know what is going on in the world of EVs, renewable energy and sustainability.",
      "The Bible Recap",
      "Do you make, break, and tinker with things? Are you a seeker of unconventional wisdom? Do you think in algorithms? Then welcome to FTFY, also known as Fixed That For You—a show about solving problems with data and algorithms. When we say Fixed That For You, we don’t mean it in that sometimes-snarky, message board way. We’re talking about the unconventional ways that really clever people tackle big problems, small problems, mysterious problems, even weird problems. And we learn about the iterative process behind inventive solutions to those problems, devised by engineers, software developers, computer scientists, and everyday people who are doing incredible things with data. From preventing human stampedes, to building an artificial pancreas, to finding the perfect romantic partner, to tracking down criminal wildlife poachers, and much more, there’s probably an algorithm for that. Hosted by science journalist, Cara Santa Maria.",
      "Every company has a story.\n\nAcquired goes behind the scenes of the biggest tech IPOs and acquisitions of all time.",
      "For many of us, checking our phone is the last thing we do before bed, first thing we do in the morning, during breakfast, on the toilet, in the car, during school, during work, hanging out with friends or family, walking the dog, waiting in line, feeling awkward or left out, procrastinating, and much much more. This is a space to learn more about digital technology, media and screens and how they affect us all. This podcast consists of interviews with professionals, teachers, teens, parents, and more, exploring how we can educate ourselves on the good, bad and pixilated. \n\nIf you like this podcast, please help to spread awareness by telling others.  For regular updates on the latest research, good reads, my personal encounters with screens, silly comics and stories head on over to www.devicesdivide.org. Feel free to contact me at the.device.divide@gmail.com.\n\nHappy screening!\n\nSent from my iPhone.",
      "Defensive Security is a weekly information security podcast which reviews recent high profile cyber security breaches, data  breaches, malware infections and intrusions to identify lessons that we can learn and apply to the organizations we protect. ",
      "A podcast on the journey to discovery and decision making through data in information security by Bob Rudis and Jay Jacobs.",
      "News. Trends. Insights.",
      "The securitycurrent podcast explores what is really on the mind of information technology security executives and practitioners. Prepare to be enlightened, engaged, perhaps challenged, and definitely informed. \n\nHear first hand what the real security issues are, learn what is behind the issues and get to know the people who are responsible for online security and privacy.\n\nHosted by IT security professionals for everyone.",
      "The SurfWatch Cyber Chat podcast includes interviews with experts on all things related to cyber risk. Learn what cybercriminals are up to and how it’s impacting businesses from those in the trenches. \n\nSurfWatch Labs helps organizations and service providers quickly establish a strategic cyber threat intelligence operation that drives more effective use of their tactical defenses. For more information, visit www.surfwatchlabs.com.",
      "Knoxville, TN DUI Lawyers",
      "Join Andy Willingham, Martin Fisher,Steve Ragan, Yvette Johnson, and Joseph Sokoly as they discuss information security, news, and interview interesting people.  Get in the discussion at www.southernfriedsecurity.com.",
      "Security Conversations is a cybersecurity podcast series curated by award-winning journalist and security strategist <a href=\"https://twitter.com/ryanaraine/\">Ryan Naraine</a>. These in-depth interviews cover a wide range of top-of-mind issues, including threat intelligence, zero trust, securing cloud deployments, penetration testing, bug bounties, advancements in offensive research and targeted threat activity. \n",
      "The Social-Engineer Podcast is about humans.  Understanding how we interact, communicate and relay information can help us protect, mitigate and understand social engineering attacks",
      "Covering Virtualization and Cloud Computing News, VMware vSphere How-To, Events, and Interviews",
      "Risky Business is a weekly information security podcast featuring news and in-depth interviews with industry luminaries. Launched in February 2007, Risky Business is a must-listen digest for information security pros. With a running time of approximately 50-60 minutes, Risky Business is pacy; a security podcast without the waffle.",
      "Podcast by Sophos",
      "Building Security In.",
      "The Exploring Information Security podcast interviews a different professional each week exploring topics, ideas, and disciplines within information security. Prepare to learn, explore, and grow your security mindset.",
      "A security podcast geared towards those looking to better understand security topics of the day. Hosted by Kurt Seifried and Josh Bressers covering a wide range of topics including IoT, application security, operational security, cloud, devops, and security news of the day. There is a special open source twist to the discussion often giving a unique perspective on any given topic.",
      "<p>I'm Daniel Miessler, and I spend 5-20 hours a week consuming books, podcasts, and articles around the intersection of security, technology, and humans. Each episode&mdash;which is available as both a newsletter and a podcast&mdash;is either a curated summary of what I learned in the past week, or a standalone idea that hopefully gives you something to think about.</p>",
      "The CyberJungle is the nation's first news talk show on security, privacy and the law. Featuring digital forensics and infosec specialist Ira Victor and award-winning journalist Samantha Stone. The show is fast-paced and includes hard hitting news analysis. Formerly The Data Security Podcast. ",
      "Threatpost writers Mike Mimoso and Chris Brook discuss security threats, attacks, vulnerability research and trends with a variety of industry executives, researchers and experts.",
      "Exclusive, insightful audio interviews by our staff with data breach/security leading practitioners and thought-leaders",
      "Curious about application security?  Want to learn how to detect security vulnerabilities and protect your application.  We discuss different topics and provide valuable insights into the world of application security.",
      "Hosted by Paul Roberts. The top minds in information security discuss the news of the week.",
      "More signal, less noise—we distill the day’s critical cyber security news into a concise daily briefing.",
      "For the latest in computer security news, hacking, and research!  We sit around, drink beer, and talk security.  Our show will feature technical segments that show you how to use the latest tools and techniques.  Special guests appear on the show to enlighten us and change your perspective on information security.",
      "Hosted by cybersecurity and privacy professionals Tom Eston and Scott Wright, Shared Security is a weekly podcast that explores the trust you put in people, apps, and technology. We bring you news, tips, advice, and interviews with cybersecurity and privacy experts to help you live more secure and private in our connected world. ",
      "Follow the Wh1t3 Rabbit\n ... attention technology and business leaders!\n\nThe \"Down the Security Rabbithole\" podcast is not your ordinary security podcast, primarily because we take a business perspective on the colorful and fast-paced world of information security.  Bringing useful commentary on relevant events in the information security community, filtered through a no-nonsense business first approach, this is a podcast that helps you get the sane perspective on hacks, risks, threats and technology that you need to help make decisions in your daily life and in your organization.",
      "The Day One podcast brings you best practices, roadmap information, user and employee interviews, and how to get the most out of the app Day One. http://dayoneapp.com",
      "The Mac Observer: You'll Hear Your Mac News Here From Now On...",
      "NATIONALLY SYNDICATED AM/FM RADIO SHOW, TV SHOW & PODCAST\n\nWith millions of listeners a month, Building the Future has quickly become one of the fastest rising nationally syndicated programs. With a focus on interviewing startups, entrepreneurs, investors, CEOs, and more, the show showcases individuals who are realizing their dreams and helping to make our world a better place through technology and innovation.",
      "The Eighth Bit Network\nGiving your ear drums a digital playground! Support this podcast: <a href=\"https://anchor.fm/the-eighth-bit-network/support\" rel=\"payment\">https://anchor.fm/the-eighth-bit-network/support</a>",
      "Sharing Anchor.fm tips, tricks & tutorials - all things podcasting and content creation! Dr. Dan Davidson leverages his advanced understanding of Anchor to produce over a dozen podcasts with the platform. \nConnect at AnchorTalk.com / Facebook.com/AnchorTalk / Twitter.com/AnchorTalk / Instagram.com/AnchorTalk and Facebook Groups at AnchorVoices.AnchorTalk.com and AnchorBootCamps.AnchorTalk.com /  Support this podcast: <a href=\"https://anchor.fm/anchortalk/support\" rel=\"payment\">https://anchor.fm/anchortalk/support</a>",
      "Lighthearted security advice and banter from 1Password and guests.",
      "Join Sebastien Page and Cody Lee on this weekly podcast about everything Apple and beyond.",
      "A daily overview of the latest hacking news, exploits, vulnerabilities, leaks…. everything under one roof",
      "<p><strong>Hacking. Hackers. Disinformation campaigns. Encryption. The Cyber. This stuff gets complicated really fast, but Motherboard spends its time embedded in the infosec world so you don't have to. Host Ben Makuch talks every week to Motherboard reporters Lorenzo Franceschi-Bicchierai and Joseph Cox about the stories they're breaking and to the industry's most famous hackers and researchers about the biggest news in cybersecurity.</strong></p>",
      "The UK's biggest technology monthly!",
      "View the Episode Archive »\nSubscribe to the podcast via iTunes | RSS.\n#smartbinge Radiolab podcasts\n",
      "\n      <p>Netflix vs. HBO. Nike vs. Adidas. Business is war. Sometimes the prize is your wallet, or your attention. Sometimes, it’s just the fun of beating the other guy. The outcome of these battles shapes what we buy and how we live.&nbsp;</p><p>Business Wars gives you the unauthorized, real story of what drives these companies and their leaders, inventors, investors and executives to new heights -- or to ruin. Hosted by David Brown, former anchor of Marketplace. From Wondery, the network behind Dirty John and American History Tellers. </p>\n    ",
      "<p>Science, pop culture and comedy collide on StarTalk Radio! Astrophysicist and Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities and scientists discuss astronomy, physics, and everything else about life in the universe. Keep Looking Up! New episodes premiere Friday nights at 7pm ET.</p>",
      "Your weekly dose of privacy, digital security, and open source intelligence (OSINT) news and opinion.",
      "<p>Every Tuesday and Friday, Recode’s Kara Swisher and NYU Professor Scott Galloway offer sharp, unfiltered insights into the biggest stories in tech, business, and politics. They make bold predictions, pick winners and losers, and bicker and banter like no one else. After all, with great power comes great scrutiny. Produced by Recode and the Vox Media Podcast Network.</p>",
      "Our culture is shaped by technology, and the people building that technology determine how it’s changing our lives. But who are they? And how do they think about their responsibility to the rest of us? From mental health to algorithmic bias, entrepreneur Anil Dash talks to developers, designers, and culture experts to understand the ways tech is changing culture, and what it means for us. Produced by Glitch and the Vox Media Podcast Network.",
      "Feel overwhelmed by the never-ending waves of technology news? Join The Wall Street Journal's technology columnists as they talk about the most important tech trends -- and why you should care.",
      "Data science is one of the fastest growing industries and has been called the ‘Sexiest job of the 21st Century’. But what exactly is data science?  In this podcast, brought to you by DataCamp, Hugo Bowne-Anderson approaches the question by exploring what problems data science can solve rather than defining what data science is. From automated medical diagnosis and self-driving cars to recommendation systems and climate change, come on a journey with experts from industry and academia to explore the industry that will change the course of the 21st century.",
      "Welcome to The Future of Cities, a new podcast from The Mission. In this podcast we dive deep into topics and technology that are vital to creating a better world.\n\nEach episode features interviews with industry leading experts including city planners, technology innovators, government officials, architects, builders, and more. \n\nA better future won’t happen unless we build it.  \n\nSo hit subscribe and join us as we explore the future of cities.",
      "The Invisible Network is a NASA podcast presented by the Space Communications and Navigation program, giving you a behind-the-scenes glimpse into the feats of engineering that make possible humanity's ambitions among the stars.",
      "Giving you the guts and teaching you the tools to launch or improve your own podcast",
      "Women Who Startup is a learning community for Entrepreneurs. Women Who Startup Radio is our official podcast, reaching a global audience. Headquartered in Colorado and Founded by @lizellevanvuuren #KeepClimbing Support this podcast: <a href=\"https://anchor.fm/womenwhostartup/support\" rel=\"payment\">https://anchor.fm/womenwhostartup/support</a>",
      "audio only",
      "A podcast focused on great products and the people who make them",
      "Paul Kemp, host of The App Guy Podcast Creates Inspiring Founder Stories, Growth Hacking, Funding, Getting Beta Testers, Big Data, Lifestyle, Startups",
      "<p>A series about what it's really like to start a business.</p>",
      "The Reboot podcast showcases the heart and soul, the wins and losses, the ups and downs of startup leadership. On the show, Entrepreneurs, CEOs, and Startup Leaders discuss with Jerry Colonna the emotional and psychological challenges they face daily as leaders.",
      "This Much I Know is the podcast from Seedcamp, Europe’s seed fund.\n\nTune into hear the inside story from startup founders, investors and leading tech voices: the people who’ve built businesses, scaled globally, failed fantastically and learnt massively.\n\nSeedcamp invests early in world-class founders attacking large, global markets and solving real problems using technology. Seedcamp provides the infrastructure to fast-track a founder’s vision and create value through immediate access to smart capital, a lifelong community of support and a global network built upon a decade’s experience backing exceptional talent.",
      "The Twenty Minute VC takes you inside the world of Venture Capital, Startup Funding and The Pitch. Join our host, Harry Stebbings and discover how you can attain funding for your business by listening to what the most prominent investors are directly looking for in startups, providing easily actionable tips and tricks that can be put in place to increase your chances of getting funded. Although, you may not want to raise funding for a startup. The Twenty Minute VC also provides an instructional guide as to what it takes to get employed in the Venture Capital industry, with VCs giving specific advice on how to get noticed from the crowd and increasing your chances of employment. If that wasn't enough our amazing Venture Capitalists also provide their analysis of the current technology market, providing advice and suggestions on the latest investing trends and predictions. Join us so you can see how you can get BIG, powerful improvements, fast. Would you like to see more of The Twenty Minute VC, head on over to www.thetwentyminutevc.com for more information on the podcast, show notes, resources and a more detailed analysis of the technology and Venture Capital industry.",
      "“This is Product Management” interviews brilliant minds across the numerous disciplines that fuel the modern product manager. Episodes span from arts to science, tactics to strategies, confessions to professions. Take a deep dive into user experience, statistics, innovation, differentiation, design, development, metrics, and more with the latest podcast for product managers.\n\nLearn more and subscribe at thisisproductmanagement.com.",
      "<p>Listen as real entrepreneurs pitch to real investors—for real money. In each episode, we take you behind closed doors to the critical moment when aspiring entrepreneurs put it all on the line. While it offers a glimpse into the high-stakes world of venture capital, it’s really a show about human relationships: how people sell their ideas, what makes investors tick, and how these initial conversations can bloom into business deals—or die on the vine. Hosted by Josh Muccio.</p>",
      "A weekly conversation about design process and culture. Hosted by Marshall Bock and Brian Lovin.",
      "Business tips for startups by proven entrepreneurs",
      "Join us in discovering the best ways to create and grown your own online business.",
      "Fintech 5 is a glimpse behind the scenes with the game changers in money and technology.    Jason Henrichs gets a quick 5 minutes with guests, and wastes no time trying to probe what drives and influences industry leaders. ",
      "We explore the innovations and ideas that will transform our cities.",
      "Some of the world's leading inventors and researchers share demos, breakthroughs and visions onstage at the TED conference, TEDx events and partner events around the world. You can also download these and many other videos free on TED.com, with an interactive English transcript and subtitles in up to 80 languages. TED is a nonprofit devoted to Ideas Worth Spreading.",
      "Your weekly briefing on the world of tech, focusing on news, views and a fair few digressions from staff of Computerworlduk.com, Macworld.co.uk, PCAdvisor.co.uk and Techworld.com",
      "The monthly podcast from CIO UK, the leading community of Chief Information Officers, Chief Technology Officers and IT directors in the UK. Interviews, discussions, musings and hob-nobbing with the UK's business technology leaders.",
      "Leo Laporte, Jeff Jarvis, Stacey Higginbotham, Ant Pruitt, and their guests talk about the latest Google and cloud computing news.\n\nRecords live every Wednesday at 4:00pm Eastern / 1:00pm Pacific / 21:00 UTC.",
      "Countdown to excitement! Every week Christina Warren, Brianna Wu and Simone de Rochefort have accelerated geek conversation. Tech, comics, movies, games and books, no galaxy is off limits! Hosted by Brianna Wu, Christina Warren, and Simone De Rochefort.",
      "The award-winning WIRED UK Podcast with James Temperton and the rest of the team. Listen every week for the an informed and entertaining rundown of latest technology, science, business and culture news. New episodes every Friday.",
      "Welcome to IT Visionaries, your #1 source for actionable insights, lessons learned, and exclusive interviews with trailblazing IT leaders.\n\nWhen you subscribe to IT Visionaries, you’ll get two weekly episodes.\n\nEach is packed with value, stories, and trends - all directly from leaders on the frontlines of technological innovation.",
      "In our world of co-creation, hyper-connectivity and exponentially growing technology, our science industry is in much need of disruption. Our slow processes, our steep barriers to entry, and our poor external and internal communication is eroding trust and discouraging talent. We speak to the innovators, iconoclasts and entrepreneurs intent on creating change.  This is the Science: Disrupt podcast.",
      "Stories about the people transforming technology from the command line up.",
      "The Time4Marketing podcast finds the best talks on all marketing conferences that you did not attend and talks to the speakers. They tell us, what they told at the conference, we ask them questions to go further, you get all the answers.",
      "An audio podcast discussing topics surrounding the world of Apple.",
      "PTZOptics is a broadcast, live streaming and conference camera manufacturer operating out of Downingtown, Pennsylvania, USA. We provide Pan Tilt Zoom Cameras with HDMI, HD-SDI, USB 3.0 and IP Streaming at resolutions up to 1080p60fps for the professional broadcast and video conferencing markets.",
      "A show for CEO's, CMO's CRO's and Venture Capitalists\n\nIf you are in a B2B Leadership role this is the podcast for you. The founder of \"The Brutal Truth About Sales & Selling\" interviews the most thought-provoking guests. We will cover what is working today in Sales & Marketing. \n\nIf you like Tim Ferriss, Bill Burr, Dave Ramsey, Serial, Reply All, The Art of Charm, HBR, WTF, Startup, Motley Fool, Money, Gimlet, TEDTalk, NPR, EOFIRE, The TOP, Ziglar, Hustler, Advanced Selling, Salesman Red, Sales Gravy jeb blunt jocko GaryVEE SaaStr VC you will like this.",
      "The Internet: the most impactful invention of modern human history. It has transformed the way that we talk with each other, do business, educate and learn - even the way we think. But how did we get here? What were the choices, the experiments, and, yes, even the moments of blind luck that created the Internet we use today? And, more importantly, who are the innovators and disruptors that are building what we will use next?\n\nHosted by podcast personality Zach Valenti with guest hosts Ryan Shea and Muneeb Ali, co-founders of Blockstack, \"The Internet 3.0\" brings you the stories of digital explorers on the frontier of decentralized protocols, cryptocurrencies, and other revolutionary technologies that are changing the face of the Internet forever.\n\nTheme music by Andrew Applepie (http://andrewapplepie.com) & Cover Art by David Brunell-Brutman (http://davidbrunellbrutman.com).",
      "\n      <p>CNBC's “Beyond the Valley” brings you all the latest from the vast, dynamic world of tech — outside the Silicon Valley.</p>\n    ",
      "Gigaom, the industry-leading tech research company, brings you the AI Minute, our unique analysis and commentary on the present and future of AI.",
      "Startup School Radio is a weekly broadcast where you'll hear  Aaron Harris, a partner at Y Combinator, get stories and practical advice from founders and investors. Learn how they got started, what went wrong, what surprised them, and what happened as their companies grew.\n\nOriginally broadcast on Sirius XM's Business Radio powered by the Wharton school on Sirius 111.",
      "At the Business Innovation Factory, we help leaders design and test transformational business models. We do this for businesses and in complex social systems such as healthcare, education, and government. Our approach is human-centered — we seek to understand the jobs customers need done, and use this insight to design new experiences that will better serve them. We experiment in the real world, and rely on storytelling to engage others in the process.",
      "\n      <p>The best startup advice from Silicon Valley &amp; beyond. Iconic CEOs — from Nike to Netflix, Starbucks to Slack — share the stories &amp; strategies that helped them grow from startups into global brands.</p><p>On each episode, host Reid Hoffman — LinkedIn cofounder, Greylock partner and legendary Silicon Valley investor — proves an unconventional theory about how businesses scale, while his guests share the story of how I built this company. Reid and guests talk entrepreneurship, leadership, strategy, management, fundraising. But they also talk about the human journey — with all its failures and setbacks.&nbsp;</p><p>With original, cinematic music and hilariously honest stories, Masters of Scale is a business podcast that doesn’t sound like a business podcast.</p><p>Guests on Masters of Scale have included the founders and CEOs of Netflix, Google, Facebook, Starbucks, Nike, Fiat, Spotify, Instagram, Airbnb, Uber, Paypal, Huffington Post, Twitter, Medium, Bumble, Yahoo, Slack, Spanx, Shake Shack, Dropbox, TaskRabbit, 23&amp;Me, Mailchimp, Evite, Flickr, CharityWater, Endeavor, IAC and many more.</p>\n    ",
      "We tell the unexpected stories of digital disruption. Listen in as Walter Isaacson, digital revolution expert, explores the unknown drama behind some of the world’s biggest digital disruptions, the daring trailblazers willing to think differently, and the lessons learned along the way. Brought to you by Dell Technologies.",
      "Powderkeg shares Startup Stories for High-Growth Business Leaders with Entrepreneurs, Investors, and Top Talent Beyond Silicon Valley. Powder Keg Gives You the Best Business Strategy from SaaS Entrepreneurs, Startup Investors, and Business Experts.",
      "<p>Inside Outside Innovation explores the ins and outs of innovation with raw stories, real insights, and tactical advice from the best and brightest in startups &amp; corporate innovation. Each week we’ll bring you the latest thinking in Lean Startup, Design Thinking, Corporate Venture Capital and more. Join the movers, shakers, makers, founders, builders, and creators to help speed up your knowledge, skills, and network. Previous guests include thought leaders such as Brad Feld, Alistair Croll, Diana Kander, Marc Hemeon, Brant Cooper, and more. This podcast is available on: Acast, iTunes, Google Play Music, Stitcher, and InsideOutside.io. Sign up for the weekly innovation newsletter at https://tinyurl.com/y89am9po. Follow Brian on Twitter at @ardinger or @theiopodcsast.&nbsp;Email brian@insideoutside.io.</p>",
      "The McKinsey Podcast, our new flagship podcast series, takes you inside our global firm, and features conversations with experts on issues that matter most in business and management. McKinsey & Company is a management-consulting firm that helps businesses, governments, and not-for-profit organizations realize their most important goals. Topics covered in this series include strategy, technology, leadership, marketing, operations, organization, and the role of business in society.",
      "Six Pixels of Separation - Mitch Joel’s weekly conversation with business leaders, thinkers, innovators and cultural icons. The show is about insights and provocations on brands, consumers, technology, business and how connected we’ve all become.",
      "Research-based guidance on how to manage customer experience (CX) at any organization — an imperative that Forrester has been researching for over 20 years. Each week, Forrester analysts discuss key findings from their latest research on CX; analyze relevant topics in the news; or chat with CX professionals about how they’ve overcome prevalent challenges managing CX in their organizations.",
      "Supporting entrepreneurs & inspiring innovation.",
      "Stephen Hawking once said that intelligence is the ability to adapt to change... so let’s adapt. \n\nHosted by author and entrepreneur, Steve Glaveski, Future Squared brings you conversations with preeminent thought leaders from myriad disciplines such as startups and entrepreneurship, technology, corporate innovation, psychology, philosophy, economics, politics, biology, human performance and productivity, motivation and self development, management and leadership, health and fitness and more to help you think in a multi-disciplinary way, avoid relying on the first piece of information that comes to hand, kick goals in your professional and personal life and better navigate what is fast becoming, a Brave New World.  \n\nPrevious guests include thought leaders such as Adam Grant, Brad Feld, Tim O'Reilly, Gretchen Rubin, Kevin Kelly, Jeremy Heimans, Steve Blank, Neil Patel, Rand Fishkin, Jordan Harbinger, Omar Zenhom, Andreas Antonopoulos, Ryan Blair, Whitney Johnson and various other thought leaders. \n\nPast topics have explored the likes of:\nBlockchain, virtual and augmented reality, algorithms, machine learning, artificial intelligence and universal basic income (UBI), sales and marketing, lean startup, design thinking, agile, political correctness, identity politics, cloud computing, geopolitics, neuroscience, data science, fintech, proptech, sports, tech addiction, CRISPR, venture capital, angel investment, nootropics and cognitive therapies, big data, cloud computing, DevOps, fake news, web development, UX and UI, influencer and content marketing, emotional intelligence, Stoic philosophy, mindfulness and meditation, chatbots, automation, IoT, Bitcoin, Ethereum, Trump, tech trends, Pixar animation studios, Facebook, Amazon, Apple, Google, disruption to incumbents, how to measure innovation, extreme ownership, radical transparency and a hell of a lot more!\n\nFuture Squared is brought to you by Collective Campus, a innovation accelerator that works with organisations to unlock their people’s latent potential to create more impact for humanity and lead more fulfilling lives. If you need help driving your organisation’s innovation strategy, visit www.collectivecampus.io\n \nThis podcast is available on:\n- iTunes: http://apple.co/1QWMgS7\n- Stitcher: www.stitcher.com/podcast/future\n- Spotify: open.spotify.com/show/5LH1aSj8WQYWnYQdn9AmuW\n\nLinks:\nFuture Squared website: www.FutureSquared.xyz\nSteve Glaveski website: www.SteveGlaveski.com\nTwitter: @steveglaveski \nInstagram: @thesteveglaveski\nEmail: steve@collectivecamp.us",
      "Guy Raz dives into the stories behind some of the world's best known companies. <em>How I Built This</em> weaves a narrative journey about innovators, entrepreneurs and idealists—and the movements they built.",
      "The team behind the business intelligence platform talk to pioneers in retail and customer experience... These folks are at the top of our PurpleList",
      "Conversations about technology, science, and the human condition.",
      "Through interviews with the most successful podcasters in the game, this show will uncover the best podcasting strategies that you can apply to your show.\n\nWe cover all aspects of podcasting in a simplified and entertaining way. Topics include SEO, monetization, affiliate marketing, recording equipment, interview techniques, engineering, hosting, and even how to start your own podcast from zero to launch.",
      "Product Hunt Radio is a a weekly podcast with the people creating and exploring the future. Tune in every week with Ryan Hoover and Abadesi Osunsade as they're joined by founders, investors, journalists, and makers to discuss the latest in tech.",
      "Each week's most relevant and interesting news stories in voice technology, discussed by a panel of experts. Hosted by Bradley Metrock (CEO, Score Publishing) and part of the VoiceFirst.FM podcast network.",
      "\n      Talking Machines is your window into the world of machine learning. Your hosts, Katherine Gorman and Neil Lawrence, bring you clear conversations with experts in the field, insightful discussions of industry news, and useful answers to your questions.  Machine learning is changing the questions we can ask of the world around us, here we explore how to ask the best questions and what  to do with the answers.\n    ",
      "Learn what's possible - and what's working - with artificial intelligence in the enterprise.\n\nEach week, Emerj founder Daniel Faggella interviews top AI and machine learning-focused executives and researchers in sectors like Pharma, Banking, Retail, Defense, and more.\n\nDiscover trends, learn about what's working now, and learn how to adapt and thrive in an era of AI disruption. Be sure to subscribe to \"AI in Industry.\"",
      "Machine learning and artificial intelligence are dramatically changing the way businesses operate and people live. The TWIML AI Podcast brings the top minds and ideas from the world of ML and AI to a broad and influential community of ML/AI researchers, data scientists, engineers and tech-savvy business and IT leaders.\n\nHosted by Sam Charrington, a sought after industry analyst, speaker, commentator and thought leader.\n\nTechnologies covered include machine learning, artificial intelligence, deep learning, natural language processing, neural networks, analytics, deep learning, computer science, data science and more.",
      "Just two guys looking for a conversation and interesting stories!\n Support this podcast: <a href=\"https://anchor.fm/theheckpodcast/support\" rel=\"payment\">https://anchor.fm/theheckpodcast/support</a>",
      "A podcast dedicated to demystifying Venture Capital. Nick Moran interviews the VC and Angel investor experts on how they find, evaluate and select the next generation of great technology startups.",
      "Ryan Carson, CEO and Founder of Treehouse, interviews the world’s leading engineering managers - so we can learn from their experience and ideas.",
      "Journey into the past, and you'll discover the secret history of the future. From the world's first cyberattack in 1834, to 19th-century virtual reality, The Economist's Tom Standage and Slate's Seth Stevenson examine the historical precedents that can transform our understanding of modern technology, predicting how it might evolve and highlighting pitfalls to avoid. Discovering how people reacted to past innovations can also teach us about ourselves.",
      "MACRO is a brand new podcast series from the Innovation team at Cisco.\n \nWith each episode of MACRO, we'll explore some of the many ways that technology is changing the world – and changing it for the better. We’ll provide the big picture, as well as those all-important close-ups.",
      "Tech that makes the world go round.",
      "Top leaders in business, technology, government, and education discuss digital disruption. Hosted by well-known Industry Analyst Michael Krigsman.<br /><br />See our free video library: <a href=\"https://www.cxotalk.com\">https://www.cxotalk.com</a>",
      "<p>Explore the dark side of the Internet with host Jack Rhysider as he takes you on a journey through the chilling world of privacy hacks, data breaches, and cyber crime. The masterful criminal hackers who dwell on the dark side show us just how vulnerable we all are.</p>",
      "<p>This year, as we enter season four of Podcast Movement Sessions, we're taking a close look at the Society, Culture, and Advocacy tract of PM19. Through conversations recorded on-site in Orlando and audio pulled directly from the Podcast Movement stage, we're tackle some of the most important issues content creators deal with and how podcasting as a medium is unlike any other in showcasing the underrepresented voices of the world in a powerful way. We'll also speak with some of the biggest names in the True Crime genre about balancing their role as advocates and journalists. Plus: a full-circle moment for Podcast Movement as Earlonne Woods and Nigel Poor (co-hosts of&nbsp;<em>Ear Hustle</em>), talk about their journey as podcasters (having won Radiotopia's PodQuest competition back at Podcast Movement 2016), being advocates for criminal justice reform, and how Ear Hustle paved the way for Earlonne's release just this past spring. Subscribe now to Podcast Movement Sessions, the first two episodes of season four will drop on Black Friday (November 29th)!!</p>\n<p>Season Four of the Podcast Movement Sessions is hosted by <a href=\"https://www.producerted.com/\">Producer Ted Woods</a>, and proudly sponsored by <a href=\"https://www.storyblocks.com/\">Storyblocks</a>.</p>",
      "Mo + Jo's Epic Tech Talks, is a conversation between two regular guys that work in the Marketing Tech industry. Mo works on the tech side, Jo works on the agency side - together they demystify tech and share an unfiltered POV on what matters... and what doesn't. They keep things funny, informative and irreverent (Music Credit: Dope Focus, Monday Morning by Andrew Zap)",
      "Join Chris Dyer from PeopleG2 as he interviews top executives about leadership and talent development.",
      "Get smarter, faster on the most talked-about topics in tech, business and politics in just 10 minutes. Hosted by Axios' business editor, Dan Primack.",
      "Everything you need to know to automate your smart home and life. We cover the latest smart home topics, smart home devices and interview smart home company founders so you can learn how to automate your smart home.  We want to empower you to automate your home and provide smart home industry tips, tricks and insights straight from smart home experts. Whether you are just starting your smart home, or you are  a smart home industry pro we are here to provide value to you.  For more smart home automation information you can find us at www.onehoursmarthome.com",
      "Automation makes your life easier and everyone can do it. We tell you how.  Hosted by David Sparks and Rosemary Orchard.",
      "On February 12, 1971, in Durham, North Carolina, a 20 year-old nursing student and her 19 year-old boyfriend left a Valentine's Dance to park down a secluded lover's lane. They never returned. Two weeks later, their bodies were found deep within the Carolina pines. They had been strangled, tortured, and murdered.\nTheir murders have never been solved. \nTHE LONG DANCE is the story of the lives touched by the murders of Patricia Mann and Jesse McBane. Produced by crime fiction author Eryk Pruitt, investigative reporter Drew Adamek, and sound engineer Piper Kessler, it uses recorded interviews to tell the tragic tale of North Carolina's most baffling murder case. The eight-part true crime podcast is perfect for fans of SERIAL and S-TOWN.",
      "Welcome the Value Inspiration podcast. The goal I have with this podcast is to inspire new forms of value creation by sharing compelling ideas and stories about the potential we can unlock when technology (such as AI and Machine Learning) and people blend in the right way. My strong belief is that we can think big, ….and therefore we should. And doing so will help to create a better world for all of us. This podcast is all about that.",
      "The Late Night Show for your Monday morning",
      "Join the conversation as we break down the latest tech head lines, trends, as well as interview real people in the field. We are here for you!",
      "We are three Black women in tech, telling our stories, one podcast at a time.\nLogo by Pursuit",
      "Hanselminutes is Fresh Air for Developers. A weekly commute-time podcast that promotes fresh technology and fresh voices. ",
      "The Breaking Into Startups Podcast is a platform where we feature stories of people who broke into tech from non-traditional backgrounds. Curious about how startups work, how to get a job without a degree or what technical and non-technical careers are out there? We have news for you - tech fields are booming and you don’t need the best technical degree in information technology to break in and get a six figure job in technology. \n\nOur podcast gives you an inside look at the most disruptive startups by sharing success stories of people from all walks of life, including college drop outs, professional and student athletes, army veterans, teen parents, corporate folks, investment bankers, consultants, venture capitalists who acquired new skills and found jobs in technology. \n\nOur guests attended coding bootcamps and immersive programs like Hack Reactor, App Academy, General Assembly, Dev Bootcamp, Flatiron School, Iron Yard, Tradecraft and more. After graduating they found well paying jobs in big time startups focusing on education, medicine, financial services, healthcare, AI, machine learning, automation, sharing economy and more. If you listen to 500 Startups, Learn to Code With Me, Twenty Minute VC, This Week In Startups, Startup Radio, Startup Podcast, The Tim Ferris show, Startup School Radio, Course Report or other tech stuff news, then this podcast is for you my friend.",
      "\n      <p>Journalists-turned-entrepreneurs, <a href=\"https://www.stableg.com/about\" rel=\"nofollow\" target=\"_blank\">Manoush Zomorodi and Jen Poyant</a>, share their struggles to build an ethically-minded company, <a href=\"https://www.stableg.com/\" rel=\"nofollow\" target=\"_blank\">Stable Genius Productions</a>, all while investigating how other founders and creators are resisting the “winners take all” mindset of Silicon Valley. From techies putting humanity at the heart of their products, to artists looking beyond ‘likes’ and ‘shares’ for validation, and investors who value empathy over 100 X returns...there’s a new movement to chart a kinder, sustainable, and collective path forward for work and life.</p>\n    ",
      "Learn more at www.netdocuments.com",
      "Arrested DevOps is the podcast that helps you achieve understanding, develop good practices, and operate your team and organization for maximum DevOps awesomeness.",
      "Episodes about building and scaling large software projects",
      "Screaming in the Cloud with Corey Quinn features conversations with domain experts in the world of Cloud Computing. Topics discussed include AWS, GCP, Azure, Oracle Cloud, and the \"why\" behind how businesses are coming to think about the Cloud.",
      "The AWS Podcast is the definitive cloud platform podcast for developers, dev ops, and cloud professionals seeking the latest news and trends in storage, security, infrastructure, serverless, and more. Join Simon Elisha and Jeff Barr for regular updates, deep dives and interviews. Whether you’re building machine learning and AI models, open source projects, or hybrid cloud solutions, the AWS Podcast has something for you.",
      "Innovation Now is a daily 90-second radio series and podcast that gives listeners a front row seat to hear compelling stories of revolutionary ideas, emerging technologies and the people behind the concepts that are shaping our future.",
      "<p>A lovingly crafted podcast that reveals the stories behind the world's most recognizable and interesting sounds.</p>",
      "The Techdirt Podcast, hosted by Michael Masnick.",
      "A weekly podcast featuring the leading thinkers in business and management from Harvard Business Review.",
      "\n            \n        A critical look at new technologies, new approaches and new ways of thinking, from politics to media to environmental sustainability.\n            \n        ",
      "A Venture Perspective on Bitcoin, Blockchain, and the World of Crypto-Assets",
      "Welcome to Converge, a conversational game show hosted by Casey Newton, the Silicon Valley editor of The Verge. Listen as the tech industry’s most fascinating entrepreneurs step into the hot seat to play a series of tailor-made games that are funny and revealing. Produced by The Verge and the Vox Media Podcast Network.",
      "Keeping Backyard Bees is a joint effort by Mother Earth News and Grit magazines to create a hive mind of information on bees, beekeeping, pollen, hives, honey, and much more. Our audience may be seasoned beekeepers, interested in starting a hive, or just concerned about the well-being of bees and want to know how to help. You can make a difference, and we’re here to show you how.",
      "In the second season of Anatomy of Next, explore every aspect of going to Mars, transforming it into a habitable world, and building a new branch of human civilization. How do we bring a cold, dead planet back to life? Can we build an atmosphere on Mars, thaw the frozen plains, and build an ocean? How do we seed a barren land with life, and make a red Mars green? Then, it’s everything from politics and education to money, music, and architecture. What does it mean to be human on an alien world?",
      "\n      <p>DNA science. Artificial intelligence. Smartphones and 3D printers. Science and technology have transformed the world we live in. But how did we get here? It wasn’t by accident. Well, sometimes it was. It was also the result of hard work, teamwork, and competition. And incredibly surprising moments.</p><p>Hosted by bestselling author Steven Johnson (“How We Got To Now”), American Innovations uses immersive scenes to tell the stories of the scientists, engineers, and ordinary people behind the greatest discoveries of the past century. From Wondery, the network behind Business Wars, American History Tellers, and Dirty John. </p>\n    ",
      "Welcome to The Prior Transformation, where I ramble for a few minutes about technology or business. Sometimes I also interview smart people.",
      "Programming Throwdown attempts to educate Computer Scientsts and Software Engineers on a cavalcade of programming and tech topics. Every show covers a new programming language, so listeners will be able to speak intelligently about any programming language. Look for our Podcast in the iTunes Store",
      "Big questions about technology, science, and culture, hosted by The Atlantic’s Derek Thompson. On Season 3 (launching May 9): unbreak the internet.",
      "The Three Pixels Podcast brings you the latest news, reviews and discussions from the worlds of Technology, Gaming and Movies. \n\nSubscribe today and never miss an episode, including special bonus content! \n\nIn each episode we will cover gadgets, games, new technology, old tech, movies, and loads more. Make sure to never miss an episode.\n\nThe Three Pixels is brought to you by Ben Ridley, Martin Gregory and Allan Taylor. Follow us and get in touch on Twitter: https://twitter.com/ThreePixelsPod\n\nFind out more at TheThreePixels.com",
      "Leo Laporte brings some of the most interesting personalities in technology together to talk about the most important issues. Fun, relaxed, informative and always entertaining, count on TWiT for the best tech podcasts in the world.  Catch all the shows live 24/7/365 at https://twit.tv/live\n\n",
      "Leo Laporte brings some of the most interesting personalities in technology together to talk about the most important issues. Fun, relaxed, informative and always entertaining, count on TWiT for the best tech podcasts in the world.  Catch all the shows live 24/7/365 at https://twit.tv/live\n\n",
      "The Android podcast for everyone. A weekly show about Android, Google, and the best of mobile technology. Hosted by Daniel Bader.",
      "The Ars Technicast is the official podcast from Ars Technica, where we bring you you the latest in the worlds of computing, technology, science, and everything else in between. Ars publishes original news and reviews, analysis of tech trends, and expert advice on the most fundamental aspects of tech and the many ways it's helping us enjoy our world.",
      "tnkgrl’s Mobile Tech Podcast is the place to hear the lowdown on the nitty gritty details of what’s happening the world of mobile technology – especially smartphones, personal gadgets and even car tech. tnkgrl (Myriam Joire) has been covering tech for over a decade and was previously Engadget’s Senior Mobile Editor, host of the Engadget Mobile Podcast, and co-host of TWiT’s All About Android.",
      "iPhone, iPad, Mac — for everything Apple and beyond. Learn more. Be more. iMore!",
      "\n      <p>Did you know you can ask Siri to play you audio summaries of the latest headlines in news, business, sports, and music straight from your HomePod or iPhone? This podcast walks you through the steps. You’ll also hear samples of news briefs from our partners. These briefs are also available on Apple TV.</p><p><br></p>\n    ",
      "Entrepreneur Inspiring Stories to Help Motivate, Build, & Grow Your Successful Business with a Master Class from Entrepreneurial Thought Leaders that tell it How It Is...\n\nMillionaire Interviews is actionable advice for the (future & present) Entrepreneur, Thought Leaders, Solopreneur, Youpreneur, and Small Business Owner. The host interviews Business Founders in the Product, Service, Real Estate, and Tech industries so they can teach you from their experience. Guests have been featured on Forbes, Shark Tank, Tim Ferriss Show, EO Fire w/ John Lee Dumas, Fox Business, FM Radio, CNBC, How I Built This w/ Guy Raz, & Time Magazine.\n\nEach episode details the journey of our guest who shares their life experiences, business lessons learned, how they turned their ideas into success, a little econtalk, and how they made their business fire up! We feature entrepreneurial thought leaders, mentors, startalk, & a tribe of entrepreneurs from all over the world...\n\nConnect with other Listeners @ fb.com/millionaire-interviews. Connect with the Show via email: austin@millionaire-interviews.com or voicemail: +1 (305) 985-3469. So How Did this Podcast Get Made? Perseverance, hard work, and determination.",
      "So many podcasts are about our digital devices. Analog(ue) is a show about how these devices make us feel and how they change our lives for the better, but also for the worse.\n Hosted by Myke Hurley and Casey Liss.",
      "Back to Work is an award winning talk show with Merlin Mann and Dan Benjamin discussing productivity, communication, work, barriers, constraints, tools, and more. Hosted by Merlin Mann & Dan Benjamin.",
      "Clockwise is a rapid-fire discussion of current technology issues hosted by Dan Moren and Mikah Sargent and featuring two special guests each week. Four people, four topics--and because we're always watching the clock, no episode is longer than 30 minutes. Hosted by Dan Moren and Mikah Sargent.",
      "<p>What really happens when a hacker snatches all your data? Breach digs into the who, why and how of history’s most notorious data breaches. Hosted by journalist Bob Sullivan and producer Alia Tavakolian. </p><p><br></p><p>Season 2 - Equifax: the worst breach ever. How hackers stole the most valuable data of 145 million people, why it matters, and what we can do about it.</p>",
      "No one does a better job of explaining technology, computers, and the Internet than Leo Laporte. This feed contains the full audio of his twice weekly radio talk show as heard on stations all over the US on the Premiere Radio Networks. For show notes and more visit techguylabs.com.\n\nRecords live weekends at 2:06pm Eastern / 11:06am Pacific / 19:06 UTC.",
      "Apple Bitz XL is everything good and bad inside the world of Apple from tech host Brian Tong. He gives his raw honest take while having fun after covering and working for Apple for over 15 years.\n\nSupport the show! www.patreon.com/briantong",
      "Become the best software developer you can be",
      "A podcast about tech and society, hosted by Ben Thompson and James Allworth",
      "An audio spin off of Swift Weekly Brief and discussions on the Swift programming language. ",
      "Inside Skunk Works is back for its second season! Building on the history of the Skunk Works® shared in Season 1, this podcast uncovers our future focused innovations through first-hand accounts of test pilots, engineers and designers. Rapidly developing disruptive technologies, brainstorming out of the box solutions and engineering the future of flight – all at Skunk Works.\n\nThis season, we’re diving into hypersonics, unmanned systems and conceptual design. In true Skunk Works fashion, our fast-paced culture is brought to life in our rapid prototyping episode. Join in on the conversation of how Lockheed Martin Skunk Works is providing tomorrow’s solutions – today!\n\nFor exclusive content, check out our show notes at LockheedMartin.com/insideskunkworks\n\nEmail us at insideskunkworks.lm@lmco.com\n\nProduced by Claire Whitfield & Theresa Hoey\nArtwork by Becca Smith & Francisco Silva\nWeb Content by Kyra Betteridge",
      "Why do people keep resisting new things? That’s the question Pessimists Archive tries to answer. In each episode, we travel back in time to the moment that a new technology or innovation was introduced—something that today we think of as totally commonplace!—and we explore why everyone was freaking out about it. Our hope is this: By seeing how repetitive and often silly yesterday's fears were, we can begin to defang today’s fears as well.\n\nPessimists Archive is hosted by Jason Feifer. Follow us on Twitter at @pessimistsarc, which is run by Louis Anslow. Our email is pessimistsarchive@gmail.com, and website is pessimists.co.",
      "Join Mark (CEO), Will (Editor-In-Chief), and their guests as they explore how emerging technology can change governments, industries, and commerce as we know it. Learn a little bit about our team as we discuss crypto, philosophy and a bit of cosmology with ICO Executives, Influencers, Investors, Entrepreneurs, & Pundits. Honest, Ad-free, & Open minded conversations. Help us by subscribing & downloading the UBDI app on Google Play or the Apple App Store\n\nProject: https://www.ubdi.com/ Support this podcast: <a href=\"https://anchor.fm/cryptoconomy/support\" rel=\"payment\">https://anchor.fm/cryptoconomy/support</a>",
      "Stay in the know with important news from the Bitcoin world. An easy-to-digest news summary published every Friday. \n\nDelivered in 15 minutes or less! Straight from our global news offices. \n\nCurated by writer Kai Sedgwick. Hosted by Matt Aaron. Part of the Bitcoin.com podcast network.",
      "Robert Plotkin, co-creator of the “Hack Your Mind” series at MIT, explores the intersection between the practice of mindfulness and the use of technology in the modern age on the <a href=\"http://technologyformindfulness.com/podcast/\" target=\"_blank\">Technology For Mindfulness Podcast</a>. Show notes can be found at TechnologyForMindfulness.com/, and you can also follow us at <a href=\"https://twitter.com/TechForMindful\" target=\"_blank\">https://twitter.com/TechForMindful</a> and <a href=\"https://www.facebook.com/TechnologyForMindfulness/\" target=\"_blank\">https://www.facebook.com/TechnologyForMindfulness/</a>. Come back often and feel free to subscribe in iTunes or add the Technology For Mindfulness Podcast to your favorite podcast application. Find more information at <a href=\"http://technologyformindfulness.com/\" target=\"_blank\">http://TechnologyForMindfulness.com/</a>.",
      "Evolving for the Next Billion (new Season 2) is an English-language podcast about tech and entrepreneurship in the fastest-growing markets in the world, hosted by GGV Capital. In Season 1, called 996, we focused on the movers and shakers of China's tech industry, as well as tech leaders with US-China cross-border perspectives. In the new Season 2, Evolving for the Next Billion, we interview local champions and global giants who are reshaping the lives of the next billion internet users. From Beijing to Bangalore, Sao Paulo to Singapore,  you will hear stories about ambition, passion, ingenuity, and resilience.",
      "Podcast by OpTic Gaming",
      "9to5Mac Daily is a recap podcast bringing you the latest in Apple news and the top 9to5Mac stories every Monday through Friday.",
      "best podcast in OpTic",
      "CGP Grey and Myke Hurley are both independent content creators. Each episode, they get together to discuss their working lives. Hosted by CGP Grey and Myke Hurley.",
      "An Apple-Centric podcast about the current state of technology",
      "Welcome to the Official Cryptocurrency Investing Podcast, where Jeff Kirdeikis chats with industry leaders to gain insight into the present state and likely future of the crypto space.",
      "A weekly podcast tracking the transition from fossil fuel transportation to electric and the surrounding clean ecosystems. Hosted by Electrek’s Frederic Lambert and Seth Weintraub.",
      "An ongoing series of conversations bringing you right up to the cutting edge of Microsoft Research.",
      "Podcast by Noded Bitcoin Podcast",
      "Every Friday, Slate’s popular daily news podcast What Next brings you TBD, a clear-eyed look into the future. From fake news to fake meat, algorithms to augmented reality, Lizzie O’Leary is your guide to the tech industry and the world it’s creating for us to live in.",
      "VECTOR is Rene Ritchie's (almost) daily podcast focused on Apple and  personal technology.",
      "BuzzFeed editors Ryan Broderick and Katie Notopoulos explore the weirdest corners of the internet, so you don't have to.",
      "Every week you'll find digitalSoup at the intersection of tech, gaming, and geek culture!",
      "<p>Explore the world's biggest ideas and the people making them happen. Are you ready for self-driving cars, jetpacks, 3D printed food, or a trip to Mars? Moonshot talks to the people who are at the forefront of all this rapid change to find out what the future of humanity might actually look like. Hosted by Kristofor Lawson and Andrew Moon.</p>",
      "Insights from successful entrepreneurs & VCs: how to globally scale innovative technology ventures",
      "Why’d you like that celebrity photo on Instagram? Why’d you leave that restaurant review on Yelp? Why’d you text in lowercase, or turn on read receipts, or share your location? Ashley Carman and Kaitlyn Tiffany ask real people the hard, meta, and occasionally silly questions about the way technology influences our thinking, changes our behavior, and affects our social lives. Produced by The Verge and the Vox Media Podcast Network.",
      "The world is now in the palm of our hands.  Explore how a mobile-first society is changing the human-tech relationship, with the leaders who are influencing this next phase of the evolution. Kargo CMO Ed Romaine takes us on the journey.",
      "Our online life is real life. We walk, talk, work, LOL and even love on the Internet – but we don’t always treat it like real life. Host Manoush Zomorodi explores this disconnect with stories from the wilds of the Web, and gets to the bottom of online issues that affect us all. Whether it’s privacy breaches, closed platforms, hacking, fake news, or cyber bullying, we the people have the power to change the course of the Internet, keeping it ethical, safe, weird, and wonderful for everyone. IRL is an original podcast from Firefox, the tech company backed by Mozilla that believes privacy isn’t a policy. It’s a right.",
      "We talk to business and technology leaders who share analysis, insights, and stories on data science, the Internet of Things, Smart Communities and other forces driving digital transformation and leveraging the power of location intelligence.",
      "StreamGeeks is a podcast all about live streaming and video production We post every Monday at 2 pm ET with tips and tricks for streaming and audience growth. Let's hang 🤓",
      "Escucha nuestro podcast de tecnología y entérate de las mejores noticias de tecnología sólo por TendenciasTech. Lo mejor en Apps, Apple, Juegos móviles, Videojuegos, Gadgets y mucho más. <a href=\"https://www.youtube.com/tendenciastech\" target=\"_blank\">https://www.youtube.com/tendenciastech</a>",
      "Ground-breaking innovations hold real potential to change our lives in the foreseeable future–and not always in the ways you’d imagine. When Fidelity’s investment experts consider this potential, they look well beyond the obvious implications. “The Future According to Now” is a podcast from Atlantic Re:think, the branded content studio at The Atlantic, and Fidelity Investments. Follow along at theatlantic.com/fidelitypodcast, @atlanticrethink, or on your favorite podcast platforms. \n\nPromotional content produced by Atlantic Re:think, the branded content studio at The Atlantic for Fidelity Investments. Fidelity and Atlantic Re:think, the branded content studio at The Atlantic are independent entities.",
      "Syndicated radio show Rover's Morning Glory blends biting commentary, ridiculous antics and discussions that would get most people fired.",
      "Future Thinkers is a media platform, community, and education portal dedicated to the evolution of society, technology, and consciousness. Helping you become better adapted to our uncertain future.\n\nAs seen in BBC, Forbes, World Economic Forum, and iTunes Top 40.\n\nCreated by Mike Gilliland and Euvie Ivanova.",
      "The Drawing Board is a podcast from Udacity focused on discovery.\n\nInnovative thinkers have been going “back to the drawing board” for decades to rethink, reimagine, and redefine their amazing ideas. It’s in this spirit that we welcome you to The Drawing Board, a podcast series from Udacity focusing on the remarkable innovations and individuals shaping our world. Discover groundbreaking new products and transformational new technologies. Learn about exciting new career opportunities, and meet the people powering change in tech and beyond. When you want to know what the future holds, go back to The Drawing Board!\n\nCheck us out at udacity.com/podcast",
      "Full Stack Developers Wes Bos and Scott Tolinski dive deep into web development topics, explaining how they work and talking about their own experiences. They cover from JavaScript frameworks like React, to the latest advancements in CSS to simplifying web tooling.",
      "Malicious Life by Cybereason tells the unknown stories of the history of cybersecurity, with comments and reflections by real hackers, security experts, journalists, and politicians.",
      "The future isn’t random. It’s the result of the choices that we make now. We’ll be talking about technologies and industries that will define the next decade and beyond. \n \nJoin our host Cristina Quinn, a science and technology reporter, as she dives into everything from Minecraft to cyber warfare. \n \nYou can wait for the future to happen to you or engage with it right now and ahead of the curve on .future— a branded podcast from Microsoft, produced in partnership with Gimlet Creative.\n",
      "Jim Dalrymple and Dave Mark face off on all things Apple, tech, music, and just a sprinkling of hockey.",
      "Enjoy the archives of this retired series featuring legendary technology columnist Walt Mossberg and The Verge’s editor-in-chief Nilay Patel. The series finale aired on June 13, 2017, shortly before Walt’s well-deserved retirement. For more on what’s happening now (and next) in technology and gadgets, listen and subscribe to The Vergecast.",
      "The director’s commentary track for Daring Fireball.",
      "Stacey Higginbotham (formerly Sr. Editor at Fortune) and co-host Kevin Tofel discuss the latest news and analysis of the Internet of Things. Covers Consumer IoT, Industrial IoT and Enterprise IoT.  Guests include Vint Cerf, Om Malik, and people from Amazon.com, AT&T, IBM Watson and more.",
      "<p>Kellie Rasberry of the Kidd Kraddick Morning Show teams with her husband, Allen Evans, to talk about relationships, blended family life, love and more!</p>",
      "We talk with people who are shaping the future. A show about technology in business, research, and art.",
      "A convergence of emerging technologies and emerging possibilities is at the heart of this, the greatest period of transformation in human history. Our world is changing in ways that are hard to predict...sometimes even hard to imagine. The World Transformed  is your guide to an astounding future that lies ahead -- and that will be here sooner than you think!",
      "A podcast where startups, founders, and capital collide. ",
      "Thought-provoking conversations from industry leaders and influencers, brought to you by Infragistics, where we make fast and beautiful UI controls and time-saving tools for developers and UX pros, as well as collaborative mobile workspaces and visual data insights for business teams.",
      "AppStories is a weekly exploration of the world of apps by MacStories' Federico Viticci and John Voorhees. Each week, they discuss the best new apps, the impact of apps on our culture, and cover the stories behind popular apps. Hosted by Federico Viticci and John Voorhees.",
      "Recorded Future takes you inside the world of cyber threat intelligence. We’re sharing stories from the trenches and the operations floor as well as giving you the skinny on established and emerging adversaries. We also talk current events, technical tradecraft, and offer up insights on the big picture issues in our industry. Join the Recorded Future team, special guests, and our partners from the CyberWire to learn everything you want to know (and maybe some things you’d rather not know) about the world of cyber threat intelligence.",
      "The show that helps you turn your podcast into a money maker. You'll learn how to earn a 6 figure income from your podcast.",
      "\n      <p>The energy system is changing fast. Come explore the future with journalist Stephen Lacey and venture capitalist Shayle Kann. Each week, they'll take you on a tour of the global energy transformation, providing provide insight into technology trends, markets, and companies -- making for wonky and entertaining listening.</p>\n    ",
      "Linear Digressions is a podcast about machine learning and data science.  Machine learning is being used to solve a ton of interesting problems, and to accomplish goals that were out of reach even a few short years ago.",
      "A podcast interested in the how's and why's of user experience research. Through interviews with industry experts and hands-on trial and error, we indulge and celebrate curiosity. Expect to test assumptions, examine methods, and engage in some old fashion experiments.",
      "<p>A weekly conversation that looks at the way technology is changing our economies, societies and daily lives. Hosted by John Thornhill, innovation editor at the Financial Times.</p>",
      "Nir And Far, a podcast about business, behaviour and the brain by Nir Eyal. Support this podcast: <a href=\"https://anchor.fm/nirandfar/support\" rel=\"payment\">https://anchor.fm/nirandfar/support</a>",
      "<p>pluspluspodcast is a show about science, tech and the future, told from laboratories, garages and factories across the world. Motherboard embeds with the humans and machines shaping our future behind the scenes.</p>",
      "Dipping your fries in a milkshake is a strange combo, just like Nick and Justin. A KiddNation Podcast.",
      "Kyle Crabbs and Joe Marino team up to provide football fans with their thoughts and opinions on the NFL Draft.",
      "Teaches the high level fundamentals of machine learning and artificial intelligence. I teach basic intuition, algorithms, and math. I discuss languages and frameworks, deep learning, and more. Audio may seem inferior, but it's a great supplement during exercise/commute/chores. Where your other resources provide the machine learning trees, I provide the forest. Consider me your syllabus. At the end of every episode I provide high-quality curated resources for learning each episode’s details.",
      "This is daily Apple news. Monday through Friday, Ken Ray brings commute-sized tech news to the podsphere. If it's Apple news, Apple-related news, or news related to Apple-related news, you'll hear about it here. News you'll like... this is Mac OS Ken.",
      "A podcast for getting things done.  Popular Mechanics Editor Jacqueline Detwiler hosts a rotating cast of characters who answer tough questions and provide tips for being smart about life.",
      "\n      Audio replays of conference calls discussing Apple (AAPL) quarterly financial results. Please note that some of the comments in Apple's quarterly earnings conference calls consist of forward looking statements that are subject to risks, and actual results may differ from the Company's forecasts. For more information please refer to the risk factors described in Apple's most recent Forms 10-K and 10-Q. Apple assumes no obligation to update any forward-looking statements or information, which speak as of their respective dates. These calls are typically posted within 24 hours of the earnings announcement, and they generally remain available for two weeks following the announcement. By subscribing to this podcast, you will automatically receive the next Apple earnings call recording when it is posted.\n    ",
      "Ever wonder how technology has transformed your life? In this entertaining and informative podcast, Kim Komando provides insight on the ever-changing tech issues and topics that are relevant to you. This free podcast featuring interviews that Kim conducts with experts in their field. You'll gain an in-depth understanding of a wide variety of topics such as the Dark Web, the life of digital nomads, staying focused on the road, what it takes to keep the lights on and so much more.\nSubscribe below to receive the podcast automatically, download to your computer or media player, or listen directly from this podcast page.",
      "\n      Each week, Melissa Kirsch & Alice Bradley of Lifehacker bring in all-star guests to tackle the stuff that matters—like how to be happy, how to buy a TV, how to be less bad with money and how to tell if you’re dating a psychopath. Look, you're doing great, but quite frankly we think you can be a little better. All your friends do too. It's time for The Upgrade.\n    ",
      "Presented by the leader in note-taking and productivity, Taking Note dives into the realms of personal and professional achievement, entrepreneurship, and creative thinking. We interview experts and trailblazers, uncovering great ideas and best practices to help you organize your work and declutter your life.",
      "What happens when media, entertainment, and technology collide? Peter Kafka, one of the media industry's most acclaimed reporters, talks to business titans, journalists, comedians and podcasters to get their take. Produced by Recode and the Vox Media Podcast Network.",
      "<p>The global technology industry is a powerful engine of innovation that drives the economy. It's also a collection of insular communities full of hidden projects, quiet rivalries, and uncomfortable truths. Join Bloomberg Technology's Brad Stone each week as he and the team's reporters uncover what actually happens behind closed doors.</p>",
      "Three nerds discussing tech, Apple, programming, and loosely related matters.",
      "Hosted by Molly Wood, “Marketplace Tech” demystifies the digital economy. The daily show uncovers how tech influences our lives in unexpected ways and provides context for listeners who care about the impact of tech, business and the digital world.",
      "Steve Gibson, the man who coined the term spyware and created the first anti-spyware program, creator of Spinrite and ShieldsUP, discusses the hot topics in security today with Leo Laporte.\n\nRecords live every Tuesday at 4:30pm Eastern / 1:30pm Pacific / 21:30 UTC.",
      "The Learn to Code With Me podcast, created by Laurence Bradford, is for aspiring techies and self-taught coders looking to transition into the tech industry. Want actionable insights on how you can get paid for your coding skills? Then you're in the right place!",
      "Your first podcast of the week is the last word in tech. Join the top tech pundits in a roundtable discussion of the latest trends in high tech.\n\nRecords live every Sunday at 5:15pm Eastern / 2:15pm Pacific / 22:15 UTC.",
      "TechStuff is a show about technology. And it’s not just how technology works. Join host Jonathan Strickland as he explores the people behind the tech, the companies that market it and how technology affects our lives and culture.",
      "\n      <p>The day's tech news, every day at 5pm. From Techmeme.com, Silicon Valley's most-read news source. 15 minutes and you're up to date. </p>\n    ",
      "The Back to Front show was started in 2013 by web industry veterans Keir Whitaker and Kieran Masterton. Over the first 40 episodes they have discussed everything from web design and development to startups and dog related tech. Today the focus has shifted and includes topics including remote working, working in the web industry, productivity, hipster beards and much more. Released irregularly but always produced with passion The Back to Front Show runs for around 40 minutes per episode and comes to you from the beautiful West Country in the UK. Thanks for listening.",
      "Boagworld is a podcast about digital strategy, service design and user experience. It offers practical advice, news, tools, review and interviews with leading figures in the web design community. Covering everything from usability and design to marketing and strategy, this show has something for everything. This award-winning podcast is the longest running web design podcast with over 380 episodes.",
      "The award winning Big Web Show features special guests and topics like web publishing, art direction, content strategy, typography, web technology, and more. It's everything web that matters. Hosted by Jeffrey Zeldman.",
      "A podcast on data and how it affects our lives — with Enrico Bertini and Moritz Stefaner",
      "\n      <p>Design is everywhere in our lives, perhaps most importantly in the places where we've just stopped noticing. 99% Invisible is a weekly exploration of the process and power of design and architecture. From award winning producer Roman Mars. Learn more at <a href=\"http://99percentinvisible.org\" rel=\"nofollow\" target=\"_blank\">99percentinvisible.org</a>.  </p>\n\n<p>A proud member of Radiotopia, from PRX. Learn more at <a href=\"http://radiotopia.fm/\" rel=\"nofollow\" target=\"_blank\">radiotopia.fm</a>.</p>\n    ",
      "A podcast about the business of design, and the design of business.",
      "Chris Coyier, Alex Vazquez, and Tim Sabat, the co-founders of CodePen talk about the ins and outs of running a web software business.",
      "A podcast about design with your hosts, Mike Monteiro and Jessie Char.",
      "Stories and interviews from people on their coding journey.",
      "A live podcast about front end web design and UX.",
      "Developer Tea exists to help driven developers connect to their ultimate purpose and excel at their work so that they can positively impact the people they influence.\n\nWith over 13 million downloads to date, Developer Tea  is a short podcast hosted by Jonathan Cutrell (@jcutrell), co-founder of Spec and developer at @Clearbit. We hope you'll take the topics from this podcast and continue the conversation, either online or in person with your peers. Twitter: @developertea :: Email: developertea@gmail.com",
      "\n      Weekly podcast discussion about Javascript on the front and back ends. Also discuss programming practices, coding environments, and the communities related to the technology. \n    ",
      "Weekly podcast seeking out the best, brightest, and smartest creatives to find out why they do what they do and how they did it. Free trial plan, no CC required.",
      "CTRL+CLICK CAST inspects the web for you! We proudly feature diverse voices from the industry’s leaders and innovators, who tackle everything from design, code and content management systems, to culture and business challenges. Our focused, topical discussions teach, inspire and waste no time getting to the heart of the matter. Formerly the EE Podcast, CTRL+CLICK is produced by Bright Umbrella and hosted by industry veterans Lea Alcantara and Emily Lewis.",
      "A podcast from Karen McGrane and Ethan Marcotte, who interview people who make responsive designs happen.",
      "Andy Clarke and guests have plenty to talk about.",
      "The Presentable Podcast focuses on how we design and build the products that are shaping our digital future. We'll track the tools, trends, and methods being used by teams from the biggest companies and latest startups. In each episode, Jeff will bring over two decades of experience as a designer, developer, entrepreneur, and investor as he chats with guests about how design is changing the world. Hosted by Jeff Veen.",
      "Welcome to Everything Virtual (formerly Everything Vive)!\nWe chat news, game reviews, and more on the podcast! \n Support this podcast: <a href=\"https://anchor.fm/everythingvirtual/support\" rel=\"payment\">https://anchor.fm/everythingvirtual/support</a>",
      "This is the official podcast of Tested.com. Tested brings you the week's technology and science news, with hosts Will Smith, Norman Chan, and Jeremy Williams. There's no jargon here, just solid explanations of the week's news--and plenty of wacky tangents. Make sure you stick around after the outro for fake outtakes!",
      "Everything VR & AR is a weekly podcast covering technologists, enthusiasts, and companies with real world deployments of virtual reality and augmented reality experiences. Learn from interviews with the leaders in gaming, entertainment, productivity, enterprise, social, education, medicine, software, hardware, psychology and more. This podcast covers everything that is VR and AR including the hottest topics and news in virtual reality and augmented reality. Nathan Pettyjohn, Founder of the VR/AR Association is your host.",
      "Weekly interview show with people at the forefront of transformational technologies. Exploring emerging technologies, futurist ideas and the sociological, moral and philosophical impact of these exponential changes. \n\nMIND & MACHINE is focused on technologies and cultural forces that will transform our world: Artificial Intelligence, Robotics, Augmented Reality,  Space Exploration, Life Extension, Blockchain, Cryptocurrencies, Virtual Reality, IoT Connected Devices, Genomics, Gene Editing, Transhumanism and more.",
      "Join Boost VC’s Founder & Managing Director Adam Draper, to learn about emerging technology from leading figures in the industry. Each episode we interview founders and investors to explore topics like startup strategy and venture capital, as well as incredible technology like bitcoin, virtual reality, AI, exoskeletons, drones, space and more.",
      "Reverend Kyle discusses current Virtual Reality and Augmented Reality technology including the Oculus Rift and HTC Vive. We also take a look at software and peripherals, and do interviews with gamers, developers, and VR enthusiasts.",
      "Designing for Virtual Reality",
      "Humans 2.0 is a mental-health focused Global Top 100 Show for entrepreneurs about the modern technological context of our world and provides anyone with the full tools they need to develop themselves on a regular basis. Hosted by Mark Metry - TEDx keynote speaker, entrepreneur and down to earth human being that loves understanding and passing on the torch to others. Humans 2.0 hit #96 of the top podcasts in the entire world on iTunes among Tim Ferriss, Lewis Howes, NPR & Gary Vaynerchuk.<br /><br />Podcast Guests include Billionaires, New York Times Bestselling Authors, World-class Leaders and people out there in the world walking the walk! Guests like Seth Godin, Ed Mylett, Gretchen Rubin, Patrick Bet-David, Robert Greene, Naveen Jain and many more inspiring & innovative individuals. <br /><br />Learn More: <a href=\"https://www.markmetry.com\" rel=\"noopener\">https://www.markmetry.com</a>",
      "The Podcast behind the Science and Design of Virtual Reality and Spatial Computing. \n\nBy combining our background in Cognitive Science and VR Research, we break down important Neuroscience to extract Design principles. \n\nEach week, we feature the companies, founders, and researchers that are shapers of this Immersive Tech Industry.\n\nJoin our Discord community for Episode discussions, guest suggestions, and listener-only meetups!: https://discord.gg/rrgnxEk",
      "A podcast for the non-technical about cryptocurrency, blockchain, Bitcoin, Ethereum, Litecoin, Altcoins, and more.",
      "The World Crypto Network is an independent media organization that keeps you up to date with the latest news on Bitcoin and cryptocurrency. The WCN is at the center of a rapidly growing community of cryptocurrency enthusiasts and is always focused on bringing you up to date information from the world of Bitcoin. The World Crypto Network is brought to you by the kind donations from the Bitcoin and cryptocurrency community. If you would like to help support the WCN, please send Bitcoin donations to: 3NqhJSAikoFiYmZm3ACGzdw9Lr86ZiLT7K For the full World Crypto Network experience, please visit us at <a href=\"http://www.worldcryptonetwork.com\">www.worldcryptonetwork.com</a>",
      "The Bitcoin Game, hosted by Rob Mitchell, is a podcast dedicated to exploring Bitcoin and cryptocurrency topics. Part of the Let's Talk Bitcoin Network since 2014.",
      "Events in crypto take place at warp speed. This weekly crypto podcast reveals how the marquee names in crypto are reacting to the week’s top headlines. With host Laura Shin, the guests also discuss what they’re thinking about these days and reveal what they believe is on the horizon in crypto. Disclosure: I'm a nocoiner.",
      "Crypto Radio is a podcast about blockchain technology and cryptocurrency investing. We interview the top thinkers and entrepreneurs in the industry, and cover topics like bitcoin and ethereum, news, technology developments, investing, trading, and ICOs.",
      "The Cryptoshow gives you all the insights on cryptocurrencies, blockchain, ICOs, Bitcoin, Ethereum, Dash, decentralization and Co.",
      "The Average Consumer's Guide to Cryptocurrency",
      "Flippening is for cryptocurrency investors. Each week we discuss the cryptocurrency economy, new investment strategies for maximizing returns, and stories from the front lines of financial disruption.  Flippening is for a new class of investors that were not part of the financial services world before bitcoin, but got into finance because of their passion for cryptoassets, blockchain, altcoins, and distributed ledger technology.",
      "Let's Talk ETC! provides timely news about ETC (Ethereum Classic) and related technologies including: Ethereum, Bitcoin, blockchains and more.",
      "A weekly podcast about anything and everything having to do with Bitcoin!\n\nFor access to all of my past episodes via the Let's Talk Bitcoin Podcast Netword,  Go here:\n\nhttp://feeds.feedburner.com/ltb/BAG\n\nThanks y'all!\n\nJohn Barrett",
      "Epicenter brings you in-depth conversations about the technical, economic and social implications of cryptocurrencies and blockchain technologies. Every week, we interview business leaders, engineers academics and entrepreneurs, and bring you a diverse spectrum of opinions and points of view. \n\nEpicenter is hosted by Sebastien Couture, Brian Fabian Crain, Meher Roy, Sunny Aggarwal, and Friederike Ernst. Since 2014, episodes have been downloaded over 4 million times.",
      "Podcast by Arthur Falls",
      "Learn and Earn",
      "Technologists and crypto-enthusiasts Joel Comm and Travis Wright attempt to demystify the world of bitcoin, blockchain, litecoin, ethereum, alt-coins, token generation events, and ICOs in this podcast for cryptocurrency newbies.",
      "Hear from the top traders, investors and insiders of the digital currency space",
      "Crypto assets and blockchain technology are about to transform every trust-based interaction of our lives, from financial services to identity to the Internet of Things. In this podcast, host Laura Shin, an independent journalist covering all things crypto, talks with industry pioneers about how crypto assets and blockchains will change the way we earn, spend and invest our money. Tune in to find out how Web 3.0, the decentralized web, will revolutionize our world. Disclosure: I'm a nocoiner.",
      "We see lots of movies and TV shows where hackers can infiltrate our lives with just a few keystrokes. But is it real? We’re here to find out. Malicious cat photos, sketchy Wi-Fi networks, rogue rentals, all-knowing webcams - those are just a few topics tackled in Hackable?, where we let our hackers shed light on just how secure we really are.\n\nWinner of Best Branded Podcast - 10th Annual Shorty Awards.",
      "Get the latest in technology news for your weekday commute. The Wall Street Journal's reporters and editors highlight leading companies, new gadgets, consumer trends and cyber issues. From San Francisco to New York to the hottest conferences, our journalists help you stay plugged in..",
      "The a16z Podcast discusses tech and culture trends, news, and the future – especially as ‘software eats the world’. It features industry experts, business leaders, and other interesting thinkers and voices from around the world. This podcast is produced by Andreessen Horowitz (aka “a16z”), a Silicon Valley-based venture capital firm. Multiple episodes are released every week; visit a16z.com for more details and to sign up for our newsletters and other content as well!",
      "Hello! This is The Vergecast, the flagship podcast of The Verge... and your life. Every Friday, Nilay Patel, Dieter Bohn, and Paul Miller make sense of the week's tech news with help from our diverse and wide-ranging staff. And on Tuesdays, Nilay hosts in-depth, one-on-one interviews with major technology leaders. Join us every week for a fun, deeply nerdy, often off-the-rails conversation about what's happening now (and next) in technology and gadgets.",
      "Kara Swisher, Silicon Valley’s most revered journalist, hosts candid interviews with tech execs, politicians, celebrities and more about their big ideas and how they’re changing our world. Produced by Recode and the Vox Media Podcast Network.",
      "Discover what comes next with this in-depth look at how science and technology are revolutionizing the way we live, work and play. Join our award-winning team of journalists as we crisscross the country to interview the leaders and luminaries reshaping our world.",
      "Is your phone watching you? Can texting make you smarter? Are your kids real? Note to Self explores these and other essential quandaries facing anyone trying to preserve their humanity in the digital age. \r\nWNYC Studios is a listener-supported producer of other leading podcasts, including Radiolab, Death, Sex & Money, Snap Judgment, Here’s the Thing with Alec Baldwin, Nancy and many others.\r\n© WNYC Studios",
      "Guy Raz explores the emotions, insights, and discoveries that make us human. The <em>TED Radio Hour</em> is a narrative journey through fascinating ideas, astonishing inventions, fresh approaches to old problems, and new ways to think and create."
    ]
  }